[{"genres": [9], "name": "Timeball", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/babkx4zwxk38ivvj85g7.jpg", "width": 220, "cloudinary_id": "babkx4zwxk38ivvj85g7", "height": 264}, "summary": "Get wrapped up in this mind-bending game that will test your mental agility. The action seems simple -- just keep a ball rolling through a winding maze by shifting around pieces of tubing. But the action is intense! Race against time and the track to keep the ball from crashing. There are 100 challenging levels -- plus the unique edit feature lets you build your own puzzles!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gdb4fobvzadksailfqib.jpg", "width": 256, "cloudinary_id": "gdb4fobvzadksailfqib", "height": 239}], "id": 7791}, {"genres": [8], "name": "Bonk's Adventure", "videos": [{"video_id": "jpturNJSjK0", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yq9labghmlkshdatwkl0.jpg", "width": 250, "cloudinary_id": "yq9labghmlkshdatwkl0", "height": 247}, "summary": "Bonk's Adventure was developed by Red Company and Atlus and released on the TurboGrafx-16 in 1989 before being ported to the NES, Game Boy and Amiga. It is a 2D platform game that became quite popular, with subsequent remakes and sequels spawning from the game. It was later included in Nintendo's Virtual Console service as well as the PlayStation Store.", "storyline": "Bonk, the title character, is a caveboy who battles various prehistoric creatures by \"bonking\" them with his large and invincible forehead. Bonk must rescue the Princess Za, who has been kidnapped by King Drool, the main villain of the game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/alc8scpk7thwjpuj1ypr.jpg", "width": 256, "cloudinary_id": "alc8scpk7thwjpuj1ypr", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/feklfjsgomilb9uofh15.jpg", "width": 256, "cloudinary_id": "feklfjsgomilb9uofh15", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ifv7cm1uqlx6wkr07fcm.jpg", "width": 256, "cloudinary_id": "ifv7cm1uqlx6wkr07fcm", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yyirhulsdgwupsaqov5r.jpg", "width": 320, "cloudinary_id": "yyirhulsdgwupsaqov5r", "height": 256}], "id": 7794}, {"genres": [8], "summary": "In the Game Boy version of this title, Bonk can turn into one of three unique heroes: Master Bonk, Hungry Bonk, or Stealth Bonk. Becoming Master Bonk dresses Bonk in a cape and provides him with Vulcan-esque ears, and gives him the ability to move faster and jump higher. Becoming Hungry Bonk gives Bonk an animalistic appearance with evil eyes and a mouth full of razor-sharp teeth, and gives bonk the ability to chew enemies to death, as well as providing him with a much stronger head-butt that can kill nearby foes. Becoming Stealth Bonk dresses Bonk in a striped jail outfit, and gives him the ability to enter special locked doors that lead to areas such as the bank, where Bonk can collect Smileys, the butcher's, where Bonk can eat more slabs of meat in hope for a different power-up, and jail, where Bonk loses a portion of his Smileys. \n \nGrabbing one of many tulips scattered throughout the game carries Bonk to a special bonus stage where he can face off against Mechabonk -- a RoboCop-esque version of Bonk—in a best-of-three battle to \"bonk\" one another off the edge of a small stage. Winning two rounds provides Bonk with an extra life, while a loss transforms Bonk into Wounded Bonk, where Bonk resembles a mummy and takes twice as much damage as usual. \n \nThe game overall is very similar to games in the Mario series, providing linear, side-scrolling action, multiple power-ups, and several small boss confrontations leading up to a final boss. Its treatment of power-ups is similar as well: taking a hit while powered-up causes Bonk to take no damage but instead lose his power. For those who struggle with the game, the game offers passwords after game-overs so the player does not need to start over from the beginning.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i4dhn1ay7tmqcrmfs5bu.jpg", "width": 256, "cloudinary_id": "i4dhn1ay7tmqcrmfs5bu", "height": 302}, "id": 7795, "name": "Bonk's Revenge"}, {"genres": [31], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hang5s0piqg8bwk5ptov.jpg", "width": 250, "cloudinary_id": "hang5s0piqg8bwk5ptov", "height": 292}, "id": 8563, "name": "J.B. Harold Murder Club"}, {"genres": [14, 33], "summary": "It's wrestling mayhem out of control! Five maniacs hit the mat in a no-holds-barred, free-for-all brawl with no rules, no refs and absolutely no mercy! Team up with friends to nail opponents. Now look out! They're coming after you! Smash 'em, bash 'em and throw 'em over the ropes! The sound is so intense you'll feel every crushing hit, every cracking bone. It's furious, non-stop action for up to five players ... a winner-take-all gang fight for survival!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ikjcylxero1pb1sl9clj.jpg", "width": 640, "cloudinary_id": "ikjcylxero1pb1sl9clj", "height": 750}, "id": 8938, "name": "Battle Royale"}, {"genres": [8, 31], "name": "Castlevania: Rondo of Blood", "videos": [{"video_id": "Yg_HGn-wLo4", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zysq8ouors4gdwt2zvcp.jpg", "width": 1411, "cloudinary_id": "zysq8ouors4gdwt2zvcp", "height": 1427}, "summary": "In Castlevania X: Rondo of Blood, the player takes control of Richter, the ultimate Vampire Killer, guiding him through a total of nine stages filled with treacherous traps and hidden secrets. Using your legendary whip – passed on from generations of Belmonts – and a powerful selection of Item Crash attacks, it's up to you to destroy Dracula and his evil horde. What's more, rescuing MARIA at some juncture in the game allows you to use her as a playable character for even more vampire-slaying fun.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/naudqcbhnh0o9gjq81sq.jpg", "width": 1197, "cloudinary_id": "naudqcbhnh0o9gjq81sq", "height": 851}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rhubtuvs9zlmoth6btgk.jpg", "width": 1201, "cloudinary_id": "rhubtuvs9zlmoth6btgk", "height": 861}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ewc6hhr1wlkl8jzv80og.jpg", "width": 1197, "cloudinary_id": "ewc6hhr1wlkl8jzv80og", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qyajxtavsfs8ygg7ugpa.jpg", "width": 1047, "cloudinary_id": "qyajxtavsfs8ygg7ugpa", "height": 769}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mgwagxs4eezp6wjmdqwz.jpg", "width": 1199, "cloudinary_id": "mgwagxs4eezp6wjmdqwz", "height": 863}], "id": 1139}, {"genres": [5], "name": "Atomic Robo-Kid", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/usgr4nqqnaghhx7iiewk.jpg", "width": 588, "cloudinary_id": "usgr4nqqnaghhx7iiewk", "height": 716}, "summary": "The cutest bravest Robokid is here!\n\nThe Atomic Robokid has just graduated from the Universal University of Space Combat and is on his first mission- to travel deep into enemy territory and destroy everything that gets in his way.\n\nTrundle through subterranean passageways sprinkled with metal and bones, black and rubbery blobs, floating space mines and fighter satellites. Jet through mazes of terrifying terrain and get caught in a cube with a horrific hybrid!\n\nThis kid will go where no man dares to go. Are you brave enough to go with him?", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/aob3o0a9gces4ed2k0vn.jpg", "width": 320, "cloudinary_id": "aob3o0a9gces4ed2k0vn", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ycquaq120tps8p4hdbdj.jpg", "width": 256, "cloudinary_id": "ycquaq120tps8p4hdbdj", "height": 192}], "id": 11921}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cmgve3kytgfcpwfqebj3.jpg", "width": 640, "cloudinary_id": "cmgve3kytgfcpwfqebj3", "height": 733}, "genres": [8], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/q2dbatnrxxlmmyz5klf4.jpg", "width": 320, "cloudinary_id": "q2dbatnrxxlmmyz5klf4", "height": 256}], "id": 11930, "name": "Baby Jo In ''Going Home''"}, {"genres": [14], "name": "Ballistix", "videos": [{"video_id": "o4nLeC6ooK8", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lix1d0duc6jgz0yq0a1y.jpg", "width": 300, "cloudinary_id": "lix1d0duc6jgz0yq0a1y", "height": 386}, "summary": "Ballistix is a video game created by Martin Edmondson for the Amiga and Atari ST and published by Psyclapse in 1989. It was also converted to a number of other home computers in the same year and the PC Engine/TurboGrafx-16 console in 1991. It is a fictional futuristic sport involving directing a puck to a goal by shooting small balls at it.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/owtvbmmuwnngps2or6tu.jpg", "width": 320, "cloudinary_id": "owtvbmmuwnngps2or6tu", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/czkfb1nnu8g0cibgv6ce.jpg", "width": 320, "cloudinary_id": "czkfb1nnu8g0cibgv6ce", "height": 256}], "id": 5878}, {"genres": [10], "name": "Chase H.Q. II: Special Criminal Investigation", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ozugodugr6iti7w7kvcc.jpg", "width": 640, "cloudinary_id": "ozugodugr6iti7w7kvcc", "height": 777}, "summary": "Chase H.Q. II- Special Criminal Investigation- continuing where Chase H.Q. left off.\n\nYour mission is to track down, chase and apprehend the dangerous criminals.\n\nIt's faster- explosive power sends you bulleting through various terrains- hold the line or plough the field! It's tougher- the criminals wield some heavy hardware- but so do you! You can shoot but you must dodge their flak... heavy gunfire, trucks unloading their cargo onto your bonnet... it's the meanest pursuit game to hit the micro screen.\n\nThe extra features will leave you gasping for extended play- weather changes, bodyguard squads, grenade lobbing bikers, gun-choppers... just play it!... we dare you to stop!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pbktskmj5kk3zgqlmguj.jpg", "width": 320, "cloudinary_id": "pbktskmj5kk3zgqlmguj", "height": 256}], "id": 11999}, {"genres": [5, 10, 33], "name": "Chase H.Q.", "videos": [{"video_id": "3-QvpB1cIow", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/e5kf5whqwgdch9zopxt8.jpg", "width": 522, "cloudinary_id": "e5kf5whqwgdch9zopxt8", "height": 640}, "summary": "At the start of each level the player is informed who they are pursuing, a great distance away: They must apprehend the criminal before their time limit expires. The criminal's car is constantly moving away, so if the player repeatedly crashes or drives too slowly, the criminal will escape. At some points during the game the road splits, and the correct turn must be taken, otherwise it will take longer to catch the criminal. When their vehicle is reached, the time limit is extended; the vehicle must be rammed a number of times until the criminal is forced to stop, then is arrested.\n\nThe game includes five levels. As both the initial time limit to reach the criminal and the time extension to ram the criminal are just 60 seconds, the game is very short - a player who is able to finish the game on one credit will enjoy at most ten minutes of game-play.\n\nInterestingly enough when Nancy at Chase HQ (at the start of every level) calls on the radio the frequency is always 144.X (various)Mhz. This is actually the 2-meter band of amateur or ham radio frequencies.\n\nAlthough superficially similar in technology to Sega's Outrun, Chase HQ features significant technical advancements over that title in the presentation of perspective, hills and track splits.", "storyline": "The player assumes the role of a police officer named Tony Gibson, member of the \"Chase Special Investigation Department.\" Along with his partner, Raymond Broady, he must stop fleeing criminals in high-speed pursuits.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ir6drqnaorndfzrhnut3.jpg", "width": 320, "cloudinary_id": "ir6drqnaorndfzrhnut3", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/h0yyoue9vgh54eut3sje.jpg", "width": 256, "cloudinary_id": "h0yyoue9vgh54eut3sje", "height": 224}], "id": 6802}, {"genres": [5], "summary": "Dragon Spirit (Doragon Supiritto) is a vertical scrolling shooter arcade game that was released by Namco in 1987 and licensed to Atari Games for its American manufacture and distribution. \n   In the kingdom of Mitgult, a serpent demon named Zawell escapes imprisonment after a thousand years, and kidnaps Princess Alicia. A soldier named Amul is chosen to rescue her and destroy Zawell. He points his sword skyward and transforms into a powerful blue dragon. He can breathe fire and drop bombs, as well as collect up to thirteen additional powers during his journey. Amul must fight nine of Zawell's mightiest beasts, one at the end of each stage, before facing Zawell himself.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lgqhtzurepj3ww6zwt6l.jpg", "width": 850, "cloudinary_id": "lgqhtzurepj3ww6zwt6l", "height": 1099}, "id": 12055, "name": "Dragon Spirit"}, {"genres": [13], "name": "Falcon", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zpxjrxebzvig4fszihjn.jpg", "width": 895, "cloudinary_id": "zpxjrxebzvig4fszihjn", "height": 640}, "summary": "When you climb into the cockpit of the F-16 Fighting Falcon, get set for the \"flight of your life\" as the powerful FALCON F-16 takes you streaking across the sky at Mach 2.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xpsgqalgtopyzo9oylhw.jpg", "width": 710, "cloudinary_id": "xpsgqalgtopyzo9oylhw", "height": 443}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fpmegchofzavkbjyngl6.jpg", "width": 710, "cloudinary_id": "fpmegchofzavkbjyngl6", "height": 443}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/k0l5xiv7n3amnw0kwzoq.jpg", "width": 710, "cloudinary_id": "k0l5xiv7n3amnw0kwzoq", "height": 443}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jb9o6fk3k7ir90r5boys.jpg", "width": 710, "cloudinary_id": "jb9o6fk3k7ir90r5boys", "height": 443}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/izasfsbrxvxcnybpoiwl.jpg", "width": 320, "cloudinary_id": "izasfsbrxvxcnybpoiwl", "height": 256}], "id": 12088}, {"genres": [4, 8, 25, 33], "name": "The Ninja Warriors", "videos": [{"video_id": "r5GfhzRWKfQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cf5fkyixwyauxmvickfh.jpg", "width": 220, "cloudinary_id": "cf5fkyixwyauxmvickfh", "height": 312}, "summary": "The Ninja Warriors presents side-scrolling hand-to-hand combat. Players take control of Kunoichi (player 1) or Ninja (player 2) and fight wave after wave of Banglar forces across five levels. Button 1 attacks with a short-range kunai slash, while button 2 fires long-range shurikens that are limited in supply.\n\nNinja and Kunoichi each have different combos — one to be executed normally, and another that can be performed while crouching — and specific moves such as dash attacks, throwing, stabbing and air strikes. On the screen, separate from the life bar, there is a special energy bar that fills itself as the main character progress. When full, the bar will allow the player to perform a special move. If the character suffers some damage, the special bar will reset, starting a new count-up.", "storyline": "The game is based in a dystopian future where Banglar, the President of the United States in 1993, issues martial law on the nation, with the military having total control over the law. A group of anarchist scientists led by Mulk decide that it is time to revolt against the government. Knowing full well that approaching the military themselves could be considered an all out suicide mission, the scientists create two androids that can sustain various forms of damage in order to do the mission for them. The robots, code named \"Kunoichi\" (red female) and \"Ninja\" (blue male), are sent by the scientists in order to end Banglar's tyranny once and for all.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vpdsnzvsi6qqyy2bcgot.jpg", "width": 864, "cloudinary_id": "vpdsnzvsi6qqyy2bcgot", "height": 224}], "id": 5406}, {"genres": [8, 33], "name": "Ninja Spirit", "videos": [{"video_id": "1L0qAODzG5Y", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xjk0yltenybhtkc1fgr2.jpg", "width": 1075, "cloudinary_id": "xjk0yltenybhtkc1fgr2", "height": 1037}, "summary": "There are a total of seven stages varying from woodlands, wastelands, swamps, temples and cliffs. Each stage begins with the player slashing his way to the end, until he confronts a level boss.\n\nThe ninja is always armed with the sword Righteous Cloud which can be fluidly used to attack in all directions. Extra weapons include the Swirling Leaf (shurikens), the Bamboo Thunder (bombs), and the Rising Dragon (kusarigama). There are also several powerup items, such as one unleashing multiple ninja ghosts to assist the player.", "storyline": "The game's hero, Gekkou (月光?), is a young ninja who lost his father to a mysterious half-man half-beast creature. The plot of Ninja Spirit is based on the quest of his revenge in an alternative feudal Japan.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/wfbzjfeago2vozrsputn.jpg", "width": 320, "cloudinary_id": "wfbzjfeago2vozrsputn", "height": 256}], "id": 6819}, {"genres": [5], "name": "Operation Wolf", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mbgra6j17llekzp9qqkc.jpg", "width": 906, "cloudinary_id": "mbgra6j17llekzp9qqkc", "height": 640}, "summary": "In the steamy jungles of South America, heavily armed extremists are holding innocent civilians prisoner. Little do these terrorists know that real terror is about to land on their front porch! The sound of rotor blades and staccato bursts of gunfire echo through the valleys. Terrorists be warned! Operation Wolf is going to teach you what terror is all about!\n\nOperation Wolf consists of six missions, which are displayed on the Operations Map Screen. A mission is completed when all enemy forces are reduced to zero. The current level is completed when you escape from the airport with the prisoners. Your injury level increases when the enemy hits you. The game automatically ends if the injury indicator on the right side of the screen becomes completely red. You can reduce your injury level by getting power drinks.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yifvjbtqmpdybqqdddch.jpg", "width": 320, "cloudinary_id": "yifvjbtqmpdybqqdddch", "height": 200}], "id": 12190}, {"genres": [5], "summary": "Tenseiryuu: Saint Dragon (天聖龍 SAINT DRAGON?) is a side-scrolling shoot 'em up video game originally released as a coin-op by Jaleco in 1989.[1] It was converted to several home computer platforms by Storm Entertainment in 1990.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cdjop3zrpxjahkmxzugc.jpg", "width": 640, "cloudinary_id": "cdjop3zrpxjahkmxzugc", "height": 758}, "id": 12207, "name": "Saint Dragon"}, {"genres": [5, 33], "name": "R-Type", "videos": [{"video_id": "P-WPX4AsvOE", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zlanjdqihtrf4kcwybtp.jpg", "width": 300, "cloudinary_id": "zlanjdqihtrf4kcwybtp", "height": 424}, "summary": "R-Type is set in the 22nd century, and the player flies a futuristic fighter craft called the R-9a \"Arrowhead\", named for its shape, and because it is the ninth model in the 'R' series of fighter craft (but it is the first of the series to actually be used in combat; the previous models were all prototypes). The mission is to 'blast off and strike the evil Bydo Empire'. The R- in the series title originally stood for \"ray\", as in a ray of light. It was a reference to the many different types of ray-like weapons in the first R-Type. his was later retconned in R-Type Final to refer specifically to the production code as well as a term of endearment for the player fighter craft, the \"Round Canopy\".\n\nThe original R-Type was well received by most gaming critics. However, it was also infamous for its relentless difficulty. It earned 7th place in IGN's Top 10 most difficult games to beat. The gameplay of R-Type is noticeably distinct among shoot 'em ups. Invariably the player will lose, not because of an inequality in firepower, but because of the design of the levels themselves. There is usually a 'correct' way to get through a level, but players must learn these by experience - i.e. by losing and restarting from earlier in the level. The game innovated with its weapon system compared to contemporary shooters, featuring a chargeable shot (beam-meter), and detachable 'force' pod; levels were designed to require different tactics and ideal weapons (air-air, diagonal, or air-ground laser).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zakycibfdds0g86qnt0n.jpg", "width": 320, "cloudinary_id": "zakycibfdds0g86qnt0n", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j3ultnxeynvfhsngkqxf.jpg", "width": 256, "cloudinary_id": "j3ultnxeynvfhsngkqxf", "height": 256}], "id": 6840}, {"genres": [5, 8, 33], "name": "Pang", "videos": [{"video_id": "YveTWu_5suQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tijyh0ruadzgfnucjgja.jpg", "width": 1024, "cloudinary_id": "tijyh0ruadzgfnucjgja", "height": 768}, "summary": "There are 50 stages at 17 locations: Mt. Fuji, Mt. Keirin, the Temple of the Emerald Buddha, Angkor Wat, Ayers Rock, the Taj Mahal, Leningrad, Paris, London, Barcelona, Athens, Egypt, Kenya, New York, Maya ruins, Antarctica, and finally Easter Island.\n\nEach location has a unique background that shows the area's most famous landmarks. The stages contain a different layout of blocks, some that disappear after being shot, others that do not, and still others that are hidden and can reveal bonuses.\n\nThe stages start with differing numbers and sizes of balloons. The largest balloon divides for the first three times it is popped; after the fourth and smallest balloon is popped it vanishes. Each player starts with a single harpoon. When a balloon is popped, special weapons may drop down.\n\nAt a certain point in the stage, a food item will drop down that is worth several thousand bonus points.\n\nIf a player touches a balloon of any size, the player dies and both players must start the stage again.\n\nWhen both players touch a balloon at the same time, only Player 1 will lose a life but this is somewhat offset because when both players reach a bonus or weapon simultaneously only Player 1 will get it.\n\nPlayers start with 3-5 lives depending on the dip switch setting. Extra lives are also given when certain point totals have been accumulated. The stage ends when all of the balloons are successfully cleared. The game ends after all stages have been completed and our heroic duo ride their jeep into the sunset on an Easter Island beach.\n\nIn some later versions, there are more than 17 locations.", "id": 6823}, {"genres": [11, 13, 15], "name": "Populous", "videos": [{"video_id": "plX4VzG9_g4", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gdlnffdq2tmdodal7n34.jpg", "width": 256, "cloudinary_id": "gdlnffdq2tmdodal7n34", "height": 312}, "summary": "Miracles are child's play. Earthquakes are serious fun. The all-powerful can perform miracles in their sleep. But omnipotence isn't what it used to be. These days, it takes awesome natural disasters to dominate a world. You give them good land. You tell them when to farm and when to fight. You make them content beyond their wildest dreams. But then they become raging arsonists. What's a deity to do? Disasters are your divine prerogative - volcanoes, quakes, swamps. For stubborn non-believers, nothing beats a flood for spring cleaning. Cruel ice, lush grassland, parched desert... With 500 worlds, a deity's work is never done.\n\nPopulous is the original god-game, a strategy title that lets you shape the isometric isometric world and the fates of its inhabitants. Be sure to check out one of Bullfrog's earliest classics, from the mind of Peter Molyneux!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zxr5cfdeuroh2eeafven.jpg", "width": 640, "cloudinary_id": "zxr5cfdeuroh2eeafven", "height": 400}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eug5cxp0i1rcrfz4nm4b.jpg", "width": 768, "cloudinary_id": "eug5cxp0i1rcrfz4nm4b", "height": 512}], "id": 248}, {"genres": [5, 8], "name": "Turrican", "videos": [{"video_id": "HGxMDxGJXuo", "name": "Game intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wahohxfywsp9anuwiavz.jpg", "width": 1024, "cloudinary_id": "wahohxfywsp9anuwiavz", "height": 1454}, "summary": "Turrican is a 1990 video game programmed and designed by Manfred Trenz. It was first developed for the Commodore 64 by Rainbow Arts, but was ported to other systems later. In addition to concept design and character creation, Trenz personally programmed Turrican on the Commodore 64. A sequel, Turrican II, followed 1991 for the Commodore 64 and other platforms.", "storyline": "The lost colony of Alterra is a completely man-made lifeworld abandoned long ago in a nearby galaxy. Alterra is actually five colonies in one. Each self-contained habitat has been separately bio-engineered by a powerful ecosystem generation network known as a Multiple Organism Unit Link. MORGUL, for short. Early colonists used MORGUL to render Alterra inhabitable. But a cataclysmic quake severed all system interface functions, and MORGUL murderously rebelled. The few colonists lucky enough to escape told a grim tale of a higher intelligence gone berserk.\nFor generations, mankind sought a return to Alterra. Finally, genetic science created a saviour: Turrican, a mutant warrior, bio-engineered for the task of planetary reclamation. In the meantime, MORGUL has diligently twisted Alterran life forms to his brutal, destructive purposes. Thus, Turrican's challenges consist of eliminating hostile organisms from Alterra's five multi-level worlds and, finally, destroying the three faces of MORGUL.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ifibpnnedo5wpfwny549.jpg", "width": 255, "cloudinary_id": "ifibpnnedo5wpfwny549", "height": 158}], "id": 5164}, {"genres": [33], "name": "Titan", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ofcl49fiymdm3raelmu1.jpg", "width": 595, "cloudinary_id": "ofcl49fiymdm3raelmu1", "height": 727}, "summary": "Titan takes the Breakout concept and adds another dimension by allowing the object the player controls to be able to move on the Y-axis in addition to the old X-axis. The display will follow the small square which the player controls as it moves on a map where there are objects whom your goal is to make a ball hit. The player controls a small rectangle only slightly larger than the size of the ball itself and in addition to hitting the \"bricks\" to destroy them has to keep the ball away from dangerous hazards which will kill the ball if it hits.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/tlzd0wyxqyjeuawwnnw5.jpg", "width": 320, "cloudinary_id": "tlzd0wyxqyjeuawwnnw5", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vu29kqgewkpjin8ft4vh.jpg", "width": 320, "cloudinary_id": "vu29kqgewkpjin8ft4vh", "height": 256}], "id": 12487}, {"genres": [5], "summary": "Aero Blasters: Trouble Specialty Raid Unit is a 1990 horizontally scrolling shoot 'em up video game developed and published by Kaneko and licensed to Namco. The game was originally released in the arcades in 1990 and was subsequently released for the PC Engine/TurboGrafx-16 (as Aero Blasters) and Sega Mega Drive/Genesis (as Air Buster in North America) in 1990 and 1991 respectively. \n \nIn Air Buster, the player controls a fighter jet also designed for space travel and shoots enemies, collects power-ups, and defeats bosses to advance levels. As a console game, Air Buster had the distinction of being two player simultaneous, which was rare among side scrolling shooters on home consoles at the time; all games in the Thunder Force, Gradius, and R-Type series were only 1 player on the home consoles.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l1tulnhvq4omjrlwh0d3.jpg", "width": 500, "cloudinary_id": "l1tulnhvq4omjrlwh0d3", "height": 600}, "id": 12491, "name": "Aero Blasters"}, {"genres": [30], "summary": "Imagine a living pinball machine...with aliens and outlandish worlds to throw at you. And turbo-charged, speed-of-light pinball action. You control the flippers and ball speed to defeat the Slime, the Tentacloid and Scorpion. Go for the eyes! This is full-tilt, out-of-this-world action! Surrealistic graphics plus true-to-life, earsplitting arcade pinball sound.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x0qmeswjdz3qlr6kholc.jpg", "width": 1174, "cloudinary_id": "x0qmeswjdz3qlr6kholc", "height": 1174}, "id": 12492, "name": "Alien Crush"}, {"genres": [8], "id": 12493, "name": "Bonk III: Bonk's Big Adventure"}, {"genres": [4, 8, 25, 33], "name": "Jackie Chan's Action Kung Fu", "videos": [{"video_id": "E-r5c3mAgYk", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nbkwkc65hz7zkustfplp.jpg", "width": 744, "cloudinary_id": "nbkwkc65hz7zkustfplp", "height": 1082}, "summary": "Jackie and his sister, Josephine, are tough on tyrants. As China's supreme kung fu champs, they guard their country against the Prince of Sorcerers, who lurks just beyond the Great Wall. It comes as no surprise when this fiend and his ghouls try yet again to seize China for themselves. But this time they're clever, casting a spell over Josephine which causes her to vanish into thin air! Jackie is in shock! How can he save his country without his sister? The two have been an unbeatable team! Meanwhile, a demon horde led by the Sorcerer storms the Great Wall and prepares to establish a fierce empire. At the urging of his revered Master, Jackie must now battle the dreaded Sorcerer and rescue Josephine. Maybe he can learn a little magic on his own, because he's going to need all the help he can get!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/u2bmzlkns6igho2t1mky.jpg", "width": 256, "cloudinary_id": "u2bmzlkns6igho2t1mky", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oys6a7hykqvzjygzxh5l.jpg", "width": 256, "cloudinary_id": "oys6a7hykqvzjygzxh5l", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q9ilvexkblub3zrtvm2v.jpg", "width": 256, "cloudinary_id": "q9ilvexkblub3zrtvm2v", "height": 224}], "id": 12522}, {"genres": [33], "name": "Volfied", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xiq3qwhixpmxouvy8v41.jpg", "width": 941, "cloudinary_id": "xiq3qwhixpmxouvy8v41", "height": 1347}, "summary": "Once in the game, using the arrow keys you can move the 'Scanner' ship around the 'Shield Line' at the parameter of the playing area. While moving around this edge the ship is protected from the aliens by a shield indicated by a glowing circle around the ship. This shield is not infinite and care should be taken to complete each level as quickly as possible. A counter indicates the level of shield that you have: when it reaches zero then any contact with an alien is deadly whether you are on the 'Shield Line' or not.\nThe idea of the game is to cut areas out of the screen without touching any of the aliens. This is done by pressing the SPACE key which initiates the 'Laser Cutter' and moving off the 'Shield Line' and rejoining it somewhere else. While you are in the process of drawing a line, your shield is inactive and touching an alien is fatal. Similarly, if one of the aliens touches the line then it will send a charge down the line towards you and you must quickly return to the safety of the edge before it reaches you.\n\nWhen you rejoin the 'Shield Line' the area that does not contain the 'Boss' alien will be filled (points are gained by trapping the other aliens) and the 'Shield Line' will be adjusted to surround the area that is left. The level is completed when a certain percentage of the total area has been filled in. This percentage starts at 80% but may increase in the later levels.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/trjrlkgoowskv2ezbekv.jpg", "width": 320, "cloudinary_id": "trjrlkgoowskv2ezbekv", "height": 200}], "id": 4469}, {"genres": [8], "name": "Impossamole", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/da3jgjoorg21ukvjfc6z.jpg", "width": 640, "cloudinary_id": "da3jgjoorg21ukvjfc6z", "height": 777}, "summary": "For Monty Mole, a day at the beach turns into the adventure of his life when he's beamed aboard an alien spacecraft. He's transformed into Impossamole, with super powers to save their planet from the evil Vlarg! Now you're up to your cape in Vlarg's monster bosses with crack-up creatures ready to nail your tail! Power up your laser to blast the Dragon Boss. Bomb the Abominable Snowman. Then trash the Venus Moletrap before he has you for lunch. Swim, fly and blast through five wacky action-packed worlds. The fiendish Vlarg awaits your final desperate battle!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yd5c0b6kprvq6bcag8nr.jpg", "width": 360, "cloudinary_id": "yd5c0b6kprvq6bcag8nr", "height": 284}], "id": 12611}, {"genres": [10], "name": "Power Drift", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mvzim0hh3t2tm0nfuent.jpg", "width": 583, "cloudinary_id": "mvzim0hh3t2tm0nfuent", "height": 714}, "summary": "Ever wanted to race dune buggies at high speed on a variety of tracks? Power Drift is an arcade racer that gives you the chance to do just that. \n \nThere are 5 tracks to choose from, each with 5 stages. The stages range from cities, to deserts to tracks over water. There are also 12 drivers to pick from, from businessmen to skinheads and mohicans. \n \nYour buggy has 2 gears, high and low. Once the light goes green, just keep the pedal to the metal. You’ll need to place third or higher to continue to the next stage. Be careful not to bump into other buggies or objects next to the road. While you’re buggy can take a pounding, crashing will slow you down. \n \nFinish all 5 stages in a level and you’ll be presented with a bonus level.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vq62lka0suykmscjcm5p.jpg", "width": 1280, "cloudinary_id": "vq62lka0suykmscjcm5p", "height": 720}], "id": 12719}, {"genres": [9], "name": "Shanghai", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iw337grsrs5lz8ms2ssw.jpg", "width": 640, "cloudinary_id": "iw337grsrs5lz8ms2ssw", "height": 819}, "summary": "Shanghai is a computerized version of mahjong solitaire. After winning a game, the tiles reveal the three-dimensional blinking eye of a dragon behind the game screen.[1] The Macintosh and Sega Master System version shows an animated dragon spitting fire.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/he2npmqhix8i6uwg0mu0.jpg", "width": 512, "cloudinary_id": "he2npmqhix8i6uwg0mu0", "height": 512}], "id": 12765}, {"genres": [5], "id": 12838, "name": "P47 Thunderbolt"}, {"genres": [5], "summary": "Side Arms is an Action game, developed by NEC Avenue and published by NEC Interchannel, which was released in 1989.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xdgpi2n1uivyc4eusrmi.jpg", "width": 850, "cloudinary_id": "xdgpi2n1uivyc4eusrmi", "height": 1118}, "id": 12849, "name": "Side Arms: Hyper Dyne"}, {"genres": [5], "summary": "It is your mission, 'Mr. Heli' our hero, to unmask 'The Muddy' who is hiding deep underground and rescue the planet. Clear all the zones including floating green islands, moving rock beds, mysterious underground temples, and much more! The exhilarating air battle and stunning graphics capture the true character of the arcade machine. Play sharp, steer right, keep up with the fight!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yu1z0nq3dtzvmf60edrf.jpg", "width": 320, "cloudinary_id": "yu1z0nq3dtzvmf60edrf", "height": 256}], "id": 10446, "name": "Mr. Heli"}, {"genres": [4, 25], "summary": "This arcade conversion is a beat 'em up in which you (as Lee Wong) must rescue the village children from the evil Ryo Ken Oh. Many levels are horizontally scrolling, although with high ledges to jump onto and follow for a slightly different path. Magic urns containing improved weapons appear frequently. Most enemies are easy to attack and only need one hit to kill, although they come at you in large hordes. Once you get to the indoor sections you will find big enemies with the ability to kill you with one hit, in sections set on multiple levels complete with stairways.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/t4paa5jefx2tpefqgzls.jpg", "width": 630, "cloudinary_id": "t4paa5jefx2tpefqgzls", "height": 825}, "id": 12864, "name": "Tiger Road"}, {"genres": [14], "name": "TV Sports Football", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l54nwoeuypt5xoxdwr3g.jpg", "width": 650, "cloudinary_id": "l54nwoeuypt5xoxdwr3g", "height": 830}, "summary": "So real it … sweats! Strap on your helmet and get ready for a pro football simulation that looks exactly like a Sunday network broadcast. TV Sports: Football features amazing graphics and animation; real arcade action on offense and defense; individual and team statistics; and a 28 team, 16 game schedule with post season playoffs!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vy5ql479u7khzwajf8sx.jpg", "width": 320, "cloudinary_id": "vy5ql479u7khzwajf8sx", "height": 256}], "id": 8671}, {"genres": [14], "name": "TV Sports Basketball", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/g4rrrvkrq7zoy5xz9bgh.jpg", "width": 650, "cloudinary_id": "g4rrrvkrq7zoy5xz9bgh", "height": 830}, "summary": "So real it . . . sweats! Lace up you hightops and get psyched for a fast breaking, in-your-face, full court, 5-on-5 pro basketball simulation that looks exactly like a network broadcast. TV Sports: Basketball gives you total control over an entire squad, including player substitutions and strategic double teaming. Your skills as player and coach will receive their ultimate test as sudden shifts in momentum and fatigue take their toll. Go head-to-head against another human or face an awesome computer opponent. You’ll marvel at the Cinemaware quality animation and graphics; real arcade action on offensive and defensive; individual and team statistics; even the post season playoffs! TV Sports: Basketball is truly Phi Slamma Jamma of basketball simulations!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/minrerwujjbiudqya9vb.jpg", "width": 320, "cloudinary_id": "minrerwujjbiudqya9vb", "height": 256}], "id": 8672}, {"genres": [13], "name": "Gunboat: River Combat Simulation", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wsghcayvxaqpkmd1herh.jpg", "width": 800, "cloudinary_id": "wsghcayvxaqpkmd1herh", "height": 1042}, "summary": "Gunboat is a 3D action simulation of River patrol U.S. Gunboat. Your Gunboat carries a crew of four men. A first-class petty officer who serves as boat captain and pilot. A gunner’s mate, who controls the forward guns. An engine man, who takes care of the engines and serves as midship gunner and a seaman who controls the guns.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bwilzgxlapmu920jcpbx.jpg", "width": 1919, "cloudinary_id": "bwilzgxlapmu920jcpbx", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yeinujggpbi6igsihrem.jpg", "width": 1919, "cloudinary_id": "yeinujggpbi6igsihrem", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dpmvwrauntolihlk5idu.jpg", "width": 1919, "cloudinary_id": "dpmvwrauntolihlk5idu", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/denqiiw263i6xzn7iamt.jpg", "width": 1919, "cloudinary_id": "denqiiw263i6xzn7iamt", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lrrwmffep7a5lhqp3q7a.jpg", "width": 1919, "cloudinary_id": "lrrwmffep7a5lhqp3q7a", "height": 1079}], "id": 12127}, {"genres": [8, 31, 33], "name": "Legend of Hero Tonma", "videos": [{"video_id": "R1a5OwxOfZw", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bcuyklxi81n3luy4mpnu.jpg", "width": 256, "cloudinary_id": "bcuyklxi81n3luy4mpnu", "height": 360}, "summary": "Legend of Hero Tonma (レジェンド・オブ・ヒーロー・トンマ?) is a side scrolling platform game released by Irem to arcades in 1989.", "storyline": "The player controls a caped hero named Tommy in his quest to rescue a princess. Tommy can cast fireballs (which can be upgraded in power) to dispatch enemies, and jump on their heads to temporarily stun them", "id": 10453}, {"genres": [5, 33], "summary": "The gameplay in Galaga '88 is built on the same premise as that of the original Galaga game, but is in many ways more complex and more difficult. The game is divided into a series of 29 Stages distributed through eight Worlds. The starship Galaga accelerates between Stages and Worlds and even to higher dimensions (go to the section on Dimensional Travel below to find out more). \n \nWith the exception of the third and eighth, each World culminates in a Challenging Stage. There are six such stages to engage in any full game, and each begins with the on-screen announcement \"That's Galactic Dancin'!\" and has its own YM2151-generated song to which the enemy formations dance. In any given Challenging Stage, both the design of the enemies and their dancing formations shall vary according to the player's current Dimension. As in Galaga, the objective is to destroy all forty enemies before they fly away off the screen. However, refraining completely from touching any controls for the duration of a Challenging Stage awards a \"secret bonus\" ranging in value from 10000 to 25000 points, and equal to the \"special bonus\" which would have been awarded for destroying all forty enemy aliens instead. \n \nGalaga '88 introduces a variety of new enemies and behaviors. Most of these special enemies are worth varying amounts of bonus points when destroyed. Some enemies can combine into larger enemies which take multiple hits to destroy, while others arrive in eggs, explode in a shower of fireworks, grow with multiple hits, or sport armor which makes them invincible while in formation. Certain enemies drop small formations of tiny creatures that wiggle their way down the screen, and still others can act as escorts to incoming groups of enemies and then quickly dive at the player before leaving the game. Most stages also include various obstacles which appear once the enemy formation has been assembled. These can be destroyed with either one or several shots, and the first one on each stage will leave a \"Warp Capsule\". \n \nAt the start of the game, the player can select how many Galaga starships to start with (one or two), affecting their number of remaining lives. The game ends after the final boss is defeated (or when the player's last ship is destroyed or captured) - in the latter case, the player can continue the game for an additional credit. The Game Over screen shows the player's hit-miss ratio and a visual representation of their progress. If the player reaches Stage 27, the game also shows a picture of the final boss (damaged if defeated, but silhouetted if not). If the arcade operator has set the \"continue\" option to \"on\", the player also cannot continue if he is defeated on Stages 27-29.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dzvnsugtflvzs4qdintw.jpg", "width": 850, "cloudinary_id": "dzvnsugtflvzs4qdintw", "height": 1193}, "id": 15535, "name": "Galaga '88"}, {"genres": [5], "name": "Soldier Blade", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yjvftnoouovgtppozozt.jpg", "width": 280, "cloudinary_id": "yjvftnoouovgtppozozt", "height": 336}, "summary": "Vertical sci-fi shoot ‘em up from the Hudson stable. Soldier Blade sticks to the tried and tested formula of Hudson’s previous games in the 'series', while throwing in some extra graphical effects. This time, the power up system involves collecting coloured pods - you can have three pods in stock at any one time, and the colour of the 'active' pod determines your weapon style. You also have the choice of ejecting a pod at any time, which results in a weapon-specific super attack.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/lrummtonr3vu7dbrtzjt.jpg", "width": 640, "cloudinary_id": "lrummtonr3vu7dbrtzjt", "height": 480}], "id": 15841}, {"genres": [8, 33], "summary": "Hipopo waddles through many cute levels in search of his girlfriend. He rescues other captured hippo-like animals on the way. He throws globes full of water that gushes when it hits a wall or creature. The water attack is exactly like Taito's Bubble Bobble water attack. The game is a 4-way scroller with very large levels and lots of surprises. Many of the levels have moving platforms, collapsing floors and other obstacles.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nzajpxlgbydt1lmhly0g.jpg", "width": 320, "cloudinary_id": "nzajpxlgbydt1lmhly0g", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/falexwjabag5dojauy0u.jpg", "width": 320, "cloudinary_id": "falexwjabag5dojauy0u", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/t0byzerxae0obzptwcnb.jpg", "width": 320, "cloudinary_id": "t0byzerxae0obzptwcnb", "height": 256}], "id": 16750, "name": "Liquid Kids"}, {"genres": [2, 31], "name": "Snatcher", "videos": [{"video_id": "ZuyUShtcn94", "name": "Game intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zuroqlqmzyvy5r0yjshw.jpg", "width": 250, "cloudinary_id": "zuroqlqmzyvy5r0yjshw", "height": 324}, "summary": "Snatcher is a cyberpunk-themed graphic adventure game directed and written by Hideo Kojima and produced by Konami. The setting and story of Snatcher is heavily influenced by cyberpunk and science-fiction media, taking place in a large futuristic dystopian city. The story revolves around an investigator named Gillian Seed assigned to investigate a breed of bioroids known as \"snatchers\", who are killing humans and taking their place in society. The game is set in a primarily first person perspective and uses a menu-based interface that allows the protagonist to interact with his environment. The player can choose to \"Look\", \"Investigate\", \"Talk\", \"Ask\" and \"Move\" (in addition to other options) to acquire key items or receive vital information from other characters. The player can analyze items in Gillian's belongings or show it to other characters. During key points of the game's story, the player must pass shooting sequences to defend Gillian from assailants. These shooting segments use a 3x3 grid which the player can target to fire at enemies. A shooting trainer, called \"Junker's Eyes\", is accessible at Junker HQ that allows the player to measure their accuracy.", "storyline": "On June 6, 1996 (1991 in the Japanese versions), a biological weapon known as Lucifer-Alpha under development in Chernoton, Russia, is released into the atmosphere, resulting in the death of 80% of the Eurasian population which in turn results in the death of half of the world's population. The contaminated area becomes uninhabitable for a decade, when Lucifer-Alpha mutates into a non-lethal form. This tragic event later becomes known as \"the Catastrophe\". Fifty years later, in 2047 (2042 in the Japanese versions), a breed of artificial life-forms or bioroids known as \"snatchers\" began appearing in the artificial island of Neo Kobe City, killing their victims and taking their place in society. Nobody knows exactly what they are or where they come from. As Gillian Seed, an amnesiac working for an Anti-Snatcher task force called J.U.N.K.E.R., the player's goal is to track down the source of the snatchers and discover Gillian's mysterious connections with them. The story takes place in three acts.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xi2sfzss73wkxcz6xx2l.jpg", "width": 800, "cloudinary_id": "xi2sfzss73wkxcz6xx2l", "height": 600}], "id": 5451}, {"genres": [13, 14], "summary": "Jack Nicklaus' Greatest 18 Holes of Major Championship Golf is a golf-simulation video game developed by Sculptured Software, and published by Accolade in 1988.\nThe game features simulations of eighteen holes from renowned golf courses in the United States, Scotland, and England: Four from Augusta National Golf Club, three from Pebble Beach Golf Links, three from the Old Course at St Andrews, two from the Riviera Country Club, two from Baltusrol Golf Club, one from Oakmont Country Club, one from Merion Golf Club, one from Muirfield, and one from Royal Lytham & St Annes Golf Club. In addition, the game contains simulations of two complete Nicklaus-designed 18-hole courses: The Castle Pines Golf Club and The Golf Club at Desert Mountain.\nIt also bears the name and likeness of American professional golfer Jack Nicklaus. Less than two years before the game's publication, Nicklaus won the final major golf championship of his career: the 1986 Masters Tournament. Augusta National Golf Club hosted the tournament. Players can compete against Nicklaus as a computer opponent, or any of eight other computer opponents of varying skill levels.\nJack Nicklaus' Greatest 18 Holes of Major Championship Golf was a commercial success for Jack Nicklaus Productions and Accolade. The two companies developed it into a video game franchise, and Accolade published numerous adaptations and sequels for more than ten years.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s3sktqgfvnyadjmkmphu.jpg", "width": 640, "cloudinary_id": "s3sktqgfvnyadjmkmphu", "height": 911}, "id": 18101, "name": "Jack Nicklaus' Greatest 18 Holes of Major Championship Golf"}, {"genres": [9], "summary": "As Slider, you must stop the poisoning of your homeland, Rozen, by the diabolical Scum lords!", "id": 12911, "name": "Slider"}, {"genres": [5], "summary": "Run… fly… dodge those obstacles, but return fire on wave after wave of attacking aliens. Armed with a really big gun, you have to defend yourself against the alien hordes using your wits to navigate around the screen. But watch out for those end of level bosses! \n \nOriginating in the arcades, Space Harrier is a third-person rail shooter with pseudo-3D graphics, set in the same world as Fantasy Zone. The lone titular hero fights aliens with a fireball-launching cannon, which can also be used to transform the hero into a flying rocket. The protagonist is constantly in motion, but the speed of his movement can be regulated by the player.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jj3psqxcwdq6ea8togkz.jpg", "width": 1401, "cloudinary_id": "jj3psqxcwdq6ea8togkz", "height": 1389}, "id": 12857, "name": "Space Harrier"}, {"genres": [25], "id": 19661, "name": "Götzendiener"}, {"genres": [5], "summary": "\"Virtual Reality\" for your Super NES! \n \nWelcome to the exciting new world of FaceBall 2000, where 3D graphics, first person perspective and 360° maneuverability make you feel like you're inside your video game! What you see is where you are, as you team up, compete with a friend or play alone against computer-controlled opponents. \n \nTransport yourself inside the walls of CyberZone, where you'll be surrounded by menacing enemies lurking in a series of treacherous mazes. Or, enter the Arena where \" Have a Nice Day\" takes on a qhole new meaning in fast-paced rounds of high-tech combat. \n \nWherever you go in FaceBall 2000, it's your chance to wipe the smiles off those annoying happy faces - and maybe a few of your friends - once and for all!", "id": 19701, "name": "Faceball 2000"}, {"genres": [9, 15], "summary": "Shanghai II is a Puzzle game, developed and published by SunSoft, which was released in Japan in 1990.", "id": 21549, "name": "Shanghai II"}, {"genres": [12], "summary": "In this epic role-playing game, you must guide Prince Logan all accross the beautiful and dngerious world of Isrenasa in the quest to regain his throne. This game features a huge world to explore and many companions to join you on your journey. This game features one of the largest quests and most advanced interface of any role-playing game for the TurboDuo system.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tpmw7h9qkyqxipacfzom.jpg", "width": 907, "cloudinary_id": "tpmw7h9qkyqxipacfzom", "height": 1363}, "id": 5579, "name": "Dragon Slayer: The Legend of Heroes"}, {"genres": [12], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wk1mvtnax6llofyh9unj.jpg", "width": 1252, "cloudinary_id": "wk1mvtnax6llofyh9unj", "height": 1897}, "id": 4393, "name": "Dragon Slayer: The Legend of Heroes II"}, {"genres": [24], "name": "Bomberman '94", "videos": [{"video_id": "Ai5TzLBZbfk", "name": "PC Engine Gameplay (JP)"}, {"video_id": "vcpCcOWTZQg", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aly7qcqxbsieot314zsl.jpg", "width": 200, "cloudinary_id": "aly7qcqxbsieot314zsl", "height": 283}, "summary": "BOMBERMAN has arrived to restore peace on the planet, which has been split into five parts by an evil hand! In addition to the nine members of the Bomber Family, the character ROOI shows up to lend a hand. Jump on the EGGS that appear from destroyed SOFT BLOCKS, and you can ride one of five types of ROOI. Each ROOI has different special abilitiesuse these well and youll ride to victory! Bombs that turn according to arrows and other new gimmicks have been added to BATTLE GAME, increased to ten stages. Tag-team matches are now possible, ensuring that this game will be a blast! \n \nBomberman '94 is a video game from the Bomberman series which was developed and published by Hudson Soft for the PC Engine and released on December 10, 1993 in Japan. It was later re-developed by Westone and re-published by Sega as Mega Bomberman on the Sega Mega Drive/Genesis in 1994 in other areas. The PC Engine Bomberman '94 was later released outside Japan through the Wii's Virtual Console and the PlayStation 3's PlayStation Network. \n \nThe game supports single-player and multi-player modes. In single player, the player navigates several levels of mazes, destroying creatures with bombs. In multi-player mode, players defeat each other with bombs. \n \nBomberman '94 is the final HuCard title to be made and released by Hudson Soft, the original designers of the PC Engine console.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ackera2ww4qw0zta05ro.jpg", "width": 634, "cloudinary_id": "ackera2ww4qw0zta05ro", "height": 476}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/elaguccoxjcxzc1phtmc.jpg", "width": 640, "cloudinary_id": "elaguccoxjcxzc1phtmc", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x9fbaxpnlzok5s1pxnql.jpg", "width": 640, "cloudinary_id": "x9fbaxpnlzok5s1pxnql", "height": 480}], "id": 3448}, {"genres": [8, 33], "name": "Pac-Land", "videos": [{"video_id": "1SFeCzg7kfI", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fnqptyfczupyp0xyj5qg.jpg", "width": 800, "cloudinary_id": "fnqptyfczupyp0xyj5qg", "height": 815}, "summary": "Pac-Land itself is split into trips. In each of these trips the objective is to get the fairy (that is kept under Pac-man's hat) to Fairyland and also to return home to Pac-Man's house. The majority of the trip involves moving from left to right avoiding various obstacles such as the enemy ghosts, water spurts and quicksand traps. Each trip is divided into a number of rounds, the end of which provides Pac-Man with bonus points depending on how much time he has left and also his position in jumping at the end of each round. If the player runs out of time before finishing the round, Sue, the purple ghost, will speed up rapidly.\n\nThe penultimate round of a trip ends with Pac-Man entering Fairyland and returning the fairy under his hat to the Fairy Queen. In return the Fairy Queen gives Pac-Man magic boots. For the final round of the trip, Pac-Man has to travel from right to left back home. For assistance he uses the magic boots, which allow him to jump repeatedly while in mid-air. Once Pac-Man completes the trip, he is greeted by Ms. Pac-Man and Baby Pac-Man. In the US release of the game, Pac-Man's cat and dog in the cartoon series, Sour Puss and Chomp-Chomp, are also there to welcome Pac-Man home. Pac-Man then begins his next trip following the same objectives as before, although the difficulty increases.\n\nAs in the original Pac-Man, there are fruit which appear to eat for bonus points and power pellets to turn the ghosts blue and vulnerable. A hidden item (sometimes accidentally dropped by the ghosts) is a Flagship from Galaxian, which rewards 7650 points when collected (a reference to Namco's goroawase number of 765). The Galaxian Flagship is a long running cameo that appears in the Namco-made Pac-Man games. There are also hidden bonuses in the game, eating ghosts in a certain order will give extra time and pushing an obstacle in the opposite direction can give extra lives, invincibility, and balloons to collect for points and warps.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/a4kvvvxxb1e2oopyx3e4.jpg", "width": 304, "cloudinary_id": "a4kvvvxxb1e2oopyx3e4", "height": 224}], "id": 6822}, {"genres": [9, 31], "name": "Where in the World Is Carmen Sandiego?", "videos": [{"video_id": "kijhv53RDJE", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ovrocpwswe1hieuar4z5.jpg", "width": 600, "cloudinary_id": "ovrocpwswe1hieuar4z5", "height": 780}, "summary": "Woldwide crime wave! \nAcme Detective Agency hot on the trail of master thief Carmen Sandiego and her henchmen. \n \nWanted: Detective to locate and capture Carmen and her gang. Must be hard working, independent, fun seeking individual willing to travel the world. No experience necessary. \n \n- Digitised graphics \n- Hundreds of cases \n- More animated sequinces \n- Play in 5 languages \n \nDon't forget your World Almanac. It is a gumshoe's best friend.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/m79olx8iaqidvbb1mhmv.jpg", "width": 320, "cloudinary_id": "m79olx8iaqidvbb1mhmv", "height": 256}], "id": 251}, {"genres": [5], "summary": "Ordyne es un horizontal shooter de desplazamiento, juego de arcade que fue lanzado por Namco en 1988 sólo en Japón. Se ejecuta en Namco System 2 de hardware, y fue portado a la japonesa PC Engine en 1989 y el TurboGrafx-16 de América del Norte en 1990. Se describe oficialmente por Namco como un \"juego de acción cómica\".", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cnq4bbyjeuotb2f5j168.jpg", "width": 256, "cloudinary_id": "cnq4bbyjeuotb2f5j168", "height": 180}, "id": 39968, "name": "Ordyne"}, {"genres": [10, 33], "name": "OutRun", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wikclvhxdsrgllhzqhfd.jpg", "width": 850, "cloudinary_id": "wikclvhxdsrgllhzqhfd", "height": 1208}, "summary": "OutRun is a racing game originating in the arcades. The player can race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks. \n \nGameplay is viewed form just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/houuut8un6fxbeq0sjpn.jpg", "width": 1470, "cloudinary_id": "houuut8un6fxbeq0sjpn", "height": 1533}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vrpgdhtz22nhoi4azxvh.jpg", "width": 640, "cloudinary_id": "vrpgdhtz22nhoi4azxvh", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ndzkhuhrkszg9xiyehtt.jpg", "width": 640, "cloudinary_id": "ndzkhuhrkszg9xiyehtt", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wxo06xndkdytt8dftd9y.jpg", "width": 440, "cloudinary_id": "wxo06xndkdytt8dftd9y", "height": 308}], "id": 2051}, {"genres": [13, 15, 16], "summary": "Super Daisenryaku is a 1988 war-simulation game for NEC's PC-88 and PC-98 computers by SystemSoft in their Daisenryaku series of WWII sims. Sega ported it to the Sega Mega Drive in 1989, putting in a new soundtrack supposedly composed by Tokuhiko Uwabo. Not only was it never released outside Japan, but it does not fully implement TMSS, meaning it will only work on early Model 1 Mega Drives.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/chmrxisk3no2uamstimw.jpg", "width": 1437, "cloudinary_id": "chmrxisk3no2uamstimw", "height": 2015}, "id": 27970, "name": "Super Daisenryaku"}, {"genres": [5, 33], "name": "Forgotten Worlds", "videos": [{"video_id": "baNlrRMaAJM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lxazlfrn26pwbg9kflrt.jpg", "width": 1200, "cloudinary_id": "lxazlfrn26pwbg9kflrt", "height": 1600}, "summary": "Forgotten Worlds can be played by up to two players simultaneously. The player controls a flying muscle-bound soldier armed with a rifle with unlimited ammo. The Player 1 character is equipped with a long-range automatic rifle, while Player 2 has a short-range wide shot. The controls in the original coin-op version consists of an eight-way joystick for moving the character in the air while flying and a unique rotatable button known as the \"roll switch\".Rotating the switch left or right allows the player to adjust their character's aim in one of sixteen directions, while pressing it causes the player character to shoot his gun. This allows for the player to move their character anywhere while keeping their aim in one direction. Pressing the switch rapidly will cause the character to perform a \"megacrush\" attack will destroy all on-screen enemies, but at the expense of a portion of their vitality gauge. \n \nThe player character is accompanied by a satellite module orbiting near him that will provide backup firepower every time the player fires their gun. Like the main character, the satellite can also be rotated with the roll switch. Rotating the character while firing will only rotate the aim of the satellite, while rotating the character without firing will not only rotate the satellite's aim, it will also move its relative position around the player. \n \nThe player can obtain blue-colored coins known as \"zennies\" from defeating enemies throughout the game. The zennies are used as currency to obtain new power-up items from shops located at certain points in each stage. When the player enters an item shop, they are given a choice of the items available and a limited time to make any purchase they wish. These items consists primarily of new weapons for the satellite module, but also includes a health kit to restore lost vitality, an armor that allows the player to sustain additional damage, and even tips on how to defeat the boss awaiting at the end of the current stage. \n \nForgotten Worlds consists of five stages with a total of eight bosses. The player will lose if their vitality gauge runs out, but will be given a chance to continue.", "storyline": "Set in a distant future, an evil god known as Emperor Bios has destroyed most of the Earth, turning it into a desolated wasteland known as the \"Dust World\". Two nameless super-soldiers are created by the people to defeat Bios and the eight evil gods who serve him.", "id": 6794}, {"genres": [5], "name": "Truxton", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xrgwh5oov82hhibzidaw.jpg", "width": 1446, "cloudinary_id": "xrgwh5oov82hhibzidaw", "height": 2000}, "summary": "Truxton is a 1988 vertically scrolling, shoot 'em up arcade game developed by Toaplan, later ported to the Mega Drive (worldwide) and the PC Engine (Japan-only). Like many other scrolling shooters, the game is set in outer space, where the player takes control of a small spaceship across several planets. The game is played with an eight-way joystick and two buttons (a shot and a bomb button) through five large levels and their bosses (which then loop forever, at higher difficulties).", "storyline": "Taking place somewhere in space: an armada of Gidans, led by the evil Dogurava, is invading the planet Borogo aboard five gargantuan asteroids. After surviving an attack on an orbiting Borogo cargo barge, a pilot enters one remaining fighter and challenges the Gidans in a desperate attempt to quell the alien invasion and divert their asteroid fortresses in the process.", "id": 4418}, {"genres": [12], "summary": "Sorcerian is a side-scrolling action-RPG. The player can create up to ten characters, from whom up to four members can be present in a party at the same time. Each character is highly customizable, with four different classes/races (fighter, wizard, elf, and dwarf) and over 60 possible jobs/occupations (ranging from clown to exorcist) available for them to perform; each has its own strengths and weaknesses, affecting the seven primary attributes (strength, intelligence, protection, magic resistance, vitality, dexterity, and karma) in different ways, as well as different equipment limitations. \n \nThe player can choose from fifteen different scenarios, or quests, to play through in the order of their choice. The party must battle enemies and perform tasks within the given levels to clear each scenario, before moving onto another scenario of their choice. The player controls the entire party at the same time, with all four members running in a line, jumping in sequence, and attacking in unison. The party members follow behind in a manner similar to the Options in the arcade shooter Gradius (1985). Sorcerian also employs class-based puzzles, such as using a high-strength character to force open doors. \n \nAll the characters have a default starting age of 16. Each time a player begins a new scenario, a year passes by, while additional time passes by in towns as a character goes through training or enchants items. The characters age at different rates depending on their race, with humans reaching old age at 60, dwarves at 100, and elves at 200. Upon reaching old age, for every year that passes, a character can die permanently at a random time. There is also an “Advance Time” to speed up the flow of time. Another new feature of Sorcerian was its episodic format that extended across various expansion packs. Besides the default fifteen scenarios that come with the game, there were a number of additional scenario packs released. The aging system was created with the additional scenario packs in mind.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fveycbuvx2d3uzj8snvj.jpg", "width": 800, "cloudinary_id": "fveycbuvx2d3uzj8snvj", "height": 1003}, "id": 14486, "name": "Sorcerian"}, {"genres": [5], "summary": "After Burner II is an arcade-style flight game released by Sega in 1987. It is the second game in the After Burner series. In the game, players fly a F-14 Tomcat jet fighter, gunning down enemies while avoiding incoming fire.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mxidfojppnsodzj03bnv.jpg", "width": 250, "cloudinary_id": "mxidfojppnsodzj03bnv", "height": 355}, "id": 5352, "name": "After Burner II"}, {"genres": [5], "name": "Twin Hawk", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gjz9q5exrxlm3qhu7qf1.jpg", "width": 300, "cloudinary_id": "gjz9q5exrxlm3qhu7qf1", "height": 424}, "summary": "Twin Hawk is a 1989 vertically scrolling shooter arcade game developed by Toaplan and published by Taito. Twin Hawk resembles other shooters of the time, specifically Toaplan's earlier game, Flying Shark. Also like Toaplan's other games, there were various differences between the Japanese version and other versions, including a checkpoint system and higher difficulty for the former. Unusually, the game contains no flying enemies; thus, a complete lack of physical obstructions and a stronger focus on the numbers and speed of ground forces. \n \nAnother draw of Twin Hawk is the game's unique \"smartbomb\" in the form of a group of friendly planes; pressing button 2 once will call in six Flying Fortresses to surround and protect the player's plane, and provide back-up fire. They are easily taken down by enemy fire, so the player must use them wisely. \n \nPressing button 2 again immediately after the call-in will sacrifice the planes for a more typical smartbomb. Otherwise, pressing button 2 while any other plane is on-screen will suicide them all into the nearest enemies below.", "storyline": "At the end of an alternate World War II, a new European country is formed called Gorongo. General Giovanni of the Gorongo military was infuriated with the results of the war and what it meant to the country of Gorongo, initiating a rebellion against the country’s government that was widely followed by his soldiers. Holing themselves up on Bobo Island, south of Gorongo, Giovanni declared the occupation as the independent state of Fuangania and plotted to take over Gorongo. After taking over the town of Kusunoki, the Fuangania invasion – consisting of massive ground and sea attack forces – started to spread. \n \nGorongo President Bratt ordered a counterattack that focused on the one type of firepower Giovanni lacked: an air force. The special air force \"Daisenpuu\" sets up a mountain base after spotting a secret Fuangania fortress under construction. However, nearing the end of their training, the airforce is spotted by the Fuangania and are preparing to attack. It's up to the player, in the role of the Wing Commander, to fly into Giovanni's secret base and take him and his commanding unit out.", "id": 28040}, {"genres": [10], "summary": "An action racing game featuring sprinting mechs. \n \nFighting Run is a vertical scrolling action game for the PC Engine featuring mechs. The game was published by Nichibutsu, or Nihan Bussan. \n \nThe goal of the game is to build a mech's stats and take on other mechs in straight courses. Both mechs sprint up the screen, but must also fight each other until one of them is destroyed. The mechs can also be damaged or stunned from obstacles in the course.", "id": 44333, "name": "Fighting Run"}, {"genres": [8, 33], "summary": "Rainbow Islands (レインボーアイランド?) is a 1987 arcade game developed and published by Taito.[1] The arcade version was licensed to Romstar for North American manufacturing and distribution. The game is subtitled \"The Story of Bubble Bobble 2\" and is the sequel to Taito's hit game Bubble Bobble from the previous year. It is the second of four arcade games in the Bubble Bobble series (followed by Bubble Symphony and Bubble Memories, but itself has two direct sequels: Parasol Stars and Bubble Bobble Part 2). The game was ported for numerous home computers and game consoles. \n \nThe main characters are Bubblun and Bobblun, the protagonists of Bubble Bobble (known as \"Bub and Bob\" in the western releases). However, in this game they appear in their human forms as \"Bubby\" and \"Bobby\", as opposed to the \"bubble dragons\" of the first game (following on from the first game's true ending). Also unlike the first game, players must now \"alternate\" (i.e., take turns), with player one as Bubby (green shirt), and player 2 as Bobby (blue shirt) (the same color scheme as in the first game).", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sn8xmskexbioosqgxjuf.jpg", "width": 640, "cloudinary_id": "sn8xmskexbioosqgxjuf", "height": 877}, "id": 4405, "name": "Rainbow Islands"}, {"genres": [5, 33], "name": "Gradius", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tluxw8dby0owbdl15jox.jpg", "width": 786, "cloudinary_id": "tluxw8dby0owbdl15jox", "height": 1081}, "summary": "One of the defining characteristics of the Gradius series is the use of a \"power meter.\" The power meter is powered by a power-up item, whose purpose, when collected, is to move a highlight to the next power-up on the power meter. When a power-up that the player wants becomes highlighted, he or she may activate it, also causing the highlight to reset.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kreyuo1czqbcueec9h8v.jpg", "width": 1280, "cloudinary_id": "kreyuo1czqbcueec9h8v", "height": 720}], "id": 1476}, {"genres": [5, 33], "name": "Salamander", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/inhnibkm3xawxb7aefl6.jpg", "width": 1000, "cloudinary_id": "inhnibkm3xawxb7aefl6", "height": 1423}, "summary": "The first player controls Vic Viper and the second player takes the reins of debuting spacecraft Lord British, which is sometimes referred as \"Road British\" due to the ambiguity of Japanese-to-English romanization. The game features six stages which alter between horizontal and vertical scrolling.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ipbttjhlmu6zbng64eyf.jpg", "width": 320, "cloudinary_id": "ipbttjhlmu6zbng64eyf", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/padumhbths9qj6q5ivac.jpg", "width": 480, "cloudinary_id": "padumhbths9qj6q5ivac", "height": 272}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lvv5hdemfi4e5dgtlmnb.jpg", "width": 480, "cloudinary_id": "lvv5hdemfi4e5dgtlmnb", "height": 272}], "id": 1477}, {"genres": [5, 33], "summary": "The Fantasy Zone is a solar system consisting of eight brightly colored, fantastic planets. The evil Menons are trying to take over all of the planets in the Fantasy Zone by using misappropriated foreign currency to build their forces. It is the player's job to recover all of the coins and save the solar system! \n \nFantasy Zone is an arcade style shooter for one or two players. The goal is to destroy all of the creatures on each planet and collect as many of the lost coins as possible. At the end of each level is a large enemy that will have to be defeated before moving on to the next world. At various points in the game, the player will be able to find a parts shop, which allows purchasing improvements for his spaceship, including better weapons and faster engines.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gjywiwgar1gcfs89nxzj.jpg", "width": 640, "cloudinary_id": "gjywiwgar1gcfs89nxzj", "height": 640}, "id": 6684, "name": "Fantasy Zone"}, {"genres": [10, 14], "summary": "A Formula 1 racing game from Pack-In-Video, developed for the PC Engine. It was never released outside of Japan. \n \nF-1 Pilot is a F1 racing game for the PC Engine, one that depicts the racing from the driver's seat of the vehicle. The player is able to select a car before a race, but they all appear to be functionally identical except for the color. The player can also choose to have engine noises or BGM, but not both. Selecting either of the BGM modes will disable all sound effects from the game, including tire screeching and crashing noises. \n \nThe game has some odd uses of English (the game was never fully localized into English): For instance, it refers to F1 drivers as \"pilots\" and the title screen affirms that the player is the King of Kings.", "id": 44326, "name": "F1 Pilot"}, {"genres": [5], "summary": "Here begins the story from a time and a world not our own ... A sorceress used her evil powers to fulfill her conquest to rule the world. \"Go my dead slaves to trample and rule the world which will belong to us!\" You are the only one who can crush her wretched plans! Each stage is controlled by a boss who portrays a sign of the zodiac. Going through a maze, you have to find and destroy the boss before your time runs out. Save the world!", "id": 44341, "name": "Somer Assault"}, {"genres": [5], "summary": "Make your way through a dungeon-like space station and defeat the prowling monsters in this real-time first-person shooter. You're a member of the elite Debuggers, a group of warriors who are jacks-of- all-trades. Assigned to inspect an unmanned space station, you have exactly 100 minutes to get in, destroy the monsters lurking in each block, make your way to the lowest level and deactivate the automatic detonator placed there. With each monster that slips by you, the core block becomes harder to survive in, so speed is key in preserving the facility and each separate block. Experience the thrill of survival as the timer ticks away and you uncover the truth of the events that occurred.", "id": 44343, "name": "Silent Debuggers"}, {"genres": [14], "summary": "You're a high-scoring point guard capable of awesome vertical leaps and hangtime. Matter of fact, you can do it all! Dribble. Bounce-pass. Fake. Pivot. Jump. Shoot. Play Man or Zone. Drive the lane -- is the defender all over you? Give him a move and jam, slam in his face!", "id": 44338, "name": "Takin' it to the Hoop"}, {"genres": [9], "summary": "Kicking-things puzzle game that is guaranteed to twist your brain up until it escapes out of your nostrils.", "id": 44319, "name": "Tricky"}, {"genres": [14], "summary": "Pro Tennis: World Court (プロテニスワールドコート Puro Tenisu: Wārudo Kōto?) is a tennis sports arcade game that was released by Namco in 1988 only in Japan; it runs upon Namco System 1 hardware, and was inspired by the 1987 Famicom game Family Tennis. In August 1988, the game was ported to the PC Engine console, in which a new tennis-based role-playing quest mode was added, and was later ported to the North American TurboGrafx-16 console by NEC under the title of World Court Tennis in 1989 and a sequel named Super World Court was released in 1992, which ran on Namco NA-1 hardware and allowed up to four players to play simultaneously.", "id": 44320, "name": "Pro Tennis: World Court"}, {"genres": [8], "summary": "Tatsu no Ko fighter (also known as Dragon Fighter) is a simple platform game published by Tonkin House. \n \nIt follows the adventures of a young farmer as he travels across a country full of dangers. He carries around a long stick which he slyly uses to take down his enemies. He has a few more tricks up his sleeves - thanks to his magic book (press 'Run' and select a weapon by pressing 'up' and 'down'), he can also shoot blasts of energy from it. However, this technique depletes some of his magic energy which he has to refill periodically. But his ultimate weapon is the ability to turn into a powerful topless fighter - this technique is however only available for the toughest boss encounters located at the end of each area. In this form, our hero can use a powerful chain-whip (which consumes magic energy) to land more punishing blows than his bare fists. Throughout the game, various enemies drop magic orbs when defeated which range from power-ups (red P), increase max-life (green P), increase magic bar (green M), freeze time clocks, bombs, life potions and so forth. Each defeated enemy also drop money that can later be used to purchase life and magic from town people located at the end of each area. This is also where the stick can be later upgraded into a more lethal spear. Finally, infinite continues are available.", "id": 44324, "name": "Tatsunoko Fighter"}, {"genres": [5], "summary": "Scramble Mode Zeta; A message to Cybernaut Squadron Calisto -- Priority Alpha-San 03... An intersystem intruder has been detected in quadrant FTU-770. Dronecraft sent to get a visual discovered an extremely large monolith, biomorphic in nature. All attempts at contact ended in destruction of drones. Your mission: locate, intercept and enter the Sinistron. Use any means to destroy it!", "id": 44342, "name": "Sinistron"}, {"genres": [14], "summary": "The action sizzles in Sonic Spike, on the front line of the world's most brutal volleyball game. Blast the ball over the net -- bump, spike, dig, jump, and even quick-fake a return. Orbital lobs soar to the sun; earth-pounding spikes vibrate the ground. Score ... or eat sand! Select and create your own teams from 24 athletes pulled from six nations. Pit gals against guys in a battle of the sexes, or fight the competition of the century with Japan, Australia, Brazil, USA or USSR.", "id": 44340, "name": "Sonic Spike"}, {"genres": [14], "summary": "A soccer game for the PC Engine and part of Human's Formation Soccer series. \n \nFormation Soccer on J-League is a soccer game for the PC Engine and part of Human Entertainment's Formation Soccer series. The game focuses on Japan's top soccer league, the J-League, and features all ten teams active in the 1993-94 season. Formation Soccer on J-League was the penultimate game released officially on the PC Engine/TurboGrafx-16's HuCard format. \n \nThe game features a standard exhibition mode, a league mode that recreates the 1993-94 J-League, and an All-Stars mode that features two teams comprised of all the best players. The Exhibition and All-Stars modes can be played with up to four human players. The J-League mode allows for two players to be on the same team and take on the CPU-controlled league cooperatively.", "id": 44329, "name": "Formation Soccer On J. League"}, {"genres": [5], "summary": "Daisenpū is a vertical shooter by Nec Interchannel and conversion of the arcade game of the same name (also known as Twin Hawk) originally released by Toaplan in 1989. In the year 193X, country R is overwhelmed by hostile enemy forces and the small oasis town 'S' is the main target of the attack. A handful of survivors escape to the jungle and start working on a counter attack - but they are soon discovered and are now running out of time, and they must launch the Daisenpū squadron before it is fully operational. The player takes control of a fighter plane and must fly deep into enemy territory, attack ground targets such as tanks, turrets and warships (the game curiously doesn't feature any flying enemies and no obstacles to fly into, beside enemy bullets). The plane starts equipped with a limited double-shot machine gun that can be slowly upgraded throughout the game by collecting power-pods left behind by small trucks. But the originality of Daisenpū lies elsewhere - the player can call a small squadron of six planes and have them fly in formation, shooting anything in sight and crashing into an enemy unit when defeated. The squadron can also commit a Kamikaze attack at anytime and destroy ground units, or combine to release a devastative bomb-attack. Finally, Daisenpū offers an unusual feature - levels do not pause between them and reveal instead a continuous flow of undisturbed shooting action.", "id": 44325, "name": "Dai Senpu"}, {"genres": [14], "id": 44331, "name": "Usa Pro Basketball"}, {"genres": [12], "summary": "AKA: パチ夫くん十番勝負. A role-playing Pachinko games.", "id": 46501, "name": "Pachio Kun Juuban Shoubu"}, {"genres": [10, 14], "summary": "A Formula One licensed racing game for the PC Engine and the second game in Nichibutsu's F1 Circus series. \n \nF1 Circus '91 is a top-down Formula One racing game with a strong simulation element. Players kit out their vehicle, take on various prominent Formula One competitors of the era in races that track the vehicle's damage and fuel. Due to the high speeds involved, players need to pay attention to flashing icons that indicate turns coming up in the road. \n \nThe game followed 1990's F1 Circus and was followed by 1992's F1 Circus '92. The series would then move to the Super Famicom as Super F1 Circus.", "id": 44328, "name": "F1 Circus '91"}, {"genres": [15], "summary": "Space on Earth has become limited, and mankind has looked to colonize the moon. A group known as the Axis Powers has seized control over most of the lunar surface, and it's up to you as a member of the Allied Powers to fight against them. As you move around the map (shown in a top-down 2D perspective), enemy combatants will try and stop you from achieving your goal. Once encountered, the screen shifts view points to a close-up view of the skirmish at hand.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bqxe8w8urkb6dfni11jt.jpg", "width": 1288, "cloudinary_id": "bqxe8w8urkb6dfni11jt", "height": 1512}, "id": 44334, "name": "Military Madness"}, {"genres": [5], "summary": "Move fast and blast! It's a nonstop explosion of fire power and you're streaking through space, right in the middle of it! The Brains Cult you once defeated is back, badder than ever. But your finger's on the trigger of an incredible new techno-attack! Scorch the Scorpion with a nuclear a sting. Fire your heat-seeking sidewinders. Then power-up to launch your doomsday Super Bomb! Blow those Brains out and save the galaxy. Then challenge your friends with a special competition time mode to prove who the Super Star really is!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s20wpuregxt0nsc0kufy.jpg", "width": 1500, "cloudinary_id": "s20wpuregxt0nsc0kufy", "height": 1500}, "id": 44339, "name": "Super Star Soldier"}, {"summary": "Slot Game", "id": 44321, "name": "PC Pachi Slot 777"}, {"genres": [14], "summary": "The object is to win all the major international races on the Formula One circuit. The game can be played by either one, two or even three players (Battle Mode-only) simultaneously. Various modes of racing include: regular season, battle (which is similar to exhibition or single race mode in other Formula One video games), and the time trial mode which tests how fast a player can drive his or her race car on any of the world's premier road courses. Only the vehicles from the 1994 season are used. Michael Schumacher and Satoru Nakajima are the most popular racers in this video game, even though Nakajima is a hidden character.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rvarwtrw1wypptajsfkb.jpg", "width": 813, "cloudinary_id": "rvarwtrw1wypptajsfkb", "height": 581}], "id": 44332, "name": "F1 Triple Battle"}, {"genres": [14], "summary": "Multiplayer golf for the PC Engine courtesy of Masaya and Dual. \n \nGanbare! Golf Boys (\"Do Your Best! Golf Boys\") is a PC Engine exclusive golf game that allows for up to four players to compete is a round of golf via the console's multi-tap peripheral. It did not receive a US localization. \n \nThe game has a permanent top-down view of each hole, zooming in whenever the player is on the green, and has the \"hit the sweet spot\" power gauge system standard to most golf simulators. It features a total of two courses, with eighteen holes apiece. \n \nGanbare! Golf Boys is notable for being the first project that prominent game musician Atsuhiro Motoyama ever worked on.", "id": 44330, "name": "Ganbare Golf Boys"}, {"genres": [9], "summary": "A bizarre sort of Breakout/Arkanoid clone, you are presented with a constantly dropping wall of various items (apples, melons...) and have to destroy as many as possible by rebounding the small bouncing ball around the screen. Pushing the button toggles between 'open' and 'closed', which affects whether the ball will bounce in a shallow or steep angle when it hits. Missing the ball will eventually destroy the barrier behind you so you must keep your wits about you at all times.", "id": 44322, "name": "Drop Rock Hora Hora"}, {"genres": [10], "summary": "F-1 Dream is an automobile racing game for the PC Engine released exclusively in Japan in 1988. \n \nThe graphics are identical to the arcade game, even down to the pit crew and lane and fans in the stands. The controls are the same as well: The d-pad controls all eight ways, and the two buttons work as both gas-and-brake and as the transmission. Press the II button to launch the car, and once first gear tops out, quick switch to the I button. If your car is Turbo-equipped, once second gear tops out, hold down both buttons to kick in the afterburner. Letting go of the top gear button will brake the car, and hitting the button again will resume acceleration. The game includes back-markers as well. If you're leading the race or you and an opponent are well ahead of the pack, slower white cars will appear on the track to make things interesting for you, usually just as you're coming up to a particularly tough corner, or drifting across your lane on a straight and forcing you to make a course correction. They're a minor annoyance, but one to keep you on your toes when you've left everyone else in your dust. \n \nThe console game designers must have thought that the game needed to be expanded upon, because everything else about the game, outside of the actual racing, is totally different. Instead of jumping right into the F3000 circuit, they've turned it more into a career-mode. You start with street racing your Porsche 911 in races for cash, matching up head to head with another racer and betting on the result. Money that you win in these races can be used to hire yourself a pit crew that comes with you no matter where you're racing. Once you've proven yourself on the street (or you blow all your money, strangely), you get the call: F3000 wants you!", "id": 44327, "name": "F1 Dream"}, {"summary": "The first shoot 'em up outing for the PC Genjin series, PC Denjin look and sounds very much like an industrial version of Coryoon. There is a wide variety of weapons and character-transforming power-ups to obtain, including 'friends' that follow after you and attack the enemies in their own special way.", "id": 44318, "name": "PC Denjin - Punkic Cyborgs"}, {"summary": "Contains fifteen different games originally released for the VIC-20.", "id": 37643, "name": "15-in-1 Mega Collection: Backtracking Ten Years"}, {"genres": [5, 33], "name": "Parodius! From Myth to Laughter", "videos": [{"video_id": "sdK0nTT-D5w", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/clsylvwqsx1ygvokbk0g.jpg", "width": 256, "cloudinary_id": "clsylvwqsx1ygvokbk0g", "height": 366}, "summary": "A shoot'em up arcade game and the second title in the Parodius series.", "storyline": "The Great Octopus has threatened Earth. To help Parodius save the planet, you and his friends must begin your search for the truth. As you search the whole world over you must find the enemy and you must destroy him.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/apnccpwl0e0xozo54cqm.jpg", "width": 560, "cloudinary_id": "apnccpwl0e0xozo54cqm", "height": 435}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tuolclvxkc17uulej4ka.jpg", "width": 256, "cloudinary_id": "tuolclvxkc17uulej4ka", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/clyjjt4vct3ukdbydzah.jpg", "width": 512, "cloudinary_id": "clyjjt4vct3ukdbydzah", "height": 384}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qeul7kunrsphbhovgmwd.jpg", "width": 480, "cloudinary_id": "qeul7kunrsphbhovgmwd", "height": 360}], "id": 37307}, {"genres": [8], "summary": "A side-scrolling 2D platformer featuring a magical demon prince. As well as his own magic, he can also depend on his loyal Moai servants to make bridges. The predecessor of The Twisted Tales of Spike McFang. \n \nMakai Prince Dorabocchan (\"Demon Prince Dorabo\") is a 2D platformer for the PC Engine. The player controls the titular character who is on a quest to rescue his master and defeat the evil demons that have invaded the kingdom. \n \nAs well as his own magical powers, he can be upgraded by finding suits of armor which boost his abilities as well as temporary power-ups that provide double-jumping, a syringe weapon that stuns enemies and cleats that allow him to jump on enemies to defeat them. If he finds a bat with a bell, he can summon his burly Moai guardians who use their stone bodies to create bridges that allow Dorabo to move forward or find secret areas. \n \nDorabocchan would later appear in the top-down 1993 Super Nintendo action-adventure game Chou Makai Taisen! Dorabocchan, which was localized in the west as The Twisted Tales of Spike McFang, and would also headline the 1994 Super Famicom golf game Super Naxat Open: Golf de Shoubu da! Dorabocchan.", "id": 38090, "name": "Makai Prince Dorabochan"}, {"genres": [12], "summary": "An role-playing game based on the story of Sinbad the Sailor.", "id": 37690, "name": "Sindibad - Chitei No Dai Meikyu"}, {"genres": [12], "summary": "An RPG game.", "id": 37688, "name": "Susano O Densetsu"}, {"genres": [5], "summary": "A vertical-scrolling shoot-'em-up from Face for the PC Engine. It was never released outside of Japan. It was eventually followed by a sequel, Hani on the Road. \n \nHani in the Sky is a shoot-'em-up by Face, an obscure PC Engine developer best known in the west for Money Puzzle Exchanger. The player controls the eponymous Hani, a sentient haniwa figurine, as they shoot down legions of demonic spirits and youkai in the air. He is set to this task by ancient Japanese deity Izanagi, with the ultimate goal of rescuing his wife/sister deity Izanami. \n \nThe chief feature of Hani in the Sky is the protagonist's ability to change the direction of their weapon, allowing the player to shoot in eight different directions total. This is often required to defeat enemy waves emerging from all sides of the screen as well as the fast-moving bosses. The player can also upgrade Hani's weaponry, allowing him to fire in more directions simultaneously, as well as purchase health refills and other useful items from Izanagi. \n \nHani in the Sky was eventually followed by a sequel: Hani on the Road. Unlike Sky, Hani on the Road is more of a ground-based auto-scrolling action platformer with lane-switching.", "id": 37685, "name": "Hani In The Sky"}, {"genres": [14], "summary": "A Japanese Sumo (wrestling) game.", "id": 37645, "name": "Tsuppari Dai Sumo"}, {"genres": [9, 13], "summary": "A board game to simulate life. Similar like monopoly.", "id": 37649, "name": "Yuu Yuu Jinsei"}, {"genres": [5], "summary": "Improved port of the Arcade shoot 'em up with both air and surface attacks.", "id": 38074, "name": "Xevious: Fardraut Densetsu"}, {"genres": [5], "summary": "Classic shoot 'em up starring the Monkey King Sun Wukong. \n \nCloud Master, or Gokuraku! Chuuka Taisen as it's known in Japan, is a horizontal shoot 'em up featuring the literary character Sun Wukong, better known as the Monkey King and the deuteragonist of the Chinese novel Journey to the West. \n \nCloud Master was originally released in the Arcades by Taito in 1988.", "id": 37711, "name": "Gokuraku! Chuka Taisen"}, {"genres": [8], "summary": "A platformer where the player controls a small girl with an egg in her backpack, which can turn into a dragon. \n \nDragon Egg (sometimes styled Dragon Egg!) is a 2D side-scrolling platformer set in a fantasy world. The protagonist is a young girl who wields a dragon egg as a weapon. As she collects fire orbs, the dragon egg hatches into a baby dragon, and then subsequently grows further as more fire orbs are collected. As the dragon grows, the effective attack range of the protagonist increases, making the game easier. However, the dragon will revert by one stage if the player character dies. \n \nThe game also has a currency system and stores, which can provide additional fire orb power-ups and other useful tools, like health restoration and barriers, if the player acquires enough funds before entering. \n \nThe game was released exclusively for the PC Engine. However, as an action game, it doesn't include a lot of Japanese text and can be easily played by those not fluent with the language.", "id": 37722, "name": "Dragon Egg!"}, {"genres": [5], "summary": "It's a straight run through only the bosses from Darius Plus. Only around 800 copies were produced and given to those persons who bought both Darius Plus and Super Darius only in Japan.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/umlkarljbunbcv8lomtd.jpg", "width": 1200, "cloudinary_id": "umlkarljbunbcv8lomtd", "height": 1200}, "id": 38075, "name": "Darius Alpha"}, {"genres": [10], "summary": "The first game in Nichibutsu's Formula One top-down racing series. \n \nF1 Circus is a top-down Formula 1 racing game and the first game in Nihon Bussan's F1 Circus series. It was first released on the PC Engine in 1990, but a modified version - also partially based on this game's sequel, F1 Circus '91 - would later be released on the Famicom in 1992. As with every other game in the series, the game was never localized in North America or Europe. \n \nThe game uses the real life names of drivers and teams from Formula 1, like Nigel Mansell and Ferrari. The series would continue to acquire the various licenses needed to use real names from Formula 1.", "id": 37715, "name": "F1 CIRCUS"}, {"genres": [9], "summary": "A video game adaptation of the famous strategic board game. Find the opponent's flag, and watch out for that spy. \n \nOverview: \nStratego is a board game adaptation that was originally published by Accolade for various home computers in 1990. The game was also localized for a Japanese audience with the PC Engine release, which was published by Victor Entertainment in 1992. \n \nThe game closely follows the rules of the classic Stratego board game as conceived by creators Jumbo, which was later licensed by Milton Bradley for North America. The game also offers various different modes, including a campaign mode which involves consecutive maps, as well as the option to change the visual design for the board and the pieces. \n \nGameplay: \nThe standard rules of Stratego are as follows- \nThe player must start the game by placing all forty units in the four rows on their side of the board. \nThe player can move any of the numbered units or the Spy (S) unit one space. The Flag (F) and Bombs (B) cannot be moved. \nNo two units can occupy the same space. If an enemy unit and a player's unit meet, the one with the highest number (which correlates to a lower rank) is removed. The winning unit then moves into the empty space. If they have the same number, both are removed. \nIf a unit touches the enemy's flag, they win the game. \nThere are special rules governing a few of the units: \n \nThe Spy unit will be removed if attacked by anyone. However, they are the only unit that can defeat the highest ranked unit - the Marshall, or #1. They can only do so if they are the attacker, not the defender. \nIf any unit touches a Bomb, they are removed from the board. The Bomb does not move into the empty space. \nThe Miner (#8) is the only unit that can destroy a Bomb. \nThe Scout (#9) can move any number of spaces horizontally and vertically.", "id": 22893, "name": "Stratego"}, {"genres": [8], "summary": "The adventure begins on peaceful Adventure Island. Today Master Higgins weds Tina. the new 'Miss Island“. Everyone is assembled at the church to celebrate their wedding when. suddenly. the evil Baron Bronsky appears. He wants to marry Tina himself. The evil baron carries Tina off, along with six island children. To reach his castle and rescue Tina, Master Higgins must first rescue the six children. each of whom is hidden on a separate island. You are Master Higgins. Will you be able to save her?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/usiuc9nisywsuou62dia.jpg", "width": 500, "cloudinary_id": "usiuc9nisywsuou62dia", "height": 598}, "id": 28521, "name": "New Adventure Island"}, {"summary": "Ratz attack! Ratz attack! The city of Los Angeles is being invaded! Only Lil Bro', Camp California's rad skateboarding dude, can save it. The evil Ratz gang is unleashing a barrage of killer creatures and devices. Find incredibly cool weapons to fight back. Wipe out their earthquake machines and nasty man-eating plants with rocket grenades. Fight off wicked space aliens and launch your bonus attacks. It'll take everything you've got to send the Ratz packing.", "id": 37730, "name": "YoBro"}, {"summary": "A pseudo-3D third-person rail shooter of the Space Harrier mold. It had multiple developer credits and is exclusive to the PC Engine. \n \nJinmu Denshou is an action game in which the player character marches towards the horizon while enemies fly towards him. It looks and plays like Sega's Space Harrier, its clear inspiration, though a major difference is that the main character is a samurai-like figure who is usually limited to attacking incoming enemies with his sword. After an upgrade, he is able to fire projectiles and he can also charge up an attack and unleash it to cause a significant amount of damage. The game has a few superficial platforming elements as well. \n \nDevelopment of the game is credited to three separate teams: obscure TG-16 developers Manjyudo, Wolf Team (better known for their Tales series) and Goblin Sound who were responsible for the music.", "id": 37683, "name": "Jinmu Denshou Yaksa"}, {"genres": [9, 15], "summary": "Board game sequel, again featuring lots of trains. \n \n(From the PC Engine Software Bible)", "id": 38067, "name": "Super Momotaro Dentetsu II"}, {"summary": "A horizontal shoot 'em up with a surreal edge. A group of evil eyes have stolen parts of the Sunheart, and the player needs to recover them. \n \nBouken Danshaku Don: The Lost Sunheart (\"Adventures of Don Baron: The Lost Sunheart\", roughly) is a horizontal shoot 'em up exclusive to the PC Engine. The game's plot concerns the titular Sunheart device, which is broken into several pieces and spirited away by a group of malicious eyeball enemies. The hero, in a series of vehicles, takes down each of the boss creatures that are protecting a piece of the stolen Sunheart. \n \nThe game is distinct among shoot 'em ups for allowing players to keep their power-ups after dying. This does not mitigate the game's difficulty, as it has some very strict checkpointing and many enemies with difficult-to-avoid homing shots. The game's surreal sense of humor comes through with its bizarre bosses, in some way invoking the flamboyant Cho Aniki series.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aowz6dyhghhfok8gjnhj.jpg", "width": 1427, "cloudinary_id": "aowz6dyhghhfok8gjnhj", "height": 1431}, "id": 37720, "name": "Bouken Danshaku Don: The Lost Sunheart"}, {"genres": [8], "summary": "Taking a different route to its maze-based predecessor, this Doraemon game is a side scrolling platformer with a simple, colourful look. You have to rescue your friends who have dived into various books and are pursued by the inhabitants within. You start off having to avoid the wandering beasties, but eventually get hold of such items as a gun that freezes anything in your path for a moment. Along the way you get to ride on dinosaurs, crawl under moving stone blocks, creep along precarious ledges and slide down water chutes.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ut1rzcmrdckxz8lsb0rk.jpg", "width": 952, "cloudinary_id": "ut1rzcmrdckxz8lsb0rk", "height": 942}, "id": 38077, "name": "Doraemon: Nobita no Dorabian Night"}, {"genres": [5], "summary": "Evil forces have kidnapped the leader of the Burning Project! It's up to the Burning Angels to rescue her! And so starts another vertically scrolling shooter on the PC Engine. There are no surprises in the gameplay here - choose one of two ships, shoot down enemies and collect power upgrades and energy pods. Levels range from the city to the desert and the obligatory sci-fi enemy base. At the end of each level, defeat the large boss craft to move on.", "id": 37719, "name": "Burning Angels"}, {"genres": [15], "summary": "A mahjong game with an RPG element. Players move around a map beating monsters at mahjong. \n \nMahjong Haouden: Kaiser's Quest (\"Mahjong Overlord: Kaiser's Quest\") is a mahjong game released exclusively for the PC Engine. The game features a handful of RPG heroes as they set out to remove the various monsters and villains that have taken over their kingdom. To defeat these monsters, the player must beat them in mahjong games. The player has three characters they can choose between initially, and more become available later. \n \nThe mahjong side of the game offers a standard one-vs-one mode. The player has to win a few games to obtain 100% of the points available, and more points can be earned depending on how the player won.", "id": 38098, "name": "Mahjong Haouden: Kaiser's Quest"}, {"summary": "AKA: Liquid Kids or ミズバク大冒険. A platypus-like cute character throwing water balls action game to begin its adventure.", "id": 37653, "name": "Mizbak's Adventure"}, {"genres": [9], "summary": "An adult Mahjong game.", "id": 37681, "name": "Kyuukyoku Mahjong"}, {"genres": [14], "summary": "Kunio was waiting for after school by the gates to meet Kumiko. \nSuddenly, Aliens ambushes Kunio! \n\"Kunio, fight or die!\" \nPlayers on Nekketsu High Dodgeball club have gone missing. \n \nThe National High School Dodgeball Tournament will take place at Sakuragaoka park of Shizuoka Prefecture, with Mount Fuji visible in the distance. Nekketsu High Dodgeball Club is led by Kunio to lead his team to battle against the world! \n \nIf Kunio wins the National championship, the World League is waiting. Will he find the aliens out in the world?!", "id": 38080, "name": "Nekketsu Koukou Dodgeball Bu: PC Bangai hen"}, {"genres": [14], "summary": "Baseball game with very dumpy players.", "id": 38101, "name": "World Stadium"}, {"genres": [15], "summary": "Strategy game where you design a robot by allocating points to various stats, then let it scrap it out with an opponent while you watch. \n \n(From The PC Engine Software Bible)", "id": 38069, "name": "Super Metal Crusher"}, {"genres": [14], "summary": "AKA: プロ野球 ワールドスタジアム'91. The Namco version of baseball game with fake roster of Japan Professional Baseball.", "id": 37660, "name": "Pro Yakyuu World Stadium '91"}, {"genres": [4], "summary": "Zeus has called upon you! Only a brave and fearless warrior can save his beloved daughter, Athena, from the cunning clutches of Nelf, evil Lord of the Underworld. Risen from the grave, you are presented with supernatural powers beyond this world. Collect the mystical spirit balls and transform into an awesome array of creatures - as Strongman, punch and kick harder than ever before, as WereWolf and WereTiger, rip the flesh of the demons of hell, and as Bear, knock out your enemies with one bad breath! You hear the distant cries of the beautiful Athena and as the terrors of the Underworld tighten their grasp, the beast within you rises to face the final battle! \n \nThis game was released only for the japanese NEC PC Engine.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/v27vkgji2a9nwahdrbac.jpg", "width": 2833, "cloudinary_id": "v27vkgji2a9nwahdrbac", "height": 2822}, "id": 38073, "name": "Juuouki"}, {"genres": [8], "summary": "Ankoku Densetsu ('Dark Legend') is widely considered to be the follow-up to the PC Engine classic Makyo Densetsu (1988) ('The Legendary Axe').", "id": 38095, "name": "Ankoku Densetsu"}, {"genres": [15], "summary": "Adult fruit machine simulator with 2 designs to choose from. \n \n(From The PC Engine Software Bible)", "id": 38104, "name": "PC Pachislot Idol Gambler"}, {"genres": [5], "summary": "Horizontal shooter that puts you in control of a robotic rabbit. \n \n(From the PC Engine Software Bible)", "id": 38066, "name": "Rabio Lepus Special"}, {"genres": [9], "summary": "An adult mahjong game and the sequel to the original Kyuukyoku Mahjong.", "id": 37680, "name": "Kyuukyoku Mahjong II"}, {"genres": [9], "summary": "AKA: 麻雀学園 MILD 東間宗四郎登場. A port from the arcade version of Mahjong Gakuen. This is the mild (no nudity) version.", "id": 37679, "name": "Mahjong Gakuen Mild"}, {"genres": [12], "summary": "Long ago, God has created Eve from Adam's rib ... but the ground of men and women has proved constantly unstable. Eventually, Man became cursed by the witch of Topaz. Ever since the curse of impotence, the man lost confidence, and the women fall to frustration. \n \nOne day, A baby boy was born in the castle town of Castle Tatsunda. It was the birth from a virgin conception. On his 15th birthday, the boy is asked by the king to defeat the curse, and become a savior.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ypydfv3gan4z6llx3ofl.jpg", "width": 1404, "cloudinary_id": "ypydfv3gan4z6llx3ofl", "height": 1411}, "id": 38099, "name": "Body Conquest II ~The Messiah~"}, {"summary": "This platformer sequel to Son Son was only released on the PC Engine in Japan. \n \nSon Son 2 is the direct sequel to Son Son and features an interpretation of the Son Goku character from ancient Chinese novel Journey to the West. Unlike the first game, which played like a ground-based scrolling shoot-'em-up with several floors the character could switch between, Son Son II plays much more like a traditional platformer, specifically Wonder Boy and even more overtly Capcom's earlier arcade game Black Tiger. Son Son attacks with his extendable staff (based on Sun Wukong's Ruyi Jingu Bang weapon) and can defeat enemies to earn coins, which can be spent on upgrades and health refills. The player also needs to find a key on each stage before they can reach the boss. \n \nThe goal of the game is to rescue the other members of his party: Xuanzang (Tripitaka), Pigsy and Sandy. They are kidnapped during the opening cutscene by the final boss, who is depicted as a mysterious silhouette. \n \nSon Son II is also one of the earliest Capcom games to use Zenny, their trademark fictional currency.", "id": 37689, "name": "Son Son II"}, {"genres": [12], "summary": "Jazeta brought peace back to the land. But as long as evil and fear live in the human heart, the dreaded Dirth, Emperor of Darkness, will be plotting his return. The Emperor is stirring under the peaceful surface of Neutopia, bringing suffering to its people. Who will save them? Jazeta, the hero, is lost in a labyrinth in a foreign land. Can his son withstand the powers of the Emperor of Darkness to rescue the good people of Neutopia from fear and despair?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pura2zz4qtcxwlg2hh32.jpg", "width": 300, "cloudinary_id": "pura2zz4qtcxwlg2hh32", "height": 361}, "id": 28523, "name": "Neutopia II"}, {"summary": "A single-screen action game featuring a chameleon that feeds bugs to Venus flytraps. \n \nCircus Lido, or Circus Ride, is an action game published by Uni Post exclusively for the PC Engine. \n \nThe goal of the game is to navigate the stage and defeat the enemies using the chameleon's two powers: his long tongue and his prehensile tail. The tongue can be used to capture enemies and spit them out towards the Venus flytraps, which are the only way to remove them from the stage. The tail can be used to climb vines scattered around, which allows the chameleon to ascend through the stage.", "id": 37724, "name": "Circus Lido"}, {"genres": [14], "summary": "Soccer game released in 1993 for the PC Engine. \n \nJ-League Greatest Eleven is a soccer game for the PC Engine published by Nichibutsu/Nihon Bussan. Despite the similar name, it has no relation to Konami's J-League Winning Eleven series. \n \nThe game features the Japanese soccer league's ten teams from its inaugural 1993 season. There's an exhibition mode with support for four players and a league mode where 1 or 2 players can face off against the computer. The game also offers an option to play with four human players, but only in the exhibition mode.", "id": 37684, "name": "J. League Greatest Eleven Soccer"}, {"genres": [8], "summary": "AKA: PC 原人3. The final sequel of popular head bump kid action game.", "id": 37663, "name": "PC Genjin 3 Special"}, {"genres": [10, 14], "summary": "A Formula One racing game for the PC Engine. The last of the F1 Circus games to be released for the system. \n \nF1 Circus '92, sometimes known as F1 Circus '92: The Speed of Sound, is a racing game for the PC Engine and part of Nichibutsu's F1 Circus series. It is the fourth and last game in the series to be released on the PC Engine platform, and the seventh game in the series overall. Like its predecessors, it is officially licensed by the distributors of Formula One in Japan, and also has the rights to use the real names of teams/drivers. \n \nThe game again focuses on top-down races that move at great speed and require a lot of memorization and careful driving. The player can easily be forced to retire from the race early if they take too much damage from collisions with the walls or other drivers. There's a strong customization element as well, and the player can choose to play a Special mode that includes dialogue with NPCs between races.", "id": 37714, "name": "F1 Circus '92"}, {"genres": [5], "summary": "Tatsujin is a vertical shooter by Taito and conversion of Toaplan arcade game originally released in 1988. The evil Gidans are about to invade the Borogo system, their armada of giant asteroids are approaching and they have to be stopped. The player must infiltrate and destroy no less than five large enemy facilities and take down swarms of alien ships and all kind of ground units. The space fighter comes equipped with a default Vulcan gun (Power shots) and two more weapons are available for the taking - the blue lock-on lasers (Thunder Laser) and green blasts of energy (Tatsujin Beam). The only way to increase the active weapon's firepower is to collect Power Boosters special flying pods leave behind. Although five boosters are necessary to trigger a power-up upgrade and boost up the strength of the current weapon, special red flashing power icons bring it up to maximum power in no time. Each weapon can be powered up to three times for maximum collateral damage and smart bombs in the shape of monstrous skull-faced energy blasts can be unleashed to kill most enemies on screen. Finally, speed boosters are strategically placed throughout the game to help the player dodge enemy fire more efficiently.", "id": 38096, "name": "Tatsujin"}, {"summary": "A top-down driving game where the player must deliver various packages around town, upgrading their moped as they complete jobs. The game has a subversive sense of humour. \n \nKattobi! Takuhai-kun (\"Fury! Delivery Boy\") is a top-down action/driving game from Advance Communications Company and Tonkin House. The player is a delivery boy who must make a series of increasingly surreal deliveries across town, occasionally leaving the country and getting into trouble with drug trafficking. As the player complete jobs, they can use their earnings to buy better two-wheeled delivery vehicles, upgrading from a pedal bike to a moped to a state-of-the-art motorcycle. Destroying their vehicle (by losing a life) drops them back down to the regular pedal bike. \n \nThe game was released exclusively in Japan on the PC Engine. It is perhaps best known to western audiences for its appearance on an episode of the Japanese video game TV show GameCenter CX.", "id": 37682, "name": "Kattobi! Takuhai Kun"}, {"genres": [8], "summary": "This is a single player platform game that features Hipopo, a platypus (referred to as a hippo) who must fight his way through a large number of enemy-packed levels in search of his missing girlfriend - rescuing other platypuses along the way. Hipopo is armed with water bombs which can be thrown at enemies to soak and damage them. Once soaked, the enemies can then be kicked and destroyed completely. Enemies left unkicked however will dry out and recover after a short period of time. \n \nThe level design presents moving platforms, collapsible floors, boats and water-wheels all making an appearance. Small plants also appear on certain levels which can be \"watered\", causing them to grow and creating new platforms. Appropriately enough for a game which features water as the main weapon, many of the enemies and the later levels have a fire thematic. He can also collect cakes and other items to gain more points.", "id": 38084, "name": "Mizubaku Daibouken"}, {"summary": "Ghouls 'n Ghosts (Japanese: 大魔界村 Hepburn: Daimakaimura?, lit. \"Great Demon World Village\") is a side-scrolling action platform game developed by Capcom and released as an arcade game in 1988, and subsequently ported to a number of other platforms. It is the sequel to Ghosts 'n Goblins and the second game in the Ghosts 'n Goblins series.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vdrwsrbtwram7xt61i9y.jpg", "width": 1672, "cloudinary_id": "vdrwsrbtwram7xt61i9y", "height": 1486}, "id": 38081, "name": "Ghouls & Ghosts"}, {"genres": [4], "summary": "Six fighters from around the world fight for supremacy and the prestige of being the strongest and sexiest fighter ever to grace the arena. With special moves and beautiful women, Games Express delivers the most beautiful fighter to PC Engine.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i24fo8nr5xqjfk80aewz.jpg", "width": 2808, "cloudinary_id": "i24fo8nr5xqjfk80aewz", "height": 2816}, "id": 38079, "name": "Strip Fighter II"}, {"genres": [5], "summary": "Taking a fair amount of inspiration from Sega's After Burner II, Battle Ace is a sci-fi based cockpit shooter. Gameplay is purely arcade style, with a standard machine gun and lock-on missiles to take down the enemy aggressors. There's little more to it than that.", "id": 38103, "name": "Battle Ace"}, {"genres": [12], "summary": "A spin-off of Hudson's Peach Boy RPG series that focuses on three side characters instead. \n \nMomotarou Densetsu Gaiden (\"Peach Boy Legend Side-Story\"), known as Momotarou Densetsu Gaiden: Dai 1-Shu (\"Peach Boy Legend Side-Story: Volume 1\") for PC Engine, is a non-core entry in Hudson's Momotarou Densetsu series of RPGs loosely inspired by the titular folklore figure. It was first released on the Game Boy in 1991, and then ported to the PC Engine the next year and the Famicom the year following that. \n \nThe game switches focus from Momotarou to three extra characters, each has their own distinct campaign to play through. One follows a standard RPG route of a hero's journey, another involves the princess of the kingdom of demons as she attempts to uncover an attack on her father's throne with a band of allied monsters, and the third involves a thief who steals money from monsters and gives it to beggars. Each campaign follows the core gameplay of the series: overworld exploration and turn-based combat.", "id": 37673, "name": "Momotarou Densetsu Gaiden"}, {"genres": [14], "summary": "Baseball game similar to the Namco's World Stadium. Batter out becomes an angel.", "id": 37670, "name": "Naxat Stadium"}, {"genres": [4], "summary": "Champion Wrestler gained popularity in the arcade, and now it is reborn on the PC Engine! Up to 2 people can play simultaneously as well, and you can also enjoy a large number of wrestlers and tag team. In order to take the TWF championship belt, the game will challenge you with formidable enemy skills.", "id": 38092, "name": "Champion Wrestler"}, {"summary": "Once popular action adventure game originated from NES. As known as Adventure Island.", "id": 37687, "name": "Takahashi Meijin No Shin Bouken Jima"}, {"genres": [14], "summary": "This game belongs in the Baseball Hall of Fame. Nothing takes you out to the ballgame like World Class Baseball! It tests all your baseball knowledge and skills. Bunt. Throw a slider. A change-u. Pick runners off base. Call in a relief pitcher. Hear the roar of the crowd and the crack of the bat. Play another player. Play against the computer. Play the Turbo Champs. Knock the dirt from your spikes. You're up!", "id": 37734, "name": "World Class Baseball"}, {"genres": [4, 14], "summary": "The first in the critically acclaimed Fire Pro Wrestling series, allowing for rapid wrestling action with unprecedented number of moves and a large roster inspired by wrestling legends from around the world.", "id": 38087, "name": "Fire Pro Wrestling: Combination Tag"}, {"genres": [9, 15], "summary": "Train themed board game featuring the Peachboy character from Japanese folklore. \n \n(From the PC Engine Software Bible)", "id": 38068, "name": "SUPER MOMOTARO DENTETSU"}, {"genres": [5], "summary": "A vertical-scrolling shoot 'em up that configures its difficulty to match the skill of the player. \n \nFinal Blaster is a vertical scrolling shoot 'em up for the PC Engine. The player is part of squadron of fighters sent to save the world from an alien invasion. Final Blaster hosts a number of features that are distinct to the game: the first is a charge shot that resembles a phoenix and is the only form of projectile that can destroy certain larger enemies. The second is that the game configures its difficulty depending on how many power-ups the player has when finishing a level, or how often they've been destroyed. \n \nThe game was unique to the PC Engine and did not see an international release outside of Japan. It came out on the same day as W Ring: The Double Rings, another shoot 'em up exclusive to the Japanese PC Engine.", "id": 37713, "name": "Final Blaster"}, {"genres": [5], "summary": "A horizontal shoot 'em up that casts you as a baby dragon out to free a princess from the clutches of an evil....well, you get the idea. Gameplay is traditional, with power-up weapons that include multi-way shot and 'miniature' mode and a sort of reverse R-Type beam where you don't shoot to power it up. Also contains 2 minute and 5 minute time attack modes.", "id": 37717, "name": "Coryoon"}, {"genres": [14], "summary": "Baseball", "id": 38089, "name": "Power League II"}, {"genres": [9], "summary": "Select a anime girl then answer questions to remove panels that cover girls' pictures.", "id": 37659, "name": "QUIZ Toukou Shashin"}, {"genres": [9, 10], "summary": "Race betting game on rabbits.", "id": 37651, "name": "Wallaby!!"}, {"genres": [14], "summary": "The stadium organ is pumping as you faceoff against international competition. Play any position, even goalie, with total control. Experience all the stick handling, slap shots, body checks and fisticuffs of world class hockey. Make strategic goalie and line changes. If their goon slams you into the boards, drop your gloves and duke it out. Now you're flying down the ice on a power play. You wind up and crank a high, blazing slap shot, but their goalie's reaching up and...Welcome to World War III, hockey style!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vh1sr0izup9rjlcfi6c4.jpg", "width": 706, "cloudinary_id": "vh1sr0izup9rjlcfi6c4", "height": 830}, "id": 8675, "name": "TV Sports Hockey"}, {"genres": [8], "id": 37721, "name": "PC Kid 3"}, {"genres": [15], "summary": "A stock trading revenue generation simulation game", "id": 37646, "name": "Tsuru Teruhito No Jissen"}, {"genres": [5], "summary": "For 3 years, alien invaders have been pounding the earth into a smoldering ruin. There isn't a man alive who can stop them. But now, there's Veigues, a devastating fighting machine! Built with captured enemy technology, he's our last desperate hope for survival ... and you're in control! Trash the invaders with the Plazma Cannon! Just keep your firepower hot and fight like there's no tomorrow. Destroy the aliens or there won't be!.", "id": 37733, "name": "Veigues Tactical Gladiator"}, {"genres": [8], "summary": "A platformer starring Hudson Soft's take on the famous Momotaro of Japanese folklore. The same concept would later be seen in the Momotaro Thunderbolt games for Game Boy. \n \nMomotaro Katsugeki (\"Momotaro Action Movie\") is a side-scrolling action-platformer from Hudson that uses their Momotaro character who is better known as the star of the Momotaro Dentetsu and Momotaro Densetsu series. It is a PC Engine exclusive and never saw international releases. \n \nMomotaro Katsugeki seems influenced by and plays similarly to Westone's Wonder Boy in Monster Land and the sequels that followed: the goal is to move across a set of 2D stages, and the player can talk to NPCs for hints and to purchase better equipment with the money they find. There is also a world map that links the various stages together. \n \nThe concept of a 2D side-scrolling action game featuring Momotaro would be further explored by Hudson with the two Game Boy Momotaro Dengeki/Thunderbolt games.", "id": 38082, "name": "Momotarou Katsugeki"}, {"genres": [9, 15], "summary": "Naturally a manga/TV anime tie-in, 21 Emon is one of those Japanese style board games that have never really made a big impact in the west. Four players (any combination of human and computer) take it in turns to roll dice and move around the isometric board, landing on various event squares. The ultimate aim is to build as many hotels as you can and make more loot than your opponents. \n \n(From The PC Engine Software Bible website)", "id": 38070, "name": "21-Emon"}, {"genres": [14, 15], "summary": "AKA: ワールドジョッキー. A horse race betting game.", "id": 37650, "name": "World Jockey"}, {"genres": [8], "summary": "Bonze is a Buddhist monk passing through Hell with only his prayer beads to protect him in this horror-themed Arcade platform. \n \nBonze Adventure, or Jigoku Meguri (\"Hell Tour\"), is an Arcade platformer featuring the eponymous Buddhist monk Bonze has he makes his way through the Shinto/Buddhist equivalent of Hell. He is beset by demons and yokai from all sides but is able to exorcise them with his prayer beads, which are thrown outwards with a bouncing motion. \n \nJigoku Meguri was first released to the Arcade in 1988 and later saw a Japan-only PC Engine port in 1990.", "id": 37709, "name": "Jigoku Meguri"}, {"summary": "A side-scrolling action game based on the manga and anime of the same name, concerning the private eye Ryo Saeba. \n \nCity Hunter is a side-scrolling action game exclusive to the PC Engine. The player controls Ryo Saeba, the eponymous \"City Hunter\" private eye who often takes assignments from attractive female clients. Despite his lechery, he's a highly competent gunman and very sharp when reading people. \n \nThe game is built similarly to Impossible Mission: Ryo explores buildings, checking doors for mission-critical NPCs and items while shooting the enemy thugs that attack him while investigating. It contains four stages, or \"chapters\", and appearances from various characters from the franchise like Ryo's partner Kaori Makimura, his rival Umibozu and his police contact Seiko Nogami.", "id": 37718, "name": "City Hunter"}, {"genres": [14], "summary": "AKA: パワーリーグ'93. The most successful baseball game franchise on PC-Engine. The year 1993 version featured Hideo Nomo.", "id": 37662, "name": "Power League '93"}, {"genres": [8], "summary": "AKA: 定吉七番秀吉の黄金. This is an adventure game based on a comic book series.", "id": 37656, "name": "Sadakichi Seven"}, {"genres": [9], "summary": "AKA: 麻雀学園 東間宗四郎登場. This is a port of the arcade version adult Mahjong game. Losing gals strip their clothes.", "id": 37678, "name": "Mahjong Gakuen"}, {"genres": [9], "summary": "A dual Mahjong game/RPG from Nihon Bussan. \n \nMahjong Shikaku Retsuden: Mahjong Wars (\"Mahjong Assassin Chronicles: Mahjong Wars\") is a PC Engine Mahjong game from Nichibutsu/Nihon Bussan, related to their Mahjong Triple Wars game. It features two modes: in one, the player takes on different opponents in one-on-one games, while in the other the player is walking around in an RPG world with party members and mahjong games as the \"battles\". \n \nThe original Mahjong Shikaku game was released for the Arcades and MSX2 and is a \"strip mahjong\" game. This enhanced PC Engine version removes the nudity.", "id": 37676, "name": "Mahjong Shikaku Retsuden: Mahjong Wars"}, {"genres": [5], "summary": "Gunhed also known as Blazing Lazers, is a 1989 sci-fi shoot 'em up video game developed by Hudson Soft and Compile. It was released in Japan on July 7, 1989 for the PC Engine, and it was released in North America in November 1989 for the TurboGrafx-16. It was later released on the Wii's Virtual Console in North America on May 21, 2007, in Europe on May 25, 2007, in Australia on July 30, 2007, and in Japan on June 17, 2008. It was released for the PlayStation Network on July 21, 2010 and on the Wii U's Virtual Console on June 11, 2014 both in Japan. It is based on the Japanese film Gunhed (only referenced in the Japanese version). In the game, a fictional galaxy is under attack by an enemy space armada called the Dark Squadron, and this galaxy's only chance for survival is the Gunhed Advanced Star Fighter, who must destroy the Dark Squadron and its Super Weapons. The gameplay features fast vertical scrolling and a wide array of weapons for the player to use.", "id": 37710, "name": "GUNHED"}, {"summary": "Ninja Action! The stage is set for conspiracy, mystery and evil in America. Come with Ninja Ryu as he takes you on his fateful journey. Tecmo's unique cinema display system develops the story stage by stage. You piece together the puzzle, while watching the movie-like graphics. Decide what action to take. Use the secret sword and items collected during the action scenes to fight your way to the goal!", "id": 38083, "name": "Ninja Ryuukenden"}, {"genres": [5], "summary": "Amidst the clutter of arcade shooters in the late 1980s, companies needed to make their games stand out in some way. Simply flying a ship into outer space simply wasn't going to cut it anymore. Taito had an idea. Yes, there was still a spaceship. And yeah, that \"outer space\" part was still there too. But instead of the usual aliens, you fought fish. \n \nYes, fish. \n \nNot even regular, aquatic fish, but robotic fish with lasers equipped to their fins, giant metal teeth and missiles firing from their gills. And not just fish either. There are squid, snails, and other undersea variations out for your blood as well. \n \nThe requisite plot is about the people of the planet Darius, who are being terrorized by said intergalatic fish. Only the heroic pilots Proco Jr and Tiat Young can save the day. The constant star of the Darius series is the Silver Hawk. Much like Gradius, it has a primary, forward firing weapon, along with bombs that can be used to attack vertically, and the usual shield. \n \nThe arcade game Darius games also used a unique system that attached three monitors together to create one massive horizontal playing field (also used in Taito's Ninja Warriors.) Naturally, this couldn't quite be replicated on the console system, so that nifty little gimmick is lost, but emulators can still replicate the dimensions of the screen, even if you end up looking at a tiny picture. \n \nLooking to further set itself apart from the crowd, every Darius game has multiple levels, with several branching paths throughout the game. It adds tremendously to the replay value, especially since there are usual multiple endings, depending on which final zone you end up at. \n \nDarius is a two-dimensional horizontally scrolling shoot 'em up set in a fictional future. Uniquely among shoot 'em ups, the game's screen was three times wider than conventional size, and the arcade cabinet used an arrangement of three screens to accommodate it. The player controls an ornate fighter spacecraft, named the Silver Hawk, and must navigate through scrolling terrain while battling a variety of fighter craft, ground vehicles, turrets, and other obstacles throughout the game's stages (referred to as zones in the game). The ship's arsenal consists of forward-firing missiles, aerial bombs and a protective force field, all of which can be upgraded by power-ups (in the form of large, colored orbs) that are dropped by specially-colored enemies throughout the game's zones. When the player reaches the end of a zone, a boss appears, which must be defeated to proceed. Once the boss of a zone is destroyed, the player is given a choice of which zone to play next via a branching path. While there are 28 zones in total, only seven can be played in a single run. \n \nWhen various ports of it were made for different consoles, Taito (and others) were forced to shrink the playfield to fit on one screen. \n \nIt was released for the Commodore Amiga, Atari ST, PC Engine, PC Engine (Super CD-ROM), Wii (Virtual Console), and ZX Spectrum. \n \nThe PC Engine saw three releases: \n \nDarius Alpha (1990): A very rare beta release. This is one of the rarest Hu-Cards ever published. You could only get a copy of this hardcore shoot-em-up by buying Darius Plus and Super Darius and then mailing coupons to the publisher. 800 copies were made available, and names were drawn from those who mailed their info in. Some copies of the game were also given away as prizes by PC Engine Gekken and Marakatsu magazines. \n \nDarius Plus (1990): The full game itself, again a PC Engine HuCard. The bosses that were removed in Alpha do not return here. Both Alpha and Plus were actually written for the PC Engine SuperGrafx and playing them on that console results in slightly improved graphics (less flicker and slowdown). \n \nSuper Darius (1990): A conversion of Darius for the PC Engine's Super CD-ROM, very close to the original arcade version other than being single-screen. Features new bosses, as well as a \"boss rush\" mode.", "id": 38078, "name": "Darius Plus"}, {"genres": [14, 15], "summary": "A baseball game for the PC Engine that features athletes and teams from the 1990 Nippon Professional Baseball league. \n \nKore ga Pro Yakyuu '90 (\"This is Pro Baseball '90\") is a PC Engine exclusive baseball game and the sequel to Kore ga Pro Yakyuu '89. It did not see a sequel. It features twelve teams and their players from the official Nippon Professional Baseball organization. \n \nKore ga Pro Yakyuu '90 is a traditional 16-bit baseball game. The camera is positioned behind the batter, with cutaways showing other players on the bases. The pitching player can also use this view to change the formation of their fielders before the next pitch. Once the ball connects with the bat, the view switches to a distant top-down view so that the player can manage their fielders.", "id": 37686, "name": "Kore ga Pro Yakyuu '90"}, {"genres": [9], "summary": "AKA: 琉球. The goal is to make valid poker lines to see girls pictures behind.", "id": 37657, "name": "Ryu Kyu"}, {"genres": [9], "summary": "AKA: 麻雀悟空スペシャル. It is a 4-player Mahjong game based on the story of Journey to the West.", "id": 37677, "name": "Mahjong Gokuu Special"}, {"summary": "AKA: Tiger Road or 虎への道. Scrolling action game using a monk character.", "id": 37647, "name": "Tora E No Michi"}, {"genres": [5], "summary": "On Earth in the 23rd century, a space time warp opens up over the Atlantic Ocean. From it comes an enormous invasion force analyzed to come from the 25th century. As Earth is attacked by the alien war machines, it is revealed that the culprits are identified as the Gader'el, a race of large bio-mechanic creatures, who have the ability to freely manipulate space and time; after conquering the future Earth in the 25th century, the Gader'el decided to ensure their influence on mankind by traveling back in time to the 23rd century, conquering that time and then going further into Earth's past. \nAs the armed forces of every country on Earth combats the Gader'el, each scientific academy collaborates on making a weapon capable of destroying the Gader'el's strongest weapons. The result is the Dryad, a single-fighter spaceship capable of wielding several types of futuristic weapons. The Dryad's flight path and mission is to warp into the Future Zone in order to reach the Gader'el headquarters and destroy their leader.", "id": 37712, "name": "FINAL SOLDIER"}, {"genres": [4, 14], "summary": "The follow-up to the revolutionary wrestling game from 1989. This sequel features more wrestlers, more distinctive moves and a much larger roster with hidden wrestlers to be discovered.", "id": 38086, "name": "Fire Pro Wrestling 2: 2nd Bout"}, {"genres": [14], "summary": "A second sequel to the pinball game.", "id": 37654, "name": "Time Cruise II"}, {"genres": [9], "summary": "Wai Wai means many people making noise so obviously this is a 4 player Mahjong game playing against many different characters.", "id": 37652, "name": "Wai Wai Mahjong"}, {"genres": [14], "summary": "It's your serve. WHOP! The ball clears the net at 100 MPH and raises a little dust just inside the chalkline. An ace? no. WHOP! Your opponent returns with a powerful backhand that kills your plan of charging the net. No matter how you play - with up to 3 friends, singles, doubles, or against the computer - World Court Tennis will tax your endurance and test your skill with action that's fast and furious. Just don't scream at the line judge. He's never wrong.", "id": 37732, "name": "World Court Tennis"}, {"genres": [14], "summary": "Top Athletes Battle for Glory! \n \nYou create an athlete who runs, jumps, and throws! Aim for the world record...and never give up! \n \nWith 18 events to choose from... \nWith 6 categories, and a total of 18 exciting events, you'll have a wide choice to train for. Then go on to challenge Olympic Mode in your chose event. you too can be a world record holder! \n \nExcitement x 5! \nExciting alone, unbelievable with friends! Up to five players can compete at once, for some serious adrenalin action!", "id": 37731, "name": "World Sports Competition"}, {"genres": [9], "id": 38071, "name": "Spin Pair"}, {"summary": "AKA: 魔境伝説. The jungles surrounding the village of Minofu are under the thumb of the evil Jagu cult who require a blood sacrifice. A beautiful young woman named Flare has been selected as this season’s offering, however her boyfriend Gogan will not stand for it. Equipped with the legendary axe ‘Sting’, he braves the six zones of Jagu’s territory to defeat the cult and save his love. \n \nThroughout the zones are breakable Jagu idols which drop various sized gems for points leading to extra lives, health revitalizing orbs of differing strength, crown-like crystal containers, and wing icons. Four crystal containers can be earned which charge the destructive power of Sting’s strike, while up to two wings can be collected increasing the speed of subsequent strikes. \n \nEach time you use the axe, the power meter drains completely then recharges as long as you don’t continue to swing. The added strategy of - is it better to dodge and charge the axe for a crushing blow, or is it better to hack away as fast as possible – sets this game apart from most other hack-n-slashers. When you die, one level of speed and axe power is taken away and you must re-find an icon to get it back. The game doesn’t lock you to only scrolling right, so there are times where you can backtrack to find items. \n \n-http://www.pcengine.co.uk/HTML_Games/Legendary_Axe.htm", "id": 37674, "name": "Makyou Densetsu"}, {"genres": [5], "summary": "Konta the little fox is in trouble - while on a walk with his girlfriend Inari, he \"accidentally\" broke the magical seal that held the evil tanuki raccoon Jikanda and his minions prisoner. They have abducted Inari and Konta is in great despair. He decides to seek assistance from the gods and ask them for help. A flying Tengu answers to his desperate plea.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bssvnqurvtdyip098cqa.jpg", "width": 893, "cloudinary_id": "bssvnqurvtdyip098cqa", "height": 879}, "id": 38076, "name": "Hana Taaka Daka!"}, {"genres": [5], "summary": "Toilet Kids is a vertical shoot 'em up featuring a world filled with scatological enemies and humor. It was released exclusively on the PC Engine. \n \nA young boy is accidentally flushed town the toilet one night, appearing in a mysterious world, and must defeat the world's guardian before he can go home. The game has four stages total, each of which has a different theme, and the player is able to target both air enemies and ground enemies in a system similar to that introduced in Xevious.", "id": 38072, "name": "Toilet Kids"}, {"summary": "A game of reflexes and strategy inspired by the classic Arcade game Snake. \n \nGomola Speed is a top-down action game in which the player increases the size of their snake-like protagonist by collecting and uniting the various segments moving around the level. When long enough, the player character can wrap themselves around stunned enemies - the player can drop bombs that will momentarily stagger any enemy caught in the blast - and valuable food in order to acquire them. Once all the food has been collected, the exit opens somewhere in the level and the player can progress. Progressive stages have different gimmicks and solutions to completing them. \n \nThe game was developed by UPL and released exclusively to the PC Engine in Japan.", "id": 38093, "name": "Gomola Speed"}, {"genres": [9], "summary": "Pushing around boxes in store rooms may not sound like ideal fodder for a video game. Well, they went and made one anyway. this is one of those brain melting puzzle games that some will love and some will despise. Each level you are presented with a room with boxes and spots, which are where the boxes should end up. You can push the boxes, but not pull them and you really have to plan in advance to stop getting, um...'boxed' in. If you feel you've taken a bit of a wrong turn, you can simply push a button and rewind your moves. But as well as countless levels of box-shoving there's also a level editor that allows you to create your own levels of fun and frustration. \n \n(From The PC Engine Software Bible)", "id": 38102, "name": "Sokoban World"}, {"genres": [9], "summary": "In this game you play Hanafuda against girls and make them strip.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mqot5eybiwjqepv9lsa5.jpg", "width": 1416, "cloudinary_id": "mqot5eybiwjqepv9lsa5", "height": 1402}, "id": 37664, "name": "Idol Hanafuda Fan Club"}, {"genres": [9], "summary": "Traditional shogi (Japanese chess) and monster-based shogi game.", "id": 37672, "name": "Morita Shogi PC"}, {"summary": "AKA: ならずもの戦闘部隊 BLOODY WOLF. Taking inspiration from games like Ikari Warriors and Commando, with a good dollop of Rambo to top it off, Bloody Wolf gives you guns, death and destruction. What more could you want? Viewed from a sort of overhead/side on angle, you have to make your way through town, river, forest and many other types of terrain with just your wits and a massive weapon under your arm. Along the way you will get the chance to rescue hostages - hiding in trucks, caves, tied to trees etc - and by opening crates you gain useful power ups. These include things like spread shot, flame thrower, rockets and frag grenades, but also contain more subtle items like flippers that allow you to move faster when ducked under water. Also, if you manage to shoot someone off their motorbike, you can get on it and race away, mercilessly running down anyone who gets in your way. At various points in the level you will come across bosses that break up the action a little. Also, you have the ability to jump, which comes in handy when traversing chasms or avoiding any suspicious rolling logs that may be out to get you. \n \n-http://www.pcengine.co.uk/HTML_Games/Bloody_Wolf.htm", "id": 37671, "name": "Narazumono Sentou Butai"}, {"genres": [12], "summary": "A sequel to Hudson's RPG featuring Momotarou: the Peach Boy of Japanese folklore. The oni are cooking up another scheme and it's up to Momotarou and his companions to travel the world and stop them. \n \nMomotarou Densetsu II (\"Peachboy Legend II\") is an RPG for the PC Engine of the standard turn-based Dragon Quest mold. It is the second proper game in Hudson's Momotarou Densetsu series - which would later spawn the Momotarou Dentetsu series of railroad virtual board games - and features numerous other figures from Japanese mythology. \n \nThe general structure of the game has Momotarou cross the world with his animal NPC companions, solving the problems of each new town or village he comes across. Upon successfully resolving their demon problem, the town thanks him with elaborate celebrations. Momotarou can eventually pick up a large number of allies, who all follow behind him on the world map. Rather than force the player to locate each new location, they can send their animal companions to scout ahead to eliminate the amount of wandering around.", "id": 37655, "name": "Momotarou Densetsu II"}, {"summary": "Cross Wiber is an special inspector of the cyber combat police. Several years after the happenings in Cyber Cross, a new threat threatens Earth: Duma and his alien forces. Wiber now starts his counter-attack on Duma.", "id": 38088, "name": "Cross Wiber: Cyber-Combat-Police"}, {"genres": [12], "summary": "A PC Engine Action-RPG based on the famous Japanese novel series Nansou Satomi Hakkenden. The gameplay is at least partly inspired by Falcom's Ys series. \n \nMakai Hakkenden Shada is an action-RPG from Data East that was released on the PC Engine (the Japanese TurboGrafx-16) in 1989. The game bears more than a close resemblance to Falcom's Ys: specifically the first game in the series, The Vanished Omens, which was a huge success for the PC Engine a few months prior as well as being a generally well-regarded computer RPG before then. As well as having a similar nude female figure in the opening intro, the game also borrows Ys's combat system: fighting occurs by walking into enemies at a slight angle, causing them to collide with the player character's weapon (which hurts them) rather than the player character himself (which hurts the player character). The various gauges for health and experience are also similar. \n \nMakai Hakkenden Shada is based on a centuries-old Japanese novel series called Nansou Satomi Hakkenden, or \"Eight Dog Chronicles\", that features eight half-brother samurai who are all descended from the same dog and have the Japanese word for \"dog\" somewhere in their names. While these books have been referenced or adapted many times in other media such as manga and film, Makai Hakkenden Shada and the Famicom RPGs Satomi Hakkenden and Shin Satomi Hakkenden: Hikari to Yami no Tatakai are the only direct video game adaptations. Okami also contained an oblique reference to the novels. \n \nUnlike Satomi Hakkenden, which eventually allowed the player to recruit all eight of the central characters of the novel series, Makai Hakkenden Shada only has the one playable character. Instead, other characters from the novels occasionally appear to help the player.", "id": 37675, "name": "Makai Hakkenden Shada"}, {"summary": "This action platformer features a samurai ghost from the depths of the underworld. In a past war, Kagekiyo managed to defeat the shogun Yoritomo and his clan. However, their evil spirits were not completely destroyed, and now, in the world known as Dark Side, they seek the time of their rebirth. In order to shatter those ambitions, Kagekiyo must make his way across seven zones and head for \"The Heart of the Darkside\" where Yoritomo lies in wait. Use spirit weapons to power up your sword, or other items, such as candles to recover health, and defeat the endless hordes of enemies. Each zone is not only protected by a boss but also includes demons as well as real samurai from 12th-century Japan. Get ready for some intense one-on-one combat action.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ij1klaxzgngsegbqsnrt.jpg", "width": 1524, "cloudinary_id": "ij1klaxzgngsegbqsnrt", "height": 2156}, "id": 42119, "name": "Samurai Ghost"}, {"summary": "Unlicensed PC Engine release by Games Express. AV Poker is not a full poker simulator, but a simple gambling game. You choose from Normal, which is a standard game or Special Mode, where you travel around the world to show off your gambling skills. The poker part of the game is extremely simple. You place a bet, get a hand dealt to you, choose which cards to hold, and get a second deal to fill in the discards. If you match any of the standard poker hands, you win. You then get the options of taking the cash or playing a higher-lower game to increase your winnings significantly. Occasionally, you also get a fruit machine style mini-game which gives you the chance of winning 'special' cards that can be used during the game.", "id": 42089, "name": "AV Poker: World Gambler"}, {"genres": [5], "summary": "Developed and released alongside the Family Computer version, 1943 Kai: Midway Kaisen is an arcade game, an \"alternate\" version of the original 1943, released in 1987[3] only in Japan. Most of the graphics and sounds have been reworked, and the game has been made more \"extreme\" (laser-firing WWII planes and ships that run on ground). Further, the trademark P-38 has been replaced with a Boeing Stearman E75 N68828. \n \nIn 1991, this version was converted to the PC Engine as simply 1943 Kai, again Japan-only; this version itself contains many additional levels and original music. \n \nThe game is set in the Pacific theater of World War II, off the coast of the Midway Atoll. The goal is to attack the Japanese air fleet that bombed the American aircraft carrier, pursue all Japanese air and sea forces, fly through the 16 stages of play, and make their way to the Japanese battleship Yamato and destroy her. 11 of these stages consist of an air-to-sea battle (with a huge battleship or an aircraft carrier as the stage boss), while 5 stages consist of an all-aerial battle against a squadron of Japanese bombers with a mother bomber at the end. \n \nAs in 1942, players pilot a P-38 Lightning. Controls are also similar: button 1 fires main weapons, and button two performs two special actions: a loop maneuver like in 1942, or one of three special attacks in exchange for some of the player's fuel. Indeed, players now have only one life, in the form of a large \"fuel\" meter; constantly depleting, but refillable by collecting various powerups (chiefly \"Pow\" icons). In 2-player mode, when both players overlap their planes on screen, the energy bar can be transferred from the player with more fuel to the player with less. Destroying a complete formation of red enemy planes will result in a power-up, such as a health boost or a new main weapon. \n \nThere are cheat codes, different for every stage, ranging from holding down a fire button or pointing the joystick in certain direction, player(s) are rewarded with fully upgraded weapons.", "id": 42079, "name": "1943: Kai"}, {"genres": [8], "summary": "Rolling Thunder-esque platform beat 'em up which gives you the ability to transform into a brightly coloured Power Suit as you fight crime on the streets.", "id": 42083, "name": "Cyber Cross"}, {"genres": [14], "summary": "Take to the ring and fight against strangely familiar looking opponents in this first-person boxing game. Block and dodge with the D-Pad while using the buttons to punch with either left or right fists. Hold the button down and you get a more powerful hit, but it requires more timing and accuracy to be effective. \nSource:http://www.pcengine.co.uk/HTML_Games/Digital_Champ.htm", "id": 42076, "name": "Digital Champ"}, {"genres": [8], "summary": "Kaizō Chōnin Shubibinman 2 is the sequel to the more than average first title released in 1989 for the PC Engine system. The strong Tasuke and the cute Kyapiko (aka Arnold and Sonya in the American version) are back in this intense side scrolling action game. This time around, our heroes have swapped their power-swords for more conventional laser guns. The guns can also be charged up (by holding the fire button) to unleash powerful blasts of energy. Another interesting feature of the game is the alternance of platform and shooting stages. For instance, right after the first level and the crazy chase jumping from building tops to building tops, our heroes embark on a pocket-submarine and get their way through a treacherous underwater cave. A two simultaneous player mode is available and, interestingly, both players share the same life bar.", "id": 42062, "name": "Transforming Superhuman Shockman II - A New Transforming Enemy"}, {"genres": [8], "summary": "Break out the bandages and get ready for some finger-searing action! Join Bubby on his latest quest to save the universe, this time with a Magic Umbrella. Umbrella!? Yes, Umbrella! This powerful parasol puts the elements themselves at your command! Shock the tonnage out of the whales with Lightning! Fry the feathers off the crazed, beady-eyed birds with Fire! Or, drown the demented dinosaurs with a tidal wave of Raindrops! Need help? Your buddy Bobby is always nearby. Have a friend plug into your TurboTap and blast into two player simultaneous play. Be prepared for a quest that will take you to eight amazing planets, forcing you to uncover the secret that will unleash the Parasol Stars! \n \nParasol Stars is the third game in the Bubble Bobble franchise (and is often labeled \"Parasol Stars: The Story Bubble Bobble III\"), as well as a semi-official sequel to the second Bubble Bobble spin-off, Rainbow Island.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vi7hjy8ertcqxwfgz3gj.jpg", "width": 1527, "cloudinary_id": "vi7hjy8ertcqxwfgz3gj", "height": 2156}, "id": 42101, "name": "Parasol Stars: The Story of Bubble Bobble III"}, {"genres": [9], "summary": "Be Ball is an action/puzzle game in which you have to roll coloured globes around the play area and deposit them on their relevant coloured squares. Once all balls are in place it's on to the next level. Easy, right? Well, maybe not, as there is all manner of wildlife out to put paid to your spherical antics, from hedgehogs to monkeys and penguins. Luckily, the balls themselves do have a use - give them a swift kick and they'll get rid of any creature barring your way. And if you are persistent, you can even whack down walls. Also, be on the lookout for various items scattered around that aid you in your task, like time-stops, smart bombs etc", "id": 42072, "name": "Be Ball"}, {"genres": [12], "summary": "Mecha strategy game developed by Masaya in 1987. \n \nGaiflame is a turn-based strategy game from Masaya that was released on a number of Japanese home computers, as well as the PC Engine. No version of the game was ever released outside of Japan. \n \nThe player moves around mecha and jet units around a world map, trying to conquer as much territory from the forces of darkness as possible in order to repel them. When two opposing sets of troops occupy the same area, the game switches to a hexagonal grid where the two forces clash. When units meet in combat, the game uses animated cutaways demonstrating the exchange of damage. \n \nGaiflame is considered a precursor to Masaya's Langrisser series, along with Gaia no Monshou and Elthlead.", "id": 43189, "name": "Gai Flame"}, {"genres": [5], "summary": "Power Gate is a side-scrolling shoot 'em up, developed by Make and published by Pack-In-Video, which was released exclusively in Japan in 1991.", "id": 42130, "name": "Power Gate"}, {"genres": [5], "summary": "The powered-up Zonk gathers his friends to form Team Cool, and they set out to stop King Drool’s plan to conquer the world. Choose from 3 levels of difficulty and 3 types of Friend Modes. Shoot King Drool's cyber robots and avoid their attacks while collecting the Air Bones to unleash a variety of attacks. Enjoy unique moves such as combining with a friend to create an invincible hybrid form or blasting enemies with a charged attack. Air “Zonk” is filled with humor, like its wacky theme song that plays when you post a huge score or when your game is over.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ksvex2fcrftpdevuefeq.jpg", "width": 800, "cloudinary_id": "ksvex2fcrftpdevuefeq", "height": 747}], "id": 42129, "name": "Air Zonk"}, {"genres": [8], "summary": "Kato & Ken Detective Agency are assigned the task of locating a missing rich man, and you can choose either Kato or Ken to go on the mission. Your partner doesn't like this one bit, so he decides to make a nuisance of himself along the way. Similar to Adventure Island, you must make your way through several levels, destroying wildlife along the way, but instead of using a hammer, you have three different ways to kill them: jump on or kick them, or when they are walking on the ground, blow gas out of them. \n \nWhile scrolling through the level, your vitality will decrease, but it can be restored by collecting fruit and junk food. During your travels, you will also encounter your partner doing things that shouldn't be done in public, but sometimes, he will throw stuff at you to make you lose some of your vitality. The only way that you can deal with him is by kicking him where it hurts. \n \nAlong the way, you can enter doors. Doing this will give you a hint about the level and your vitality will be increased as well. You can kick certain objects such as lamp posts, trashcans, or thin air to obtain coins, or to make hidden platforms appear. Coins can be used in slot machines that will give you extra vitality, more lives, extra coins, and more. Slot machines only appear when you enter certain doors.", "id": 42074, "name": "Kato Chan & Ken Chan"}, {"genres": [8], "summary": "The original Doraemon game that was released in the US as Cratermaze.", "id": 43194, "name": "Doraemon: Meikyuu Daisakusen"}, {"genres": [5], "summary": "Biologically themed shooter including side-pod powerups that can be positioned around your ship.", "id": 42091, "name": "Formation Armed F"}, {"genres": [8], "summary": "Cute platformer based on the Chinese Legend of The Monkey King.", "id": 43196, "name": "SonSon II"}, {"genres": [14], "summary": "Futuristic dodgeball game with a choice of fantastical teams (some suspiciously like certain famous movies) and a varied collection of themed courts.", "id": 42054, "name": "Cyber Dodge"}, {"genres": [14], "summary": "A golf sim from Data East for the PC Engine. It later received a rerelease on the Wii Shop in Japan. \n \nWinning Shot is a golf game for the PC Engine/Turbogfrafx-16 and was the very first game based on the sport to be released for the system. Up to four human players can play, though because of the nature of golf, each player takes alternating turns depending on their distance from the hole. The game has many similar features to golf games of this era - the player can select which club to use, whether or not to hit the ball at a slight angle to adjust its trajectory and which direction to hit the ball towards, before hitting the requisite power gauge at the right point to send the ball flying as close to the hole as possible.", "id": 43190, "name": "Winning Shot"}, {"genres": [4], "summary": "Boss Kara and his evil horde has captured the entire kungfu province. You are summoned - You obediently go knowing full any of Kara's bullies could no doubt put out your lights. You must face them and their specialties one by one .. then finally Kara himself. A sip of a sacred tea releases hidden powers, but will it be enough? Play it so .... a hundred million Chinese are counting on it.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/heni3lbkubrvnnaghbzj.jpg", "width": 1417, "cloudinary_id": "heni3lbkubrvnnaghbzj", "height": 1403}, "id": 42127, "name": "China Warrior"}, {"summary": "Hecate, the Queen of Darkness, has feasted on your blood. Now you must destroy her or be hers forever, one of the Walking Undead. Hecate's bite has given you the power to change into a wolf, a bear, and other animals to battle hordes of monsters and ghouls who protect her. You must search for the one correct route through level after level of unspeakable terror to find her. Choose the most devastating weapons and become the animal best able to fight each fiend. Will you defeat Hecate or become her grotesque slave for eternity? Either way, the Queen of Darkness waits for you!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vi69av9topicrsww2zhv.jpg", "width": 1426, "cloudinary_id": "vi69av9topicrsww2zhv", "height": 1414}, "id": 42103, "name": "Night Creatures"}, {"genres": [14], "summary": "Power League III is a Sports game, published by Hudson, which was released in Japan in 1990.", "id": 42096, "name": "Power League III"}, {"genres": [5], "summary": "David Goldman is an amateur photographer, who always loved to take pictures. One day, he went to Los Angeles Photography School to study more about taking pictures. Everyday, David commutes on the crowded trains, but trained and learned better in the academy so he can achieve his dreams on becoming the best photographer he ever wished for. He was happy at that time, but suddenly misfortune hit him. David's parents suddenly died in a plane crash, leaving him orphaned and all alone. He loved his parents deeply and cried at their burial, thinking that they will come back. David lost his confidence and is about to leave the academy to live a lonely and sad life. However for Dean, the principal of the academy saw him and made an unexpected proposal to him. The principal said if he completed 8 tests by taking 8 special photograph shots in 8 different locations, then he's allowed to graduate in the academy. Unsure about this offer, David still accepted the test and did everything he could to pass.", "id": 43199, "name": "Gekibo: Gekisha Boy"}, {"genres": [5, 8], "summary": "Overhead shoot 'em up featuring all manner of toys as enemies.", "id": 43195, "name": "Toy Shop Boys"}, {"genres": [14], "summary": "A comedic baseball game in which players kick the incoming ball before running the bases. \n \nKickball is a comedic sports game developed by Dual and published by Masaya exclusively for the Japanese PC Engine. It resembles baseball, complete with a diamond of bases to around, but the \"batting\" player is actually kicking the ball. The rest of the game plays like a normal round of baseball. \n \nIt features seven characters - each of which represents a team of identical athletes - each with their own special pitch/kick move. These characters also include the two protagonists from the Kaizou Choujin Shubibinman series: Tasuke and Kyapiko (or Arnold and Sonia, as they're known in Shockman). Each team also has an assigned stadium that fits their theme: the seal team, for instance, have a stadium with an ice-like floor.", "id": 42051, "name": "Kick Ball"}, {"genres": [5], "summary": "A cyberpunk multi-directional shoot 'em up for the PC Engine. \n \nMetal Stoker is a top-down, multi-directional shoot 'em up for the PC Engine, developed and published by Face (possibly through their subsidiary brand Sankindo). The game features the subtitle \"Neo Hardboiled Shooting\". \n \nThe goal of the game is to explore each stage, fight a boss and move onto the next. Some stages are comprised of several linear enclosed areas that require that the player clear the room of enemies before they can proceed, while others are more open and let the player scroll in multiple directions while seeking out their foes. The story is sparse, and concerns the player's testing out of a new Custom CS-05 tank through a series of simulations. \n \nThe game was released exclusively for the PC Engine. It has yet to be rereleased in any capacity.", "id": 42059, "name": "Metal Stoker"}, {"genres": [14], "summary": "Compete in various olympic style events in this Track and Field inspired collection of sporting activities.", "id": 43193, "name": "Power Sports"}, {"genres": [5], "summary": "Ripple is a student of magic, and her teacher is a terrifying witch. Ripple is particularly afraid of her teacher right now, because she's just broken a promise she made to the witch: Ripple took a peek inside the forbidden book Sleeping Demons! No sooner had she opened the cover then out jumped six demons, all of which raced away! Unless she can catch all six demons and get them back inside the book, the witch will turn Ripple into a frog for breaking her promise! So Ripple sets off on her quest with her two Elf-Star friends, Topsy and Turvy. Good luck, Ripple!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/a5ih4smq40lgguae0yrh.jpg", "width": 1423, "cloudinary_id": "a5ih4smq40lgguae0yrh", "height": 1397}, "id": 42126, "name": "Magical Chase"}, {"genres": [5], "summary": "Set several years after the events of the original TwinBee, TwinBee and WinBee are relaxing at their island when they receive an SOS signal from the distant planet of Meru. The signal contains a message sent by Queen Melora, who pleads for the salvation of her planet from the invading forces of the evil alien Iva. TwinBee and his friends decides to set off to outer space to defeat the forces of Iva and save Planet Meru.[5] Detana!! marks the first appearance of TwinBee's and WinBee's respective pilots, Light and Pastel, who became prominent characters in many subsequent TwinBee video games and related media, although they were originally unnamed in this game (the characters were given their names in the audio drama TwinBee Paradise).", "id": 42077, "name": "Detana!! TwinBee"}, {"genres": [15], "summary": "Gaia no Monshō (also known as the 'Crest of Gaia') is a fantasy round-based strategy game by NCS and conversion of a game originally released for the NEC PC-8801 in 1987. The Light and Dark forces are engaged in a fierce war and Böser, leader of the Dark Army, is now ready to capture the Rall Tower, source of the world's energy. Sieghart, leader of the Light army, is the only one who stands between the evil Böser and the complete decimation of the kingdom. Gaia no Monshō is a turn-based strategy game at heart - the player moves troops around a battlefield and attacks nearby enemy units. An Auto Battle mode is also available and gives the option to let the AI figure out of the player's next move. The game offers several play modes - the first one (Scenario Mode) gives the player the chance to jump straight into battle using predefined troops. The second (Construction Mode) allows him to build his own army using unit points. The last one (Campaign Mode) conveys story plot elements and starts in the siege town of Dirl, where king Sieghart battles the fierce Böser. This mode requires more complex strategy and the player must assemble his own troops using unit points and units lost in battle don't come back during the campaign. Unlike the other two modes, it offers a password system to save the player's progress through the game.", "id": 42063, "name": "Gaia no Monshou"}, {"genres": [8], "summary": "Hanii on the Road (aka Hany on the Road or Honey on the Road) is a side scrolling action game by Face. After Hanii's exploits in Hanii in the Sky, the little Haniwa clay doll is back on a new mission. This time around, our cute friend must free the world from all the demons and other evil creatures that escaped from the Gods' realm. But this time around he's not flying or shooting balls of energy - instead, he must run along a roadway divided into four lanes, each moving at different speeds. And things are just not as easy as it may sound - Hanii has to jump over various enemies and try not to fall into deep holes dug into the ground, without forgetting the occasional change in scrolling direction and the myriad of other exciting, and often lethal, effects. A time limit also urges him to hurry and to quickly reach the end of each stage. Every little helps, and tiny wood signs scattered around every road tell Hany how far the next exit is. Additionally, special items can be collected along the way, such as Blue jars giving Hanii extra lives (twenty five of them need to be collected though), Mystery Jars giving from 100 to 1000 points, Extra Lives, Time Clocks, Rockets, Trampolines and other unique and often bizarre super powers (he can turn into a race-car or an almighty warrior in some stages!). Hanii on the Road consists of many levels and features a non-linear structure with interconnected paths to follow, as well as bosses. The game also offers a two simultaneous player mode where Lemon, a yellow version of Hanii, comes to the rescue.", "id": 42068, "name": "Hanii on the Road"}, {"genres": [5], "summary": "Blazing Lazers is a top-down shooter featuring 9 levels of varied and fast-paced action. The story here is the usual save-the-world variety. You must pilot your ship against 8 super-weapons and ultimately destroy the menace once and for all. \n \nThe power-up system in Blazing Lazers deserves special mention. There are four main types of weapons, and each type of weapon can be upgraded several times to produce an incredible amount of firepower. In addition, there are secondary weapons systems that provide you with shields, homing missiles, multi-fire units, or super weapon power.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/umvurzkrtqrllzjy3mpi.jpg", "width": 1524, "cloudinary_id": "umvurzkrtqrllzjy3mpi", "height": 2156}, "id": 42125, "name": "Blazing Lazers"}, {"genres": [5], "summary": "Cyber-core is a vertically scrolling shooter in which the player fights insects. The basic idea is traditional: shooting everything before they can shoot/touch the player: after three hits the chitin armor breaks and a life is lost. Besides flying enemies which are disposed of with the standard gun, the player also has to deal with enemies on the ground which need to be hit with one of the unlimited bomb. \n \nThe player has the choice between four insect forms which are changed by collecting the associated extra symbols. Collecting more of the same symbol upgrades the insect, but this also rises the difficulty level. Other extras include smart bombs, extra lives, armor refreshments or a protection shield. The game features the possibility to turn on rapid fire or to slow down the speed as well as big boss enemies at the end and within the levels.", "id": 42112, "name": "Cyber-Core"}, {"genres": [12], "summary": "Summoned by the King, you are the last hope of a once peaceful land. Journey deep within the earth on your quest to destroy a strange, unnatural force. With new \"split screen\" action you and a partner can work together to uncover the mysteries of the eerie underground labyrinth and its evil inhabitants. Face the Death Crow, Pumpkin Head, and Savage Elf in over 22 levels of chilling adventure. You won't want to travel alone - and you don't have to!", "id": 42110, "name": "Double Dungeons"}, {"genres": [14], "summary": "Select your boxer, select your manager and duke it out for the championship. Bullfight takes the conventional side view of many boxing games - you shuffle left and right tapping one button for block and another for punch, the height of which is determined by the D-pad. During the action, commentators chatter away at the bottom of the screen until one of you goes down for good. This is fairly standard stuff, although Bullfight also has an extra fighting mode to add variety. In it, you take to the streets in a Vigilante-style scrolling beat 'em up, stopping at shops to buy equipment on the way to the main fights in a proper arena.", "id": 42084, "name": "Bull Fight: Ring no Haja"}, {"summary": "In 2050, after a great earthquake, the Moon got an atmosphere and conditions for normal human life. 50 years later, the Moon is inhabited by humans and a great tourist attraction. A boy called Daichi arrives on the Moon and hears the strange stories about people with rabbit ears. Soon he meets V-Mei, an old witch and her granddaughter Guri Guri, the members of the Long-Ears race which is in war with the evil Jadou Clan who wants to conquer the world. Sensing a power in the boy, V-Mei gives the magic gun to Daichi and reveals to him that he is the chosen Madou Warrior who will save the Long-Ears race and their land Rabiluna from the evil Jadou Clan. With the magic gun, Daichi can summon Granzort – the Madou King of Earth – a giant robot to fight against the monsters of the Jadou Clan. \n \nSoon, Daichi, V-Mei and Guri Guri meet two other boys – Gus and Rabi. Gus receives a magic bow that summons Winzart – the Madou King of Wind, while Rabi receives a magic top that summons Aquabeat – the Madou King of Water. Together, Daichi, Gus, Rabi, V-Mei and Guri Guri travel to the world of Rabiluna in order to free it from the Jadou Clan.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lvbkrmyf3vhcfzumsf2d.jpg", "width": 1677, "cloudinary_id": "lvbkrmyf3vhcfzumsf2d", "height": 1481}, "id": 42065, "name": "Madou Ou Granzort"}, {"summary": "Tasuke is no longer a student and works as a cook in a local restaurant. Kyapiko remains a student. Since the fall of the Dark Skull, Doc has constantly suspected that another invasion was coming sending Tasuke and Kyapiko on searches for the new invaders although never finding anything. However, one day, after Doc is kidnapped, Tasuke and Kyapiko find out that an alien empire led by Ryo is planning to take over the world. Also, two other villains have appeared with similar powers to Tasuke and Kyapiko. They are dark Shubibinman named Jeeta and Myu. Tasuke and Kyapiko must now rescue Doc, stop Ryo from taking over the world, and avoid being killed by Jeeta and Myu.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ummsezuna47fl029kpyk.jpg", "width": 1162, "cloudinary_id": "ummsezuna47fl029kpyk", "height": 1132}, "id": 42075, "name": "Kaizou Choujin Shubibinman 2: Aratanaru Teki"}, {"genres": [4, 14], "summary": "The third in the original Fire Pro series. To date the largest roster of wrestlers, with several hidden to be found, new modes, editing and a League Mode to be conquered.", "id": 42071, "name": "Fire Pro Wrestling 3: Legend Bout"}, {"genres": [5], "summary": "Daisenpuu Custom can be described as a remixed version of the HuCard game released in 1989. The game is based on the arcade shooter of the same name released by Taito/Toaplan in 1987 (also known as Twin Hawk). The players takes control of a World War II plane and fights his way through a vast array of enemy air defenses such as tanks, submarines and battle ships (curiously, there aren't any enemy planes in the game). Our fighter plane can use a classic Vulcan gun and a special, but limited, bomb attack. The latter calls a formation of friendly planes that will shoot at will until they eventually get hit. Pressing the bomb button twice triggers a powerful smart-bomb and wipes out most of the enemies on screen. A standard power-up system upgrades the plane throughout the game - destroying tiny truck usually frees up power-icons. Some, stamped with a large character P on them, upgrade the plane's main gun up to four times. Others give away extra bombs or rare extra lives.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z5guiiuke9jsktlcwipc.jpg", "width": 1414, "cloudinary_id": "z5guiiuke9jsktlcwipc", "height": 1402}, "id": 42061, "name": "Daisenpū Custom"}, {"genres": [9], "summary": "A puzzle game where you have to drop playing cards so they make poker-valid lines horizontally, vertically and diagonally.", "id": 43197, "name": "Ryuukyuu"}, {"id": 42056, "name": "Bomberman '93 Special"}, {"genres": [9], "summary": "AKA: 戦国麻雀. A sengoku era theme Mahjong game as player conquered other shogun opponents by Mahjong.", "id": 43202, "name": "Sengoku Mahjong"}, {"genres": [5], "summary": "Konami's imaginative parody on the Gradius series. It plays just like Gradius, with the same power-up system, but features a far more bizarre and imaginative series of levels and characters. \nThis game was released in Japan for the PC Engine and is a port of the Arcade original with a couple of differences: it doesn't have the arcade Stages 5 and 8, but features a stage titled SPECIAL and a new introduction that features several strange-looking Japanese characters. This is in contrast to the arcade intro, which chronicles the Gradius legacy up until the time of release.", "id": 42095, "name": "Parodius Da! - Shinwa Kara Owarai He"}, {"genres": [4, 14], "summary": "A strategic wrestling games which allows the player to set up their own moveset to diversify and strategically approach each match.", "id": 42070, "name": "Maniac Pro Wrestling"}, {"genres": [12], "summary": "An unlicensed eroge dungeon-crawler RPG developed by Games Express for the PC Engine in 1992. \n \nLady Sword is an RPG of the Wizardry/Eye of the Beholder/Etrian Odyssey mold. An unnamed swordsman delves deep into a cursed labyrinth in order to rescue a group of abducted women from their monstrous captors. Throughout the early stages, the player character randomly bumps into other NPCs who dole out advice and tips. Upon successfully clearing each floor, the player is presented with a nude image of the rescued women; this is the extent of the eroge element. \n \nThe game was developed by Games Express, a sobriquet for Hacker International: a company which primarily developed and published unlicensed games for the PCE and Famicom.", "id": 42050, "name": "Lady Sword: Ryakudatsusareta 10-nin no Otome"}, {"genres": [5], "summary": "Galaga is a smouldering planet that often erupts with angry mutants and misfits. As Galactic commander of the Federal Army, you have the job of making them dead. Not easy! Because they come at you in clusters like swarms of killer bees. This time, you will be flying the awesome Triple Proton Fighter that warps to new dimensions and increased firepower. Galaga goons, your graveyard awaits.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zaqhky1ahzzqvfh4sdd5.jpg", "width": 1524, "cloudinary_id": "zaqhky1ahzzqvfh4sdd5", "height": 2156}, "id": 42123, "name": "Galaga '90"}, {"genres": [5], "summary": "Aldynes: The Mission Code for Rage Crisis, is a horizontal scrolling shoot 'em up game developed by Produce and released in July 22, 1991 for the SuperGrafx only for Japan. The game has a unique option-based combat and features levels with large scaling effects or parallax scrolling effects. \n \nNearing the year 2020, the societies of mankind fall into global depression just as an alien invasion suddenly comes down on Earth; coming from a large mechanical planetoid, the aliens attack the Earth without reason or communication. With all defenses annihilated, the United Nations corresponds with NASA to make a powerful space fighter known as The Ortega under project name Aldynes. During that time, a particular space fighter pilot - known only by his call sign Fox-A - was killed in action; his bereaved girlfriend Hiroko soon discovered Project Aldynes and its near complete fighter. As the invaders attack the air force housing Project Aldynes, she hijacks one of the ships and throws herself into battle in hopes of getting her revenge.", "id": 42078, "name": "Aldynes: The Mission Code for Rage Crisis"}, {"genres": [5], "summary": "An unusual shooting game where your character is a haniwa doll. The most unique feature is your ability to attack in a 360-degree radius. Defeat enemies to earn spirit energy you can trade for power-ups.", "id": 42067, "name": "Hanii in the Sky"}, {"genres": [12], "summary": "A turn-based RPG featuring the famous Peach Boy of Japanese folklore, and the enhanced remake of the first Momotarou Densetsu game. It was released shortly before the game's official sequel, also for PC Engine. \n \nMomotarou Densetsu Turbo (\"Peach Boy Legend Turbo\") is the second game in the Momotarou Densetsu franchise, though is effectively a revamp of the first game released for the Famicom. The game displays Momotarou's origins as a baby born of a giant peach that a kindly couple found floating down a river, and covers how he met his animal companions and fought the Oni on their island. \n \nThe game sets up the sequel, Momotarou Densetsu II, which was released exclusively for the PC Engine a few months later.", "id": 42049, "name": "Momotarou Densetsu Turbo"}, {"genres": [8], "summary": "Jajamaru, Pikkoro and Porori one day arrive on an island where they find a cute little pink dragon. The poor thing is starving and they all decide to help him and escort the animal through several stages to collect his favorite food (displayed at the bottom of the screen).", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j3e1xfsmiq0lhehuwjsx.jpg", "width": 1280, "cloudinary_id": "j3e1xfsmiq0lhehuwjsx", "height": 1280}, "id": 42057, "name": "Niko Niko Pun"}, {"genres": [14], "summary": "Power Eleven (パワーイレブン?) is a 1991 Japan-exclusive football video game with top-down perspective, published by Hudson Soft for the PC Engine. It was part of the Power Sports Series, a series of sports games released between 1988 and 1998.", "id": 42043, "name": "Power Eleven"}, {"genres": [9], "summary": "Chew-Man-Fu has gone too far! His evil curse deprives you, (and everyone else), of your beloved egg rolls and fried rice. To break his spell, roll 4 magic balls through a maze to matching colored squares. Sound easy? Hah! Chew's whole zoo is out to stop you. Prickly porcupines, wily penguins, rowdy apes and more! Use those balls to clobber 'em and smash through the walls. With 5 worlds and 550 wild rounds, the fun never stops.", "id": 42114, "name": "Chew Man Fu"}, {"genres": [5], "summary": "Alpha 27, the one planet in the galaxy that is fit for human habitation. For many years, the space observation system here was used for a wide range of research. One day, horrifying news arrived- a giant comet was hurtling toward the solar system, on its present course, it was going to colide with the moon. and then….Nothing! For some strange reason the humans and the moon seemed completely unaffected. The humans were unaware that a new nightmare had already begun. The giant comet had changed shape- it was not a comet at all, it was an alien mothership!", "id": 42111, "name": "Dead Moon"}, {"genres": [15], "summary": "AKA: 関ヶ原. A turn-based strategy game based on the famous battle of Sekigahara. This battle decided the major Shogun and concluded the sengoku era.", "id": 43203, "name": "Sekigahara"}, {"genres": [5], "summary": "The Engine is hardly lacking in shooters, so to be successful, you have to stand out from the crowd. Barunba tries to add a hint of originality in its own subtle way. You control what is basically a floating globe (complete with little man inside) that has a weapons ring around it - this ring can be rotated right around the ship giving a fully controllable direction of fire, something obviously useful for those pesky critters approaching from behind. From the start, you are equipped with several different types of weapon, each of which can be temporarily boosted by collecting items that are dropped by exploding enemies. The levels are auto-scroll, moving around in all directions and contain mid-level as well as end-of-level bosses. Your ship has an energy bar, located at the bottom left of the screen, and once it is depleted it's 'Game Over'.", "id": 42087, "name": "Barunba"}, {"genres": [5], "summary": "More of an explorative shooter than the standard blasting affairs, Atomic Robo-Kid Special takes all the elements from the arcade version and jiggles around with them a bit for the PC Engine. The control method takes a little getting used to - pressing button I selects from one of four weapons collected along the way, whereas holding down button I will lock you to the direction you are facing, making backing-away and firing easier. It can be fiddly at first, but it's essential that you master it. \n \nThe four weapons available are variable in quality. The forward shot and diagonal shot are both only useful when you've lost the other weapons, as the missile and full-fire are the ones that you will utilise most often. The missile is particularly useful as in some levels you are required to blast away areas of wall to progress. Levels are varied - some are horizontal, some are more like mazes and there are also two types of boss area: one with a small enemy over the opposite side of the screen protected by a barrier you have to destroy, and another with a huge mechanical monster that follows you relentlessly around an arena.", "id": 42090, "name": "Atomic Robo-Kid Special"}, {"genres": [14], "summary": "OK. So croquet may not be a popular idea for a video game, but the Japanese being as Japanese as they are, they went and did it anyway. So what does Appare! Gate Ball have to offer? First up is the choice between action and simulation mode. The main difference that I can make out between the two is that in action mode you have to both aim the shot and set the power, in simulation only the shot aiming is required. Your game is played out in two teams, rather than two individuals, and the members of your team are chosen from a variety of weird and crazy looking characters with varying attributes. Shots are aimed in a simple overhead viewpoint, which then switches to a standard view for the execution of the shot itself. All this is accompanied by a jolly little tune that plays away in the background.", "id": 42092, "name": "Appare! Gateball"}, {"genres": [14], "summary": "Dodgeball game with loads of anime style sequences and even an RPG style story mode. Based on the manga of the same name.", "id": 42053, "name": "Hono No Tokuji Dodge Danpei"}, {"genres": [31], "summary": "Poor Hu-Man! he just isn't his old self. Trying to escape from the evil dragon Mecha, he's transformed into the horrific Lizard Man! Get ready to kick some serious dragon tail, because 5 more are waiting to stop you. Each is more vicious than the last. And each turns Hu-Man into a different kind of total gross out! Slash 'em, burn 'em, and blow 'em away! Then capture the Salamander Cross to break the DRAGON'S CURSE.", "id": 42109, "name": "Dragon's Curse"}, {"genres": [8], "summary": "A crazy, yet genius professor named \"Doc\" sends two of his brand new and most skilled cyborgs against an army of evil machines that have taken over the city. With the help of their special suits and powerful energy-swords, they fight waves of enemies of increasing strength, as well as bigger and badder bosses until they eventually reach the lair of their furious leader - the evil Dark Skull.", "id": 42052, "name": "Kaizou Choujin Shubibinman"}, {"genres": [10, 31], "summary": "A combat racing game featuring KITT and Michael Knight from the TV show Knight Rider. It was released exclusively in Japan for the PC Engine. \n \nKnight Rider Special is a driving game with vehicular combat that was released for the PC Engine in 1989. It is based on the 1980s TV show Knight Rider, about the secret agent Michael Knight and the Knight Industries Two Thousand (KITT) technologically-enhanced vehicle with its own sophisticated AI. The game employs the memorable music from the TV show and also features the Japanese voice actor for KITT, who lends his voice to a few soundbites. \n \nThe goal of the game is to race to the end of each stage, avoiding other vehicles on the road and employing KITT's turbo boosters to make time, and then taking out the criminal Michael was sent to chase down with KITT's weaponry.", "id": 42058, "name": "Knight Rider Special"}, {"genres": [14], "summary": "Final Match Tennis is by far the deepest tennis game in terms of gameplay on the PC Engine. In fact, its play controls are among the most sophisticated in a PC Engine game and in general, in a tennis game (what still counts to this very day). Don't get fooled by its simple graphics. There is everything in this game that tennis is about. Smashes, stop balls, volleys, back and forehand spins or lobs. At the top of it all, you can play it in every thinkable player combination (training, tournament, 1-4 players). By the way: in addition, its one of the best multiplayer games ever.", "id": 42060, "name": "Final Match Tennis"}, {"genres": [5], "summary": "Space based adventure with Galaxy Force II style into-the-screen action sequences.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ak2fgvjdlavijqzjwx9b.jpg", "width": 800, "cloudinary_id": "ak2fgvjdlavijqzjwx9b", "height": 600}], "id": 42045, "name": "Spiral Wave"}, {"genres": [14], "summary": "Baseball game.", "id": 43191, "name": "Power League IV"}, {"genres": [10], "summary": "Strap on this red turbo-charged beauty and punch it. Barrel through the streets of night-time Paris. Lean into the rolling countryside curves. Sweat the hot Sahara straightaway. The famous Paris to Dakar Road Rally tests driving skills, reaction time and your knowledge of the needs of your machine in various conditions. Great sights! Great sounds! If you've got the skills-hit the road, Jack. The best time wins!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fntw4a6zt1eit11e4mte.jpg", "width": 1524, "cloudinary_id": "fntw4a6zt1eit11e4mte", "height": 2156}, "id": 42118, "name": "Victory Run"}, {"genres": [14], "summary": "It's Ali, Foreman, Frazier, Holmes and Norton -- five of the world's greatest heavyweight boxing champs! Be them or battle them. Each has his actual physical traits and boxing style. Move and jab, or go toe-to-toe and unleash a flurry of punishing hooks, uppercuts and body shots. Protect yourself by blocking punches or clinching. Taunt opponents with showboat moves if you've got the guts. Fight exhibition matches or an entire 15-year career. Between round close-ups show each boxer's facial damage. Beat these five legends and become a Champion Forever!", "id": 42115, "name": "Champions Forever Boxing"}, {"summary": "Tension, strategy, action, excitement - Bomberman's back! \n \nYou can now battle against up to four computer-controlled maniacs by yourself for the ultimate five bomberman mode. \nChoose from seven exciting new stages with loads of new power-up items like werps, conveyer belts, revolving doors and even kicking bombs! \nOr for portable thrills, go head-to-head against a friend using TurboExpress for non-stop action. \nThe best competitive game is back, and it's more intense than ever!", "id": 42097, "name": "Bomberman '93"}, {"summary": "You are Gogan, a muscular powerhouse with enough guts to enter the Pits of Madness. Your mission: rescue the beautiful red-haired Flare. You are strong, but you also have Sting, a sacred axe to help you battle strange creatures and the savage cult of Jagu, fighting through mountain, jungle and cave environments to reach the lovely maiden.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/etqy0eiqxwfe89fakqbp.jpg", "width": 1524, "cloudinary_id": "etqy0eiqxwfe89fakqbp", "height": 2156}, "id": 42121, "name": "The Legendary Axe"}, {"genres": [8], "summary": "Despite being Hudson’s Vol.2, this was in fact released almost a month before The Kung Fu. It’s a conversion of what most people know as Wonder Boy in Monster Land, and it’s as perfect a conversion as you’re likely to get. This game takes a different pace from the first Wonder Boy game, being more of an adventure with a slower pace and more strategy. You start the game with barely a thread on and are given a sword by some wise looking dude who lives in a tree - so far so good. It is then your task to travel through the various platform-based levels defeating monsters and evil bosses along the way. Each enemy you kill leaves behind a coin or money bag (these are also at various hidden locations if you jump at the right spot) and shops will offer you armour, shields, weaponry and go-faster shoes. You can also pop into a bar and top up your energy if you can afford it. Levels are time limited (shown by an egg-timer on the left) so you need to be quick, or energy is taken away from your heart meter.", "id": 42085, "name": "Bikkuri Man World"}, {"genres": [10], "summary": "Based on a manga, Bari Bari Densetsu is something of a rare breed on the Engine - a motorcycle racing game. You can pretty much guess how it works - there's a World GP mode where you have to compete in a variety of races in order and a Travel mode that let's you pick a track of your choice. Also to consider is the gubbins that make up your bike, such as tyres, engine, brakes etc as these have an effect depending on the type of course and the weather conditions. Races are started with a qualifying lap that lets you get the feel of the track, followed by the race proper. You are then placed and can hopefully move on to the next country.", "id": 42088, "name": "Bari Bari Densetsu"}, {"summary": "The village of Nitta has been invaded by the army of Dr. Bomb, an evil scientist who is plotting to take over the world. Facing this crisis is Bravoman, who received his powers from Alpha Man to stand up against Dr. Bomb in the name of justice. The village of Nitta consists of 22 stages -- action stages that take place on the ground and shooting stages that take place underwater. Action stages use a unique control system in which the height of a jump and the distance of an attack changes depending on how long players hold down the button. Players collect the Luck Symbols that appear when they defeat enemies and give them to Lottery Man to get recovery and power-up items. Stop Dr. Bomb and bring peace to the village of Nitta and the rest of the world.", "id": 42116, "name": "Bravoman"}, {"genres": [10], "summary": "Moto Roader is a futuristic racing game that allows up to five players to compete against each other. Players use the cash earned when they win a race to power up their machine. Not only can they change the \"tire\" and \"body\" of their vehicles, but they also can add \"special\" parts. Jump over tall obstacles with a \"hopper\" and blast past rivals at incredible speeds with \"nitro.\" What multiplayer game would be complete without attack items? Use a forward-launching \"grenade\" or a backward-dropping \"bomber\" to blow up and knock away rivals. Outmaneuver rivals in all eight heats to become the champion.", "id": 42104, "name": "Moto Roader"}, {"genres": [12], "summary": "The Vampire has escaped and has arisen again just as the Ancient Ones predicted. The Vampire controls bands of monsters who do his destructive bidding. Using the evil Iron Ring, he bends the will of the common people in an attempt to take over the world. Even the great Radlebb Keep has been conquered by the Dark Once and been bent to his evil will. \nNow, with your character in the Order of the Griffon, we have a chance to defeat the evil Vampire! World peace can be restored!", "id": 42102, "name": "Dungeons & Dragons: Order of the Griffon"}, {"genres": [31], "summary": "Bubblegum Crash is a PC Engine graphic adventure game based on the anime OVA series of the same name. \n \nThe anime/game is set in the near future of 2032, which has seen Tokyo split into two by a massive earthquake. Corporations rule the country, production-line humanoid robots named \"boomers\" are being used by villains to commit crimes, and the beleaguered police are too under-budgeted and incompetent to handle it all. The all-female mercenary team the Knight Sabers, who use powerful exosuits called \"Hard Suits\", are the city's best defense. \n \nThe game operates similarly to other adventure games of the era. The player is given a selection of commands that they can use to interact with the world, including talking to NPCs, picking up and using objects in their inventory and moving to other areas. At any time the player can look and listen for extra context clues. The commands are in English, but the game's story and dialogue text is entirely Japanese. The game will occasionally switch protagonists, starting with Nene Romanova and moving to Priss, Linna and Sylia at various points.", "id": 43201, "name": "Bubblegum Crash"}, {"genres": [9], "summary": "Once an ancient arcade game, and with a previous version on the PC Engine by Pack In Video, Hudson Soft have taken the addictive gameplay of Lode Runner and given the graphics a complete face lift. The puzzle-based action in Lode Runner is simple: You are presented with a side-view platforms-and-ladders based level and you have to collect all the gold and escape without getting caught by the baddies. To defend yourself, you can dig holes in the ground, either to the left or to the right, and enemies stumbling upon them will fall down and be trapped. If you time it right, the hole will re-fill before the enemy can climb out, forcing them to respawn elsewhere in the level. If you prefer evasive action, make sure the coast is clear so you can escape up a ladder or across a well-placed rope, but be warned - they will follow! Once you have collected all the gold, hotfoot it to the nearest long ladder and escape out the top of the screen. In magazine previews, this was originally titled Lode Runner II.", "id": 42086, "name": "Battle Lode Runner"}, {"genres": [8], "summary": "Agedama Genji is a 4th grader boy in elementary school, and a hero on the training from 'Hero Planet.' Though the cheerful kid is no one special in appearance, he can transforms into a superhero called \"Agedaman\" by combining himself with his computer friend called Wapuro. He believes in Kiai power and he tries to handle all the problems that he encounters with that, so his father decided to let him go training on the earth accompanied by only Wapuro on summer vacation. After his arrival to Morisoba city, where an enormously wealthy clan rules arbitrarily, he joined East-Morisoba elementary school, then met a diva girl of the clan named Rei Kuki who has an ambition to conquer the world and, as a first step, attacks the city with a variety of chimera monsters that she and her grandfather create with the Monster-Cooker, which the rich old man invented. When they plot to attack the city she transforms into a super-villainess called \"Onyomiko\". The battles of Agedaman and Onyomiko began!", "id": 42073, "name": "Genji Tsuushin Agedama"}, {"genres": [10], "summary": "Final Lap Twin is a hybrid racing/role-playing game released for the PC Engine in 1989 and the TurboGrafx-16 in 1990, as a spin-off to the 1987 arcade game Final Lap. The protagonist is on a quest to live up to the reputation of his racing-champion dad. He travels over the map, meeting small-time racers, and must race his car to earn money that he spends on upgrading his car, eventually facing the local racing champion. After beating the rest of the local racing champions in the various cities, the protagonist must go through a maze to find the final upgrades of the different parts of his car, and then face the world racing champion.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x7oapl4yx2p1wgvrdans.jpg", "width": 1524, "cloudinary_id": "x7oapl4yx2p1wgvrdans", "height": 2156}, "id": 42124, "name": "Final Lap Twin"}, {"summary": "The evil Kublai from Zenzombie Land, has kidnapped four of your friends as you time-travelled on a magic carpet. Now you must rescue them. But run for your life! You're in a maze of monsters! \n \nHit them with your YOYO! Dig a hole so they'll fall in! Shoot them with your Freeze Beam! Kill them dead with your Bubble Gun! There are 60 incredible levels of action. So wear your helmet and watch your step!", "id": 42113, "name": "Cratermaze"}, {"genres": [5], "summary": "Snake and Eagle, two commandos of the Bloody Wolf special forces, receive instructions from their commander to destroy the enemy's heavily armed base to rescue the President and any allies who have been reported as MIA. \n \nBased off the 1988 arcade game, this single-player, top-down, run and gun shooter takes a nod to Contra-style gameplay, allowing one of the two mercenaries to blast their way through eight levels of enemy opposition armed with only a knife and a machine gun. \n \nAlong the way, new weapons such as shotguns, bazookas, flash bombs and grenades grenades can be added to the arsenal, as well as health and defensive power-ups. Players can even find a motorcycle to ride in some areas, or swim through certain parts of a level. \n \nThe President and your fellow soldiers need you!", "id": 42117, "name": "Bloody Wolf"}, {"genres": [15], "summary": "The chips are down as you and your buddies travel to Vegas in this high stakes adventure. Match wits (and luck!) against the house or up to four of your friends in a game with all the glitz and glamor of a real casino. Play Poker, Blackjack, slot machines, Keno or Roulette. Choose one of 15 different casinos. You're the odds-on favorite in this high-rolling gambling simulation.", "id": 42105, "name": "King Of Casino"}, {"summary": "It's been two years since Arnold and Sonya were made into Shockmen. A message from the professor to return to their bodies has them head to his laboratory, but they are ambushed by a mysterious enemy along the way. After narrowly defeating the enemy, they catch a TV news flash announcing the Ryo Empire invasion. They find that the professor has been abducted and set out to rescue him. \n \nShockman is a side-view action shooter that has eight stages, including Action Stages, where you jump and use special techniques, and side-scrolling Shooting Stages. This game expands on the well-paced story from the previous version and contains cooperative elements like shared life and a powerful Team Shockbeam that can be used during two-player simultaneous play.", "id": 42098, "name": "Shockman"}, {"summary": "This is a side-scrolling shooter played in a world created from the mind of a twisted demon. Your soul has suddenly wandered into that evil world that exists in every person's heart. The only way out is to blast your way past the grotesque creatures that block your path in five \"causes\" (stages). You must face the dangers of this psychedelic world by making full use of three shot types and the satellite option. With power-ups, you can change your shots to a wide-coverage beam, a satellite-generated laser and more. Each shot type can be powered up to three levels. You can also block enemy fire by rotating the satellites to a desired position. How you use these features will be the key to successfully escaping this strange and surreal world", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/li9psbgv4h9ivmamzcsb.jpg", "width": 1530, "cloudinary_id": "li9psbgv4h9ivmamzcsb", "height": 2156}, "id": 42099, "name": "Psychosis"}, {"genres": [8], "summary": "Based on a TV anime series (from the grandfather of manga Osamu Tezuka), Blue Blink is a cute platformer that manages to find its place among the crowd. The game is divided up into different areas, each represented by a map screen. Within these areas, you can choose your route to the end (by exiting levels at certain points). Throughout each area you have to find a 'master key' allowing you access to the boss - this can be hard to locate at times and requires lots of shooting at blank areas of screen just in case. \n \nControl of your character is original - on each stage you have three characters which you can choose between, with the CPU controlled ones following behind you like some bizarre congo line. The characters are preset and vary from stage to stage, and each one has different attributes. For example, some have very high jumping ability, whereas others are poor at jumping but have spread-shot weapons. Once you have found the master key and reached the final level in the area, you are entered into a boss battle, where you sit astride the titular donkey and attempt to fight your way to the next area.", "id": 42093, "name": "Aoi Blink"}, {"genres": [31], "summary": "Valkyrie no Densetsu (translated as: \"Legend of Valkyrie\") is a platform/shooter arcade game that was released by Namco in 1989 only in Japan. It is a sequel to a 1986 Family Computer title titled Valkyrie no Bōken: Toki no Kagi Densetsu, also released exclusively in Japan. \n \nThe first player controls the eponymous Valkyrie who is not an actual Valkyrie from Norse mythology, but a warrior maiden from the heavens who happens to be named after them, while the second player controls Kurino Sandra, a green lizard who, despite his name, is actually male. \n \nThey must fight their way through eight multi-scrolling stages by firing shots from their sword (Valkyrie) and trident (Sandra) - and most of the enemies will leave gold coins or magic bubbles behind when killed, which can be exchanged for special items with Babasama and Zoul. \n \nTo answer the Nazonazo Phantom and Sphinmoth's questions on the fourth and seventh stages, a knowledge of the two Japanese syllabic writing systems (Hiragana and Katakana) is also essential; if a player does not know, they can only guess. \n \nAlso, if a player wants Babasama to teach them the \"Chameleon\" spell on the fifth stage, they shall have to walk up to a woman in one of the previous stage's interior areas, and speak to her so that she will give them a letter - without it, they cannot give it to Babasama, and he will not teach them the spell as a result. The clock tower at the end of the first stage also looks like a miniature Big Ben.", "id": 42080, "name": "Valkyrie no Densetsu"}, {"summary": "You're an elite chopper jockey, ready to launch your Cobra against the coastal defenses of an evil superpower. They've got the numbers. You've got the might and the fight! You're Twin Cobra, the most awesome attack weapon in the skies! \nBank in low over the desert and start pounding. The enemy's all over you! Knock out swarms of attack copters while you avoid smoking sheets of ground fire! Blast battalions of tanks into smoking craters. \nThen it's open ocean warfare! Machinegun a fiery trail through wave after wave of heavily armed gunboats. Bomb huge battleships and destroyers. Strafe gigantic armored carriers as they pour on the firepower. \nThe longer you live, the tougher you get. Your weapons fire faster and harder. But the hostiles keep coming! See how much you can make the ground grunts scream! It's your war now. \n \nKyuukyoku Tiger is a vertical scrolling shoot-em-up and is the sequel to Tiger-Heli which continues the tradition to include the word Tiger in the title of each game in the series. Subsequent Japan-only sequels would use the same title, which roughly translates as \"Ultimate Tiger\". \n \nThe helicopter comes equipped with a default forward-firing weapon that is able to hit both air and ground targets, as well as a finite supply of bombs which hit enemies in a wide radius for massive amounts of damage. The player can find power-ups by shooting down the relatively sturdy Chinook enemy choppers, which initially allow the player to upgrade their standard gun to include more shots, but will eventually allow them to pick up weapons that can fire in different patterns. These include a four-way shot that fires in the four cardinal directions and a spread shot that fires forwards and outwards in a cone. The player can also find additional bombs by destroying this type of enemy. \n \nAt the end of each stage, and occasionally partway through, is a boss. These take considerably more damage than regular enemies and can fire a lot more projectiles as well.", "id": 42082, "name": "Kyuukyoku Tiger"}, {"genres": [14], "summary": "If you've ever heard the joke, \"The other night I went to a fight, and a hockey game broke out,\" then you already know what Hit the Ice is all about. This is rough and tumble, no holds barred hockey action that will challenge your stick-handling skills as well as your head-bashing abilities. While the traditional rules of hockey apply, that doesn't mean you can't throw an elbow or a high stick when the ref isn't looking. And since this is two-on-two hockey, the action is fast and furious as you try to outscore and outslug your opponent in four-player hockey action.", "id": 42107, "name": "Hit the Ice: The Official Video Hockey League"}, {"genres": [14], "summary": "Swing away on 18 lush holes, enter tournaments and compete to win. Keep your head down and concentrate. Release a ton of power coming out of your backswing -- like a coiled spring! Follow through. You'll need a picture-perfect swing, flawless timing and a pro's club selection. Why, you ask? Because this is real. The traps are real, the water is real, the ball is real, and your score is real.", "id": 42100, "name": "Power Golf"}, {"genres": [5], "id": 42064, "name": "Paranoia"}, {"genres": [4, 15], "summary": "Monster Pro Wrestling is a Japanese game in which you choose a monster and battle other monsters in turn-based battles. It is notable for its humorously nonsensical battle animations, such as the appearance of a dozen heads on screen and death blows literally tearing monsters apart.", "id": 42069, "name": "Monster Pro Wrestling"}, {"genres": [14], "summary": "A Japan-only soccer game developed by Human for the 1990 World Cup in Italy. It was the first in the Formation Soccer series. \n \nFormation Soccer: Human Cup '90 is a soccer game for the PC Engine that was released in Japan exclusively. It is the first of the Formation Soccer games from Human Entertainment: many of which would end up on the Super Famicom/Nintendo as \"Super Formation Soccer\", in a similar pattern as Human's Fire Pro Wrestling series which also became Super Fire Pro Wrestling once they started coming out on the Super Famicom. Formation Soccer uses a vertical-scrolling view of the pitch. \n \nThe game was designed and released to coincide with the 1990 World Cup event set in Italy. It features sixteen teams, though only eleven of those actually qualified for the World Cup. The player can choose between a single game Exhibition mode and a tournament \"Human Cup\" mode to choose between. \n \nTeams \nThe following sixteen teams could be selected for use in either mode: \n \nItaly (the hosts) \nBrazil \nThe Netherlands \nU.S.S.R. \nArgentina \nWest Germany \nDenmark (Denmark did not actually qualify for the 1990 World Cup) \nEngland \nSpain \nFrance (France did not actually qualify for the 1990 World Cup) \nUruguay \nPoland (Poland did not actually qualify for the 1990 World Cup) \nYugoslavia \nUSA \nMexico (Mexico was disqualified during the qualification process) \nJapan (Japan did not actually qualify for the 1990 World Cup)", "id": 42046, "name": "Formation Soccer: Human Cup '90"}, {"genres": [4], "summary": "The object of the game is to walk through each stage while throwing punches and kicks at enemies and objects, which also can be done in midair. There are four stages which are broken down into three stages each, for a total of twelve stages. When Wang gets knocked out, the game starts over at the beginning of the stage in which he got knocked out. Players can memorize the object/enemy pattern in order to get through the stage more easily whenever Wang gets knocked out. At the end of each level, there is a boss fight. \n \nThe control was designed to be similar to the arcade game Kung-Fu Master, but with gameplay similar to Gladiator without the sword or shield held in hand. The graphics utilized very large character models that fill up the screen. They were capable of moving without any graphical flickering.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kzz0ndaf9nnge1rurchc.jpg", "width": 1402, "cloudinary_id": "kzz0ndaf9nnge1rurchc", "height": 1406}, "id": 42044, "name": "THE KUNG FU"}, {"genres": [8], "summary": "You can be J.J. Or you can be Jeff. Either way, you're a wacko detective on a kidnap case who stumbles into some hilarious action. Clues and surprises pop up everywhere. Use your head, your foot (kicking things brings great results) and your secret weapon - the spray-can - on 30 different enemies. So grab some french fries for energy and get ready for action! \n \nJ.J. & Jeff Detective Agency are assigned the task of locating a missing rich man, and you can choose either J.J. or Jeff to go on the mission. Your partner doesn't like this one bit, so he decides to make a nuisance of himself along the way. Similar to Adventure Island, you must make your way through several levels, destroying wildlife along the way, but instead of using a hammer, you have three different ways to kill them: jump on or kick them, or when they are walking on the ground, blow gas out of them.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qsh37m7mhqg9fnv3r0qm.jpg", "width": 900, "cloudinary_id": "qsh37m7mhqg9fnv3r0qm", "height": 1080}, "id": 42106, "name": "J.J. & Jeff"}, {"genres": [4], "summary": "Forget the movies. Forget the make-believe. This is the master, 3 time World Kick Boxing Champion André Panza, and the reality will stun you! His every move was filmed and digitized over 2 years for a devastating arsenal of kick boxing combat. Train until you're good enough. Then go to war against a friend or battle through the ranks of 8 international champions! Over 50 whirlwind punches and kicks let you customize your attack. Master new techniques during hundreds of ever-changing battles. Then put your body on the line against Panza himself for the ultimate Kick Boxing Championship!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xhepihwsnb92w6ewxoyh.jpg", "width": 1744, "cloudinary_id": "xhepihwsnb92w6ewxoyh", "height": 2046}, "id": 42128, "name": "Andre Panza Kick Boxing"}, {"genres": [8], "summary": "Now the Battle is in Your Hands. \n \nYou are Keith Courage. Struck by a giant meteor, the world has been invaded by strange creatures from another planet. Burrowing deep within the Earth's surface, the Planet of B.A.D. (Beastly Alien Dudes) seeks to take over the world. As a member of N.I.C.E. (Nations of International Citizens for Earth), your mission is to defeat B.A.D. and bring peace back to the world. \n \nArmed only with a sword, you must first defeat the outpost guards. Then, enter the Underworld. Here you activate the awesome Nova Suit. A secret force left to you by your fallen father, you are half man, half mechanical monster. Nearly invincible, your sword cracks with the power of lightning, as you wreak havoc on the fearsome Dudes. Your goal is to reach the Robo Zone (the seventh Alpha Zone), headquarters of B.A.D. Succeed here and you will have won the game, recapturing the Earth and restoring humanity's place in the universe. You have help along the way. Four friends offer you advice, swords, bombs, and extra lives. Collect the stolen riches left behind by the invaders and buy your way out of trouble with money.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iqaty4ocbwvnnuaunq1w.jpg", "width": 1524, "cloudinary_id": "iqaty4ocbwvnnuaunq1w", "height": 2156}, "id": 42122, "name": "Keith Courage in Alpha Zones"}, {"summary": "The Axe is back ... with twice the force and twice the fury of 1988's classic TurboGrafx-16 videogame. This time it's brother against brother, locked in deadly combat. Your older brother has summoned forces of unspeakable evil to take control of the kingdom. Treachery rules! Your only hope is the legendary royal sword. But will its power be enough to overcome the Cliffs of Chaos? The Skull Dungeon? And the treacherous Crypts of Slime? Only your courage, your fighting skill, and the Legendary Axe can answer that challenge!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rw49gqzrtynod6anfndd.jpg", "width": 1524, "cloudinary_id": "rw49gqzrtynod6anfndd", "height": 2156}, "id": 42120, "name": "Legendary Axe II"}, {"genres": [9], "summary": "There's no waking up from this nightmare! You'll need all your nerve and strategy to get out alive! A dream of giant apples and diamonds goes berserk when they turn into deadly demons raining down on your head! You have to shoot 'em down with a steel ball. Ricochet your shots to knock 'em off in bunches! They're coming fast, and each level is more threatening than the last! Why are those skulls laughing? Shoot first and ask questions later!", "id": 42108, "name": "Drop Off"}, {"genres": [12, 31], "summary": "A menu-driven adventure game featuring the eponymous ronin-for-hire taking on his most perilous mission yet. \n \nChikudenya Toubei (alternately Toubee, Tobe) is an adventure game originally released on the MSX2 in 1989 and ported to the PC Engine the following year. The player uses a menu of commands to move, pick up items, talk to NPCs and other necessary steps. \n \nReferred to as a \"digital comic\", the game has a number of cutscenes that play out during the more dramatic parts of the game. The game also includes puzzles, including a sequence where the player recreates the face of a victim from memory using a number of facial features like scars and eyebrows.", "id": 42039, "name": "Chikudenya Toubee"}, {"genres": [12], "summary": "Shiryou Sensen: War of the Dead is a post apocalyptic and dark Role Playing/Action game by Victor Musical Industries. \n \nDue to a series of mysterious events, the town of Chany's Hill has been cut off from the rest of the world. People have suddenly gone missing and cannibalistic monsters now roam the land, killing all who cross their path. The protagonist of the game is Laila Arufon, the youngest female member of the S-SWAT (Supernatural and Special Weapon Attack Team). She was born in the small town and has developped strange psychic abilities. Her Psychic Seal (\"PS\") and Mind Force (\"MF\") powers allow her to increase any weapon destruction power but also to increase her defense capability greatly. Her mission is twofold - she must investigate the mysterious and supernatural incident in Chaneys Hill and to rescue all the remaining survivors she can find and lead them to the town's church. \n \nLaila comes equipped with a combat knife and a Hand Gun (SIG/SAUER P226) - additional weapons appear later in the game including the Assault Rifle (STYER AUG), Grenade launcher (HK MZP1), Flamethrower (M2A1-7), Bazooka (M72A2) and so forth. Although most of the game uses a traditional top-down view, battles quickly drop the game into side-scrolling action phases. There, Laila fights hordes of monsters to gain experience (blue orbs), life (reb orbs), MF points (green orbs) or ammunitions (pink cases). She can also escape at anytime as long as she can reach the edge of the fighting area. The combat items are complemented by more conventional inventory items such as medic packs, psychic pills, keys and so forth. Player's progression is saved through a long password system.", "id": 42041, "name": "Shiryou Sensen"}, {"genres": [5], "summary": "Shoot em up game.", "id": 37658, "name": "Rock On"}, {"genres": [15], "summary": "AKA: NHK大河ドラマ 太平記. A samurai era turn-based strategy game based on the NHK TV drama Taiga Taiheiki.", "id": 37667, "name": "NHK Taiga Drama Taiheiki"}, {"genres": [12], "summary": "AKA: ネクロスの要塞. A Role-playing game with different characters with specialty.", "id": 37668, "name": "Necross No Yousai"}, {"summary": "Peculiar platform game that allows you to call companions that help you traverse the many levels.", "id": 42040, "name": "Obocchama Kun"}, {"genres": [9], "summary": "Japanese chess board game designed for serious players and not suited for beginner.", "id": 42031, "name": "Shougi Shoshisha Muyo"}, {"genres": [15], "summary": "AKA: 謎のマスカレード. An adventure game to solve riddles.", "id": 37669, "name": "Nazo No Masquerade"}, {"summary": "Sequel to the original　Genpei Toumaden.", "id": 42035, "name": "Genpei Touma Den - Kannoni"}, {"summary": "Although typical 'super heroes' are not nearly as common in Japan as they are in the west, there is no doubting the extraordinary powers of this one. Berabo Man is a strange game - a platformer with underwater shoot 'em up stages (sound familiar? Schbibin Man 2?), but the hero here doesn't just use a gun - instead, his whole body is elastic, so you'll find yourself taking out enemies with extending legs, arms and even neck! Along the way, you'll pick up items from destroyed enemies and some weird floating thing that I'll not even begin to describe. And with a boss at the end of each level, a hero's work is never done. \n \n-http://www.pcengine.co.uk/HTML_Games/Berabo_Man.htm", "id": 42038, "name": "Chozetsu Rinjin Berabo Man"}, {"genres": [14], "summary": "A baseball game for the PC Engine. Features twelve actual Japanese baseball teams. \n \nKore ga Pro Yakyuu '89 (\"This is Professional Baseball '89\") is a baseball game for the PC Engine and the first of two games with the Kore ga Pro Yakyuu brand, followed by Kore ga Pro Yakyuu '90. It features twelve teams from the Nippon Professional Baseball organization as it was in 1989. \n \nThe game resembles most baseball games of the era, with a behind-the-batter perspective when pitching and batting and a top-down view when fielding.", "id": 42037, "name": "Kore ga Pro Yakyuu '89"}, {"genres": [12], "summary": "It's far a future on planet. An role-playing game in a maze style. The main character is sitting in a robot's cabin to move into 4 directions.", "id": 37666, "name": "Out Live"}, {"genres": [9], "summary": "Japanese chess board game playing against different opponents.", "id": 42032, "name": "Shougi Shodan Icchokusen"}, {"genres": [15], "summary": "A mecha strategy game from Masaya. \n \nHisou Kihei X-Serd (\"Flying Mounted Cavalry X-Serd\") is a strategy game where the majority of the units are mecha, or robot suits. The game was exclusive to the PC Engine and was released soon after another mecha strategy game from Masaya: Gaiflame. \n \nIn each scenario, the Serds - a league of specialized attack mecha - are deployed from their HQ ship Altea. The Serds all have single-letter code-names and different specializations: for example, the G-Serd wields a laser sword for devastating melee attacks and can move quickly, while the B-Serd is capable of long-range mortar attacks but has limited movement. The eponymous X-Serd is the most powerful of the team.", "id": 42034, "name": "Hisou Kihei Kai Serd"}, {"summary": "Multi-style game in which you play a Japanese demon warrior with flowing red hair. It is divided into overhead areas, platform areas with small sprites and walk along hack ‘n’ slash bits with much larger characters.", "id": 42036, "name": "GenpeiI Toumaden"}, {"genres": [14], "summary": "The fifth sequel of the Power League series with 1992 roster including Hideo Nomo.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fyognaiwr6bxmkfqt92k.jpg", "width": 951, "cloudinary_id": "fyognaiwr6bxmkfqt92k", "height": 938}, "id": 37661, "name": "Power League V"}, {"summary": "The time is yesteryear, when knights scoured the countryside in search of the Holy Grail, defended the honor of fair maidens and fought a never-ending battle against rampant evil forces. Thrown into this mayhem, is the courageous Sir Arthur. A victorious knight with the awesome task of penetrating the Demon's Castle to pulverize the Prince of Darkness. Can he do it? It's up to you. You'll dangerously travel through the Place of Execution, the Village of Decay, the Town of Fire, and the Crystal Forest with an arsenal of weapons at your side. And when you're really down on your luck, magic fights might with powerful results. The only problem? You'll have to learn how to use it. And avoid it. Because their magic has the power to change you into a helpless duck among other things. But there's not much time. Lives depend on you. So brandish your sword and make mincemeat of your foes.", "id": 42028, "name": "Dai Makai-Mura"}, {"genres": [15], "summary": "AKA: Military Madness or ネクタリス. A turn-based military strategy game.", "id": 42030, "name": "Nectaris"}, {"genres": [10], "summary": "This is a one on one racing adventure game. Cover features the Nissan 300Z (Fairlady Z) and Toyota MR2.", "id": 37648, "name": "Zero 4 Champ"}, {"genres": [15], "summary": "A real-time strategy game in which a family of cow-people have to grow and sell crops on an island crawling with monsters. \n \nOverview: \nDaichikun Crisis: Do Natural is a 1989 PC Engine game that follows a family of cow anthropomorphs as they cultivate their home of Moo Cow Island. It uses a real-time strategy format where players explore the island and plant various crops. They must also fight off the occasional monster attack from the nearby volcanos, and clear the resulting toxic ash away. \n \nThe game is thought to be derived from an educational kid's TV show about agriculture shown in the Hokkaido region. Fans have observed the similarity of Daichikun's family and companions and those featured in the TV show, and the similar theme of farming in a harsh climate. \n \nGameplay: \nThe player controls the oldest son of the family, the titular Daichikun, and his family members Hokkaido (grandpa), Suzuran (mama), Oozora (little brother), Marimo (little sister) and their friends Goro the bear and Alice the crow are all AI controlled and will follow the player until they find themselves a task to complete. Daichikun can use the flying \"Geiger No\" vehicle to move around and clear ash away quickly, though it cannot attack. \n \nAdditional factors unlock as the player progresses with the game, like a port town and various power-ups. The game is on a fast seasonal cycle - a minute represents a month - and various crops do better (or worse) depending on the time of the year.", "id": 42029, "name": "Daichikun Crisis: Do Natural"}, {"genres": [5], "summary": "A fighter plane shoot 'em up first released to the Arcade by Taito. Players can call in their squadron for support. \n \nTwin Hawk, known in Japan as Daisenpuu (\"Great Whirlwind\"), is a vertically-scrolling shoot 'em up for the PC Engine. The player takes the role of the lead pilot of a squadron of planes and takes on an army of tanks and boats. They can command their squadron to form ranks, and use them to kamikaze targets on the ground or keep them around for the extra firepower. \n \nThe story of the game involves the fictional nation of Gorongo, which almost fell to a military coup after WWII ended. General Giovanni occupied an island south of the country as a base to start his occupation of Gorongo, and the player is called in to attack his base directly via an aerial attack as the General has no air units. \n \nThe game would be rereleased on the PC Engine CD as the slightly enhanced Daisenpuu Custom which added new stages, enemies and a CD soundtrack.", "id": 42027, "name": "Daisenpuu"}, {"genres": [5, 33], "summary": "Forerunner to Forgotten Worlds. The control method allows you use the fire buttons to shoot in opposite directions, defending yourself from attacks from the rear. The power ups are selectable and if you collect an alpha symbol you combine with another ship for a super robot. \n \n-http://www.pcengine.co.uk/HTML_Games/Side_Arms.htm", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vmyjncokbfnq0on39nlj.jpg", "width": 1000, "cloudinary_id": "vmyjncokbfnq0on39nlj", "height": 992}, "id": 42033, "name": "Side Arms Hyperdyne"}, {"genres": [5, 33], "name": "Darius", "videos": [{"video_id": "kfvqBjBd-zQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l53sbxjclss0un46xryo.jpg", "width": 1000, "cloudinary_id": "l53sbxjclss0un46xryo", "height": 1201}, "summary": "Darius is a two-dimensional horizontally scrolling shoot 'em up set in a fictional future. Uniquely among shoot 'em ups, the game's screen is three times wider than conventional size, and the arcade cabinet uses an arrangement of three screens to accommodate it. The player controls an ornate fighter spacecraft, named the Silver Hawk, and must navigate through scrolling terrain while battling a variety of fighter craft, ground vehicles, turrets, and other obstacles throughout the game's stages (referred to as zones in the game). The ship's arsenal consists of forward-firing missiles, aerial bombs and a protective force field, all of which can be upgraded by power-ups (in the form of large, colored orbs) that are dropped by specially-colored enemies throughout the game's zones. When the player reaches the end of a zone, a boss appears, which must be defeated to proceed. Once the boss of a zone is destroyed, the player is given a choice of which zone to play next via a branching path. While there are 28 zones in total, only seven can be played in a single run.", "id": 6789}]