[{"summary": "Fantastic Marchen: Cake-yasan Monogatari + Doubutsu Chara Navi Uranai Kosei Shinri Gaku is a Miscellaneous game, published by Culture Brain, which was released in Japan in 2002.", "id": 49577, "name": "Fantastic Marchen: Cake-yasan Monogatari + Doubutsu Chara Navi Uranai Kosei Shinri Gaku"}, {"summary": "Chobits: Atashi Dake no Hito is a GBA game featuring the characters from the anime / manga Chobits.", "id": 49560, "name": "Chobits for Gameboy Advance: Atashi Dake no Hito"}, {"genres": [14], "summary": "Captain Tsubasa: Eikou no Kiseki is a Sports game, developed and published by Konami, which was released in Japan in 2002.", "id": 49521, "name": "Captain Tsubasa: Eikou no Kiseki"}, {"summary": "Beast Shooter: Mezase Beast King is an Action game, developed by Hudson and published by Konami, which was released in Japan in 2002.", "id": 49535, "name": "Beast Shooter: Mezase Beast King"}, {"genres": [14], "summary": "Battle x Battle: Kyoudai Uo Densetsu is a Sports game, published by Starfish, which was released in Japan in 2003.", "id": 49486, "name": "Battle x Battle: Kyoudai Uo Densetsu"}, {"genres": [12], "summary": "Gachasute! Dino Device 2: Dragon is an Action game, published by Rocket Company, which was released in Japan in 2003.", "id": 49498, "name": "Gachasute! Dino Device 2 - Dragon"}, {"genres": [31], "summary": "Strawberry Shortcake: Summertime Adventure promises a wealth of adventurous fun as Strawberry Shortcake prepares her entries for the Strawberryland Bake-Off. Join Apple Dumplin', Orange Blossom, Angel Cake and Ginger Snap in two different modes of play - Berry Garden Mode and Strawberryland Adventure Mode, as they attempt to grow the best berry and use it to win the bake-off. With perplexing puzzles, peculiar power-ups and persnickety plant seeds, Strawberry Shortcake: Summertime Adventure offers players a \"berry\" good time. \n \nThe \"Special Edition\" version of the game released in North America features a bonus GBA Video episode of \"Meet Strawberry Shortcake\"", "id": 49501, "name": "Strawberry Shortcake: Summertime Adventure - Special Edition"}, {"genres": [8], "summary": "Player move Postman Pat through the village of Greendale delivering mail. On his route, Pat meets most known locales and characters from the TV series and faces plenty of obstacles and adventures making delivery more difficult and the gameplay more interesting and varied. Since the game is designed to be played by kids, all obstacles are of a non-aggressive nature, so rather than the van hitting objects on the road there can be mud puddles that slow down the van.", "id": 49477, "name": "Postman Pat and the Greendale Rocket"}, {"summary": "Gabriella must be dreaming... \nHelp the Wildcats find the missing instruments in time for the state competition! Play as Gabriella, Troy, Sharpay and Ryan, each with unique abilities. Explore East High while solving the mystery to find the lost instruments. Dance to your favorite songs from both movies.", "id": 49478, "name": "Disney High School Musical: Livin' the Dream"}, {"genres": [9], "summary": "bit Generations: Soundvoyager is a Game Boy Advance video game released in July of 2006. It was developed by skip Ltd. and published by Nintendo. The game was unfortunately never released outside of Japan. The game can be played entirely without looking at the screen, as the point is to listen to the sounds that are emitted from the Game Boy Advance's speaker. It should be noted, however, that it is quite a challenge to listen to the noises coming from the speaker, and that it's a lot easier to hook up ear phones or hook the GBA up to a stereo. It will also be very helpful to be in a quiet space.", "id": 49482, "name": "bit Generations: Soundvoyager"}, {"summary": "After a successful first foray into video games, Totally Spies! returns in the second installment for the fans of the series. Players again control the three secret agents from the TV show: Sam, Alex, and Clover. The characters are sent on top secret missions and match wits and muscle against international villains all over the world.", "id": 49454, "name": "Totally Spies! 2: Undercover"}, {"summary": "Welcome to the magical world of Winx Club where players can explore a wide range of new characters, interactive environments and fun mini games that incorporates the fashion, friendships, and magic of the Winx Club world. Players will be able to enjoy a simple, social and fun game experience that is designed specifically for girls 6-11. DS version includes exclusive mini games that utilize the Nintendo DS touch screen. Dance, fly and sing in fun mini-games for each member of the Winx Club. Earn new clothing, accessories and items to customize your character. Trade items with other players to complete the perfect look.", "id": 49457, "name": "WinX Club: Quest for the Codex"}, {"genres": [12, 15], "summary": "Black Matrix Zero combines standard tactical RPG gameplay with a pastiche of Judeo-Christian religious themes, particularly concerning the nature of good and evil and the interplay between Heaven, Hell, and Earth and the denizens thereof. The game is set in the same fictional world as the original Black/Matrix game, though hundreds of years prior. Three divisions of humankind share the same world - white-winged people who are called angels, black-winged people who are called devils, and wingless people. Those who have wings have great powers and pay little mind to the wingless ones. The angels rule the world via a religious organization called the Prodevon Church, which ensures both the cooperation and ignorance of the wingless people.", "id": 49419, "name": "Black Matrix Zero"}, {"genres": [14], "summary": "Get ready for some serious powder action! \n \nMickey and his pals are ready to hit the slopes. Race in fantastic locals, compete against friends, and show off your trick style to see who is king of the snowy castle. \n \nGame features include 5 massive stages, 30 boards to unlock and boost performance, a wide range of outrageous tricks, and multiplayer mode to race against your friends.", "id": 49304, "name": "Disney Sports Snowboarding"}, {"genres": [14], "summary": "Premier Manager 2004-2005 is a Sports game, developed and published by Zoo Digital Publishing, which was released in Europe in 2004.", "id": 49355, "name": "Premier Manager 2004-2005"}, {"genres": [14], "summary": "You can perfect your technique in free fishing. Then use these skills to compete to be the number one Bass Fisherman and land that Monster Bass Fishing. You can also store your best six catches in the aquarium for later viewing.", "id": 49324, "name": "Monster! Bass Fishing"}, {"summary": "Nothing is what it seems in Townsville! The Powerpuff girls have been sent on a perfectly innocent scavenger hunt by Mrs. Keane until the evil Him steps in with his own version of the game to spice things up! Take control of Blossom Bubbles and Buttercup and defeat the villains solve the mystery and teach Him a lesson once and for all.", "id": 49433, "name": "The Powerpuff Girls: Him and Seek"}, {"genres": [14], "summary": "Let's Ride! Sunshine Stables is a Sports game, developed by ValuSoft and published by THQ, which was released in 2005.", "id": 49395, "name": "Let's Ride!: Sunshine Stables"}, {"genres": [12], "summary": "Jake Long's most fierce enemy, Dark Dragon, takes Rose, Jake's love interest, hostage in order to cause Jake's destruction in Disney's American Dragon: Jake Long, Attack of the Dark Dragon. When Dark Dragon realizes the evil Huntsman also has an interest in rescuing his hostage, the ultimate duel ensues. Players battle their way through an onslaught of villains that pour in from every direction to save Rose in the process.", "id": 49410, "name": "Disney's American Dragon Jake Long: Rise of the Huntsclan!"}, {"summary": "A 2D platformer with 3D elements, Ozzy & Drix is based on the hit cartoon series from the Kids' WB! which in turn is based on the movie Osmosis Jones. Join the gross-out adventures of a white blood cell \"cop,\" Ozzy, and his over-the-counter cold pill sidekick, Drix. Fans of the hit series will now be part of the action on Game Boy Advance. Whiz down a blood cell highway in the \"Cel Camino,\" provide protection from the dreaded \"Phlegm-alanche,\" face off against nemesis Spryman and Gluteus and more as Ozzy & Drix live and play in their world inside teenage boy Hector Cruz.", "id": 49318, "name": "Ozzy & Drix"}, {"genres": [8], "summary": "Initiate contact with another galaxy and launch a makeshift satellite into space before breakfast. That's nothing for Jimmy Neutron, the teenage super genius whose amazing inventions often get him into heaps of trouble. This time, it's up to you to get Jimmy out of his toughest tangle. You'll go through six levels, including Jimmy's house, the Asteroids, Yolkus Underworld, Yolkus City, and Retroland. Jet around on Goddard, Jimmy's proudest invention that can turn into the Goddard Pogo, Goddard Scooter, and the Goddard Sled. Can Jimmy's get himself through this grand adventure?", "id": 49291, "name": "Jimmy Neutron: Boy Genius"}, {"summary": "Fight for humanity as Ulysses, a deep-space astronaut shipwrecked on Earth nearly 2000 years into the future. To his horror, a deadly breed of intelligent apes has evolved from mankind and now dominate the Earth. Hunted to near-extinction, the rag-tag human survivors huddle in fear of the Ape Empire. Against impossible odds, Ulysses must infiltrate the simian society and halt the genocidal plan of Ape General Ursus.", "id": 49358, "name": "Planet of the Apes"}, {"summary": "Wild Thornberrys: Chimp Chase TV?s favorite explorers are coming to the Game Boy Advance this fall. Darwin has been kidnapped and Eliza and her family must travel the globe in search of her chimp. In this side-scrolling adventure game, players travel through 12 exotic levels featuring Africa, South America, Australia and even the Arctic Circle.", "id": 49373, "name": "The Wild Thornberrys: Chimp Chase"}, {"summary": "Noddy wakes up in his colourful building block house and starts his day with a smile. Driving around Toyland he meets several friends who are in need of help -and Noddy is always willing to lend a hand. Play and interact with Noddy and other favourite characters from Toyland including Big Ears, Mr. Sparks, Miss Pink Cat, Tessie Bear, Dinah Doll, Martha Monkey and Mr. Wobbly Man. Visit Big Ears or help Mr Sparks locate his tools or find Tessie Bear's dog and help her make delicious strawberry ice cream.", "id": 49388, "name": "Noddy: A Day in Toyland"}, {"genres": [13], "summary": "Dogz Fashion allows players to adopt their own adorable puppy, dress him/her up in all kinds of fashionable outfits and enter him/her to win fashion competitions.", "id": 49403, "name": "Dogz: Fashion"}, {"genres": [12], "summary": "Daisuki Teddy is a Role-Playing game, published by MTO, which was released in Japan in 2002.", "id": 49543, "name": "Daisuki Teddy"}, {"genres": [15], "summary": "Daisenryaku for Game Boy Advance is a Strategy game, published by Media Kite, which was released in Japan in 2001.", "id": 49545, "name": "Daisenryaku for Game Boy Advance"}, {"summary": "A platform fighting game based on the Coro Coro comic Croket!, with a story mode that includes light exploration and RPG elements.", "id": 49550, "name": "Croket! 3: Granyuu Oukoku no Nazo"}, {"summary": "The first game based on a manga series about a young boy who is trying to collect enough magical coins to resurrect his father.", "id": 49552, "name": "Croket! Yume no Banker Survival!"}, {"genres": [15], "summary": "This volume of Hudson Best Collection brings the first two Lode Runner games from the Famicom to the GameBoy Advance: \nLode Runner \nChampionship Lode Runner", "id": 49495, "name": "Hudson Best Collection Vol. 2: Lode Runner Collection"}, {"genres": [8], "summary": "Pocket Meat is an attempt to re-create the massive hit, Super Meat Boy as a GBA game. The developer managed to successfully capture the feel of the first few levels of Super Meat Boy. While the graphical style isn't exactly the same, most of the effects and the actual gameplay is quite exact albeit. It's an excellent port of Super Meat Boy and well worth trying out.", "id": 49504, "name": "Pocket Meat"}, {"genres": [5, 9], "summary": "Math Patrol: The Kleptoid Threat is an educational gaming experience offering over 70 missions of alien combat. The game automatically adjusts to the player's skill level, providing an individualized learning experience.", "id": 49475, "name": "Math Patrol: The Kleptoid Threat"}, {"genres": [4], "summary": "The Hokage Ninja Clan's strongest and most dangerous Madougu, \"Tendou Jigoku\" fell into the hands of Mori Kouran. In order to create the perfect body, he abducted the Hime with the power of healing, Sakoshita Yanagi, so that he could absorb her.In order to save Yanagi and break Mori Kouran's ambitions, Recca and his friends wanted to go immediately to the fortress city \"SODOM\"... Recca no Honoo: Flame of Recca is an Action game, published by Konami, which was released in Japan in 2001.", "id": 49412, "name": "Flame Of Recca"}, {"genres": [14], "summary": "Join the fun in this cute and colourful tennis game. Choose from 6 quirky characters and take on all new comers, in an attempt to become the number one WORLD TENNIS STARS. With 6 exciting courts and two play modes, WORLD TENNIS STARS will serve up hours of fun.", "id": 49349, "name": "World Tennis Stars"}, {"genres": [31], "summary": "Let's Ride! Dreamer is an Adventure game, developed by Kritzelkratz and published by DTP Entertainment, which was released in 2005.", "id": 49396, "name": "Let's Ride!: Dreamer"}, {"genres": [15], "summary": "Duel Masters: Shadow of the Code is a Strategy game, developed by Amble and published by Atlus, which was released in 2005.", "id": 49402, "name": "Duel Masters: Shadow of the Code"}, {"summary": "Remember the old Haunted Mansion ride at Disneyland? Probably the better question is, how could you not? The creepy hallways, the gliding chairs, the crystal ball, and all of the ghosts -- the popular attraction has frightened children and entertained adults for decades. And now the ride has come to life on the silver screen and on the Game Boy Advance. Developed by Pocket Studios, the game itself follows a standardized action-adventure formula. Main hero Zeke, armed with a magical lantern called the Beacon of Souls, moves about the mansion environment, captures the 999 ghosts, solves puzzles and restores light to rooms.", "id": 49405, "name": "Disney's The Haunted Mansion"}, {"summary": "Barbie Software: Groovy Games is a Miscellaneous game, developed by Digital Illusions and published by VU Games, which was released in 2002.", "id": 45171, "name": "Barbie Software: Groovy Games"}, {"genres": [4], "summary": "How advanced is your karate? Find out in this martial arts game for the Game Boy Advance. Bigger, badder and better than ever before, International Karate Advanced pits you against a series of increasingly skilled opponents, progress from white to black belt in the exciting Tournament and Dojo Game Modes, bump up your score in the demanding Bonus Games and sharpen your skills in the Practice Area.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xsyfailrkeuhjputgou6.jpg", "width": 1000, "cloudinary_id": "xsyfailrkeuhjputgou6", "height": 1008}, "id": 49292, "name": "International Karate Advanced"}, {"genres": [10], "summary": "Every night, in cities like LA, Philly, and Miami, crews of import tuners push their nitrous-injected obsessions to the limit. Whether in under- ground or sanctioned races, on the track or through the wide open city streets, high speeds bring high risks. And serious rush. In the Street Racing Syndicate, choose your races carefully. Your opponent could have more under the hood than it seems. Consider this your initiation into the underground world of street racing.", "id": 49382, "name": "SRS: Street Racing Syndicate"}, {"genres": [9], "summary": "Raise your sails and rouse your crew. It's time to discover new lands on the first commodities trading game for GameBoy Advance. Captain your own ship, with a band of wacky sailors at your command. Become the supreme Sea Trader as you trade in silk, grain, currency and black market goods to increase your wealth. Fight off pirates when they try to steal your goods, or even attack other ships to plunder their spoils. And when you're victorious, carousing is optional.", "id": 49386, "name": "Sea Trader: Rise of Taipan"}, {"summary": "Whac-A-Mole enlists players to whac, zap and crush 10 new challenging breeds of moles including Pilot Moles that fly planes, Racer Moles that drive cars, Ninja Moles that attack with throwing stars, Soldier Moles that shoot bazookas and Electric Moles that try to shock gamers throughout seven unique worlds. Whac-A-Mole feature two modes of play -- Arcade Mode, where players race against the clock to complete goals in a world that is layered with power-ups, combats and challenging mole enemies and Quickplay mode, which allows players to customize their experience by choosing from game types, number of rounds and difficulty levels, resulting in a randomly generated mix of puzzle and arcade levels. The Game Boy Advance version includes a Classics mode, featuring such mini games as Tic-Tac-Toe and other favorites.", "id": 49347, "name": "Whac-A-Mole"}, {"genres": [14], "summary": "Billed as the first Beach Soccer video game designed especially for fans of soccer and extreme sports, Ultimate Beach Soccer offers five-on-five action with lots of aerial passes, special moves, combos, intense shooting and scoring, spectacular goals and saves. Set in unique and exotic locations spanning the globe, including Rio, France, Japan and Venice Beach, California, Ultimate Beach Soccer offers detailed and exotic stadiums, with daytime and nighttime games, including spectacular pitch-side shows with DJs, cheerleaders and commentators all fully modeled and animated in-game. Game modes range from quick match to long-term competitions and custom tournaments. The game sports the Official Beach Soccer Federation License - Real Players, Real Teams and Real Locations.", "id": 49353, "name": "Ultimate Beach Soccer"}, {"genres": [31], "summary": "The action-adventure game features LarryBoy, the popular plunger-headed crime-fighting cucumber featured in several best-selling videos, in his quest to save the citizens of Bumblyburg from temptation. When trouble appears, the citizens of Bumblyburg call world-famous crime fighter LarryBoy! Aided only by his trusted butler Alfred (played with zest by Archibald Asparagus), LarryBoy is everything that his alter-ego Larry the Cucumber is not: bold... confident... relentlessly driven... brazenly heroic! Well, actually, that's not entirely true. While he tries to create this impression, inside, LarryBoy is still plain-old Larry. LarryBoy attempts to save the day with clever use of his super-suction ears and the many features of the Larry-Mobile. Call him a kinder, gentler, slightly slower superhero!", "id": 49374, "name": "VeggieTales: LarryBoy and the Bad Apple"}, {"summary": "Sky Dancers is a game made for girls based on the Sky Dancers line of toys. \n \nYoung adventurers can fly off on an exciting journey with Angelica, Camille and Jade! Queen Skyla has chosen the best dancers from her High Hope Dance Academy to defend the Wingdom from the evil Sky Clone and his wicked servants and henchmen. Sky Clone has spirited away the Queen so he can take over the Wingdom, and the Sky Dancers must use their magical feathers and new special skills to save the day. The game features collectible in-game Sky Dancers costumes and hair accessories that may be traded via the Game Link cable, five unique levels of play, and three mini games: \"Angelica's Perfect Aim,\" \"Jade's Sky Slalom,\" and \"Camille's Treasure Hunt.\"", "id": 49401, "name": "Sky Dancers"}, {"genres": [8], "summary": "The Cabbage Patch Kids recently rescued puppies and are holding a lunch in town square to celebrate their new additions. While the puppies nap in the Babyland Playroom, the kids head to lunch in the square. Upon their return they find that they puppies have wrangled their way loose and escaped! You'll track them down in the park, in town, even at a car wash! After you find everyone's puppies, you'll encounter one puppy without a home...it just so happens it's the perfect fit for you!", "id": 49363, "name": "Cabbage Patch Kids: The Patch Puppy Rescue"}, {"genres": [8], "summary": "Care Bears: Care Quest is an Action game, developed by Sirius Games and published by The Game Factory, which was released in 2005.", "id": 49368, "name": "Care Bears: The Care Quests"}, {"genres": [12], "summary": "The legend goes that the Warriors were betrayed by their friend and never even fought the Eternal Beast. Django has to climb the Ancient Tree. At the top is Wings of Death, Hresvelgr, the second Immortal, who has captured Trinity and uses him as a bait to lure Django, as well as sucking power away from the tree. While keeping Trinity out of harm's way, Django defeats Hresvelgr, taking the coffin back to the Piledriver and successfully purifies him. However, as Django tries to return to San Miguel, The Count reappears, and challenges Django. Trinity freaks out and runs. Clouds cover the sky, and Dark Matter starts to rain down on Django. Trinity realizes that The Legend of The Warriors of Light is a true story: about Django. He believes that Django dies and the world ends because he \"betrayed\" Django. Django journeys to Pirate Island, where he learns more about Carmilla, and about what happened. Django defeats Machine King Nidhoggr, the Immortal charged with preventing Django from making it into space, and Piledrives him. Having a usable ship, Django heads back to the place where they fought. The Solar Boy enters a cannon and is fired into space, landing at the Dark Castle. \n \nDjango finds Carmilla before the last level and after talking, he decides to do all he can to save the world, even if that means losing his brother. \n \nMaking it to the core, Django fights against Vanargand (and Sabata). After a long, arduous battle, Django defeats the creature. A pseudo bike battle then occurs. As Django makes it out into the sunlight, Otenko or Sabata (on his own bike) is freed from Vanargand. As they reach the end of the road, Django and Otenko or Sabata combine their powers and finish Vanargand.", "id": 49418, "name": "Boktai 3: Sabata's Counterattack"}, {"summary": "Can you help Santa and his elves stop Jack Frost from wreaking major holiday havoc? You'll have to overcome treacherous falling icicles, evil snowmen, powerful gusts of wind and lots of other obstacles. Take to the skies with Santa in his sleigh and battle the elements to deliver gifts to good boys and girls (and coal to the naughty.) Also included are puzzle-based challenges where you must help Santa's elves build toys in time for Christmas.", "id": 49429, "name": "The Santa Clause 3: The Escape Clause"}, {"summary": "In the interactive game, an animated Lizzie takes on a side-scrolling action-adventure filled with 12 captivating levels. Players travel to Lizzie's favorite places to hang, such as the beach and shopping mall -- but along the way must be sure to look out for cheerleaders and other rivals who are plotting to ruin the day.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tpulc5wxxucnthmlkehc.jpg", "width": 1024, "cloudinary_id": "tpulc5wxxucnthmlkehc", "height": 1019}, "id": 49393, "name": "Lizzie McGuire 2: Lizzie Diaries"}, {"genres": [31], "summary": "The critically acclaimed story of love and survival in the world's harshest environment becomes a wondrous videogame journey! In the video game adaptation of the Oscar-winning film March of the Penguins you’ll guide loveable Emperor Penguins on their incredible journey for survival, defying the elements, in the name of life and family. This magical \"edutainment\" quest stars some of the most beloved animals on Earth ... and featuring some of the most dangerous predators and environments ever encountered.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/tklrcwuo7znbwwcpwm6x.jpg", "width": 263, "cloudinary_id": "tklrcwuo7znbwwcpwm6x", "height": 396}], "id": 20648, "name": "March of the Penguins"}, {"genres": [12], "summary": "Make your own happy ending. Every little girl dreams of one day becoming a princess and now is your chance. Play as Snow White, Cinderella, Ariel, Sleeping Beauty, Belle, and Jasmine as you search for the magical Tiara of Friendship to make sure that everyone lives happily ever after. Along the way, you'll meet tons of other Disney characters including the seven dwarfs, Sleeping Beauty's fairy godmothers, and Aladdin's Genie, but watch out because you'll also run into an evil villain or two. Play as Cinderella, Ariel (The Little Mermaid), Snow White, Belle (Beauty and the Beast), Jasmine (Aladdin), and Sleeping Beauty. Visit Snow White's enchanted forest, save Belle's magical castle, fly on Aladdin's magic carpet and more. Interact with tons of other classic Disney characters, including the seven dwarfs, Genie, and a host of Disney villains. Bonus stage featuring a team-up of all of the Princesses. Each of the six Princess story worlds has 3 levels, resulting in over 18 levels of fun.", "id": 49411, "name": "Disney Princess: Royal Adventure"}, {"summary": "In this action game based on the toy franchise, you play as a young boy called Yamato who loves his B-Daman machines more than anything. You'll face off in B-Daman battles with Yamato's rivals, making use of special attacks to emerge victorious. Throughout the course of the game, you'll customize your machines and raise Yamato. Yamato will also meet characters both familiar and unknown on his journeys, including the warm-hearted Alan and the sinister-looking Goblin. Only a few have what it takes to become a B-Daplayer; will Yamato become the B-Dachampion?", "id": 49364, "name": "Battle B-Daman: Fire Spirits!"}, {"genres": [5], "summary": "YOUR MISSION is to destroy all the aliens you encounter, while protecting the ten people assigned to each moon that you visit. Survive past all 4 moons and you will have earned your reward of being trans-warped back home to earth, 500 million miles away, to a hero's welcome.", "id": 49370, "name": "Super Dropzone: Intergalactic Rescue Mission"}, {"summary": "Based on the December 2002 movie from Paramount Pictures and Nickelodeon Movies, follow the Wild Thornberrys from majestic settings of the Serengeti to the proper streets of London. After an incident in Africa puts Eliza in grave danger, she is sent off to boarding school in London. Upon hearing about an evil plot by poachers to capture the wild elephants of the Serengeti, she escapes back to the wild to stop the catastrophic event and faces her biggest challenge yet. With her ability to speak with animals, Eliza gets help from her favorite chimp Darwin. But will Eliza get back to Africa in time to stop the poachers? Take a ride full of action and suspense with the Wild Thornberrys!", "id": 49372, "name": "The Wild Thornberrys Movie"}, {"genres": [14], "summary": "Hikaru no Go 2 is a Miscellaneous game, developed by KCEJ and published by Konami, which was released in Japan in 2002.", "id": 49629, "name": "Hikaru no Go 2"}, {"genres": [12], "summary": "GetBackers Dakkanya: Metropolis Dakkan Sakusen! is a Role-Playing game, published by Konami, which was released in Japan in 2003.", "id": 49600, "name": "GetBackers Dakkanya: Metropolis Dakkan Sakusen!"}, {"summary": "GetBackers Dakkanya: Jigoku no Scaramouche is an Action game, published by Konami, which was released in Japan in 2001.", "id": 49601, "name": "GetBackers Dakkanya: Jigoku no Scaramouche"}, {"genres": [14], "summary": "Ganbare! Dodge Fighters is a Sports game, developed by Kamui and published by Bandai, which was released in Japan in 2005.", "id": 49610, "name": "Ganbare! Dodge Fighters"}, {"genres": [15], "summary": "Gakuen Senki Muryou is a Strategy game, published by MTO, which was released in Japan in 2003.", "id": 49563, "name": "Gakuen Senki Muryou"}, {"summary": "The second Pretty Cure game for Game Boy Advance.", "id": 49568, "name": "Futari wa Precure Max Heart: Maji? Maji!? Fight de IN Janai"}, {"summary": "Fruits Mura no Doubutsu Tachi is a Miscellaneous game, published by TDK Core, which was released in Japan in 2004.", "id": 49572, "name": "Fruits Mura no Doubutsu Tachi"}, {"genres": [14], "summary": "Field of Nine: Digital Edition 2001 is a Sports game, published by Konami, which was released in Japan in 2001.", "id": 49576, "name": "Field of Nine: Digital Edition 2001"}, {"genres": [15], "summary": "Duel Masters 2: Invincible Advance is a Strategy game, developed by Amble and published by Atlus, which was released in Japan in 2004.", "id": 49584, "name": "Duel Masters 2: Invincible Advance"}, {"genres": [14], "summary": "Derby Stallion Advance is a Sports game, developed by ParityBit and published by Enterbrain, which was released in Japan in 2002.", "id": 49540, "name": "Derby Stallion Advance"}, {"genres": [14], "summary": "Dai-Mahjong is a Miscellaneous game, published by Hori, which was released in Japan in 2001.", "id": 49546, "name": "Dai-Mahjong"}, {"summary": "A game based on the Bomberman Jetters anime. Includes a pinball game, a collection of Bomberman Land-esqe minigames, and the franchise's famous Battle Mode.", "id": 49528, "name": "Bomberman Jetters: Game Collection"}, {"genres": [12], "summary": "The game takes place in Dino City, a virtual city where monsters known as Dinos can live. As the player, you are given the responsibility of creating Dinos and building places for them to live in the city. You can also use your Dinos to battle against other humans' Dinos through a system known as Dino Net. Battles take place on a virtual grid where both teams cannot see the other until they choose to attack. The battle system is quite different from other RPGs in this sense, with strategic elements resembling Battleship and Minesweeper. For battling, Dinos are capable of equipping specialized weapons and armor known as Devices. Devices boost a Dino's stats in battle and also give them a special attack, effectively allowing the player to customize the Dino's strengths and moveset.", "id": 49500, "name": "Gachasute! Dino Device - Blue"}, {"genres": [12], "summary": "Fullmetal Alchemist: Stray Rondo is a role playing game for the Gameboy Advance published by Bandai. It is one of two FMA games for the GBA that were only released in Japan. This is the first game chronologically out of the 2, the second being Sonata of Memories.", "id": 49503, "name": "Hagane no Renkinjutsushi: Meisou no Rinbukyoku"}, {"genres": [12], "summary": "POWDER is a roguelike developed specifically for the Gameboy Advance (GBA). It is not a port of an existing roguelike as the controls of the GBA are very different from the traditional keyboard and the screen imposes some additional limitations. It is built around replayability and long term ergonomics, not short term learning. It uses actual graphic tiles (16x16) rather than the traditional characters. You may wish it didn't as I drew the tiles and am not an artist. \n \nI created POWDER for one simple reason: I wanted a roguelike on my GBA. The standard RPGs were annoying me with endless battle screens against weak enemies to unfold a drug induced plotline. I wanted a game I could just jump into and start killing things. Having had more hours than I'd care to log playing Nethack, ADOM, and the Diablos, I knew the exact type of game I wanted. The problem was I didn't see anyone publishing it any time soon. \n \nThis release of POWDER is for anyone in a similar situation who doesn't want to spend the time needed to write a roguelike.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/axxmokwf5kohnqqb1uyc.jpg", "width": 900, "cloudinary_id": "axxmokwf5kohnqqb1uyc", "height": 900}, "id": 49505, "name": "POWDER"}, {"genres": [8], "summary": "The Cat in the Hat is an Action game, developed by NewKidCo and published by Jack of All Games, which was released in 2005.", "id": 49507, "name": "The Cat in the Hat By Dr Seuss"}, {"id": 49463, "name": "Disney's The Jungle Book 2"}, {"genres": [31], "summary": "Word Safari combines the best of adventure video gaming with true learning content. To save the tribes of the Serengeti, you must journey across deserts and raging rivers, through thick jungles and hidden temples. You'll need to befriend the animals of Africa and use all your reading, spelling, and language skills to become The Chosen One and save the Sacred Watering Hole.", "id": 49472, "name": "Word Safari: The Friendship Totems"}, {"summary": "Based on a famous comics series. Kid Paddle is a young gamer, and everything in his life spins around videogames. Help Kid win the Virtua3000, the latest virtual game console! Train for the tournament through 26 mini games. Play with Kid, Horace, Big Bang and the little Barbarian. Beat high scores, win clues for an online prize on Kid's website.", "id": 49476, "name": "Kid Paddle"}, {"summary": "Animal Yokochou: Doki*Doki Shinkyuu Shiken! no Kan is an Action game, developed and published by Konami, which was released in Japan in 2006.", "id": 49446, "name": "Animal Yokochou: Doki*Doki Shinkyuu Shiken! no Kan"}, {"summary": "Welcome to the whimsical world of Sitting Ducks, where life is good, food's a plenty, and alligators are lurking in neighboring Swampwood. One bird stands out amongst the flock: Bill. He is a quirky, smaller than average duck with a big imagination and a secret fun loving side. Along with his alligator friend Aldo, Bill embarks on 20 different missions in this whimsical action game. Play as Bill the Duck and Aldo the Alligator from the TV series and explore colorful and detailed levels.", "id": 49428, "name": "Sitting Ducks"}, {"summary": "Rescue Heroes makes its blazing debut on the Game Boy Advance with Rescue Heroes team leader Billy Blazes guiding the way. Boys embark on firefighting adventures as they deploy a variety of gadgets and maneuver vehicles in a race against the flames. Players navigate Billy Blazes to run, jump, swing and dodge past unforeseen dangers. The junior heroes fly Billy Blazes through trees and jet the super firefighter through water to rescue and evacuate hikers, stranded motorists and people trapped in burning buildings. Obstacles and hazards will delay progress, but by exhibiting strong determination, boys can successfully direct Billy Blazes past each heated challenge to ensure that everyone in Sky High Village is saved, and no one gets left behind!", "id": 49431, "name": "Rescue Heroes: Billy Blazes"}, {"genres": [12], "summary": "One Piece: Nanatsu Shima no Daihihou is a Japan only RPG game for Game Boy Advance.", "id": 49573, "name": "From TV animation One Piece: Nanatsu Shima no Daihihou"}, {"genres": [15], "summary": "Fancy Pocket is a Strategy game, developed and published by Jorudan, which was released in Japan in 2002.", "id": 49579, "name": "Fancy Pocket"}, {"genres": [15], "summary": "Di Gi Charat: Di Gi Communication is a Miscellaneous game, developed by M2 and published by Broccoli, which was released in Japan in 2002.", "id": 49539, "name": "Di Gi Charat: Di Gi Communication"}, {"summary": "The second game in the Croket! video game series.", "id": 49551, "name": "Croket! 2: Yami no Bank to Ban Joou"}, {"summary": "Crayon Shin-Chan: Arashi no Yobu Cinema-Land no Daibouken! is an Action game, developed by Inti Creates and published by Banpresto, which was released in Japan in 2004.", "id": 49554, "name": "Crayon Shin-Chan: Arashi no Yobu Cinema-Land no Daibouken!"}, {"genres": [14], "summary": "Tactical Football Simulator developed by ParityBit. \n \nCalciobit is a Game Boy Advance soccer game released in 2006 by Nintendo and Paritybit. It's a simulation game released during the end of the GBA's lifespan. It was never released outside of Japan. The name Calciobit derives from the Italian word for soccer (Calcio) and chobitto, which means to play for a little bit. \n \nDue to not being released outside of Japan, very few English reviews have been published. NTSC-UK gave the game a disappointing 5/10 stating that while it's fun in short bursts, has lovable character animations and is fun to customize your own team, there are limited options, the matches are very slow, and it has a steep learning curve.", "id": 49522, "name": "Calciobit"}, {"genres": [15], "summary": "Boku wa Koukuu Kanseikan is a Strategy game, developed by Graphic Research and published by Tamsoft, which was released in Japan in 2001.", "id": 49529, "name": "Boku wa Koukuu Kanseikan"}, {"summary": "Boboboubo Boubobo: Majide!!? Shinken Shoubu is an Action game, developed by Rokumendo and published by Hudson, which was released in Japan in 2003.", "id": 49531, "name": "Boboboubo Boubobo: Majide!!? Shinken Shoubu"}, {"summary": "Ao Zora to Nakama Tachi: Yume no Bouken is an Action game, developed and published by MTO, which was released in Japan in 2002.", "id": 49492, "name": "Ao Zora to Nakama Tachi: Yume no Bouken"}, {"genres": [12], "summary": "Gachasute! Dino Device 2: Phoenix is an Action game, published by Rocket Company, which was released in Japan in 2003.", "id": 49497, "name": "Gachasute! Dino Device 2 - Phoenix"}, {"genres": [12], "summary": "The game takes place in Dino City, a virtual city where monsters known as Dinos can live. As the player, you are given the responsibility of creating Dinos and building places for them to live in the city. You can also use your Dinos to battle against other humans' Dinos through a system known as Dino Net. Battles take place on a virtual grid where both teams cannot see the other until they choose to attack. The battle system is quite different from other RPGs in this sense, with strategic elements resembling Battleship and Minesweeper. For battling, Dinos are capable of equipping specialized weapons and armor known as Devices. Devices boost a Dino's stats in battle and also give them a special attack, effectively allowing the player to customize the Dino's strengths and moveset.", "id": 49499, "name": "Gachasute! Dino Device - Red"}, {"genres": [8, 10, 14], "summary": "Motocross Challenge plays a lot like Excite Bike for the NES, with some features from Motocross Maniacs. It has greatly enhanced features compared to it's predecessors such as stunt bonuses (hold L for tricks), enemy AI, multiple track locations and different events. This game was never released commercially due to publishers backing out, however it is fully completed and polished. The developers released the game in ROM form on their website for free in April of 2007, and offered mail order cartridges.", "id": 49508, "name": "Motocross Challenge"}, {"summary": "bit Generations: Boundish is a Game Boy Advance video game released in July of 2006. It was released as part of the bit Generations games, and was only released in Japan. The game can be easily compared to the game Pong, though it features many gameplay differences, graphical enhancements (despite the graphics themselves being deliberately primitive), and sounds. \n \nIn the game, you'll take control of two paddles, each moving when the other one does. The goal is to keep the ball within the playing field. Allowing it to exit will result in a gameover. In all, there are five stages, each one containing different concepts though having the basic overall objective. For example, in the Wild Go Round you'll control a ball on a moving record. Because the record is moving, it'll alter the direction of the ball at pivotal moments, which will require the player to be quick on his feet and act appropriately. In all, the game's modes include Pool Flower, Box Juggling, Power Slide, Human League, and Wild Go Round. For players who wish to play multiplayer they can link with another Game Boy Advance with just a single cartridge. In multiplayer, all of the stages excluding Box Juggling are available for play.", "id": 49436, "name": "bit Generations: Boundish"}, {"summary": "An action-packed compilation of three of Capcom's most popular titles, originally released for the Nintendo Entertainment System. The trio of old school action titles includes \"Bionic Commando,\" \"Strider\" and \"Mighty Final Fight,\" all faithfully recreated and available to play in either the original aspect ratio or stretched to fill the handheld's widescreen display.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xaz41bhqm5g7gvhkivw1.jpg", "width": 1530, "cloudinary_id": "xaz41bhqm5g7gvhkivw1", "height": 1370}, "id": 49192, "name": "Capcom Classics Mini Mix"}, {"genres": [9, 15], "summary": "In Dungeon Dice monsters, there is a tiled board of 13 x 19 tiles (13 tiles wide) on which play is conducted. On either end of the board sits a \"Monster Lord\" (on the 7th tile from each side on the row closest to the players) representing either player. Each Monster Lord has 3 Life Points. The first player to lose all their Life Points loses. In the Yu-Gi-Oh! Anime, these were referred to as \"Heart Points\".", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gaun1j1pe3qmlde9yhzs.jpg", "width": 1530, "cloudinary_id": "gaun1j1pe3qmlde9yhzs", "height": 1370}, "id": 49211, "name": "Yu-Gi-Oh!: Dungeon Dice Monsters"}, {"genres": [9], "summary": "Sudoku is the puzzle phenomenon from Japan, a game that looks like a math problem, but is in fact a twisting puzzler. The rules are simple: start with a grid consisting of nine three-by-three squares in which some of the numbers are already supplied. Fill in the blank squares so that each column, row, and three-by-three grid contains a number from 1 to 9 with none repeated. \n \nDr. Sudoku for the Game Boy Advance is the first of a series of Sudoku products from Mastiff. The GBA title features 1,000 hand created puzzles, Original Mode (which lets you create you own Sudoku puzzles,) a tutorial mode, help for those moments when you really are stuck, the ability to \"pencil in\" possible solutions, and a puzzle problem creation mode.", "id": 49273, "name": "Dr. Sudoku"}, {"genres": [4], "summary": "Six monsters battle through seven destructive locations in an attempt to prove themselves as the greatest monster to walk the Earth. Each monster has a personal set of punches, kicks and special moves to Dominate over the competition. \n \nGame features include 7 monsters each with their own home arena and special moves, power-ups and weapons revealed by destroyings buildings, five different modes including link mode to play against four friends, and customized fights for unlimited styles of gameplay.", "id": 49298, "name": "Godzilla: Domination!"}, {"genres": [10], "summary": "Taxi 3 is a Racing game, developed by Visual Impact and published by Ubisoft, which was released in Europe in 2003.", "id": 49843, "name": "Taxi 3"}, {"genres": [31], "summary": "From AlphaDream and Graphic Research, Tomato Adventure is an RPG released only in Japan. Taking place in a kingdom with tomatoes abound, the gameplay is similar to that of the Mario & Luigi series. \n \nTomato Adventure, in terms of gameplay mechanics, is the predecessor of the Mario & Luigi series of games, even having its engine reused in the first installment on the GameBoy Advance. Originally developed for the Game Boy Color, Tomato Adventure transitioned to its successor, the Game Boy Advance, when the latter was released. The main difference between the two versions is believed to lie in the quality of audio and graphics, although little substantial information exists on the Game Boy Color version. \n \nTomato Adventure incorporates a number of RPG standards such as leveling up and travelling to various places to advance the plot. However, the battle system itself is substantially different than most games in the genre, as players have a more active role in how the fights turn out. During the player's turn, they can select a character's attack and then their target. From there, they must perform one of a number of different minigames which determines how successful the attack is. These range from simple button mashers to stopping a meter at a specific point. While attacks can land without reaching the optimal point, their effectiveness tends to be severed in the process. Additionally, each attack has a separate amount of usage points which dictate how many times the player can use that specific attack before needing to revitalize themselves.", "id": 49844, "name": "Tomato Adventure"}, {"genres": [31], "summary": "The 10th installment in the Tantei Jinguuji Saburo (Jake Hunter) series, and the first portable entry. When Jingūji attends his friend's funeral, his friend's mother asks him to investigate a missing person, while police inspector Kumano asks him to investigate the urban myth called \"Yū-chan\".", "id": 49852, "name": "Tantei Jinguuji Saburou: Shiroi Kage no Shoujo"}, {"genres": [31], "summary": "Tantei Gakuen Q: Kyuukyoku no Trick ni Idome! is an Adventure game, published by Konami, which was released in Japan in 2004.", "id": 49824, "name": "Tantei Gakuen Q: Kyuukyoku no Trick ni Idome!"}, {"genres": [15], "summary": "Super Robot Wars A (Advance) is the first Super Robot Wars on the Game Boy Advance. The Londo Bell forces battle against the Shadow Mirror.", "id": 49807, "name": "Super Robot Taisen A"}, {"summary": "Sugar Sugar Rune: Heart Ga Ippai! Moegi Gakuen is an Action game, developed by Open Sesame and published by Bandai, which was released in Japan in 2005.", "id": 49811, "name": "Sugar Sugar Rune: Heart Ga Ippai! Moegi Gakuen"}, {"genres": [12], "summary": "Snapkid's is a Role-Playing game, published by Enix Corporation, which was released in Japan in 2002.", "id": 49812, "name": "Snapkid's"}, {"genres": [31], "summary": "A Dragon Quest Action/Adventure spin-off title for the GBA featuring a Slime as its main character.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wdgoff4jpufplw965ct4.jpg", "width": 569, "cloudinary_id": "wdgoff4jpufplw965ct4", "height": 498}, "id": 1826, "name": "Slime MoriMori Dragon Quest 3: Taikaizoku to Shippo Dan"}, {"summary": "Third game in the Chou Senjiryakketsu series.", "id": 49783, "name": "Shaman King: Chou Senjiryakketsu 3"}, {"genres": [12], "summary": "Samurai Evolution: Oukoku Geist is a Role-Playing game, developed by TeaSet and published by Enix Corporation, which was released in Japan in 2002.", "id": 49792, "name": "Samurai Evolution: Oukoku Geist"}, {"genres": [14], "summary": "Pro Yakyuu Team o Tsukurou! Advance is a Sports game, published by Sega, which was released in Japan in 2002.", "id": 49762, "name": "Pro Yakyuu Team o Tsukurou! Advance"}, {"genres": [14], "summary": "One Piece: Going Baseball is a Japanese only game released for the GameBoy Advance in 2004.", "id": 49736, "name": "One Piece: Going Baseball - Kaizoku Yakyuu"}, {"genres": [12], "summary": "Monster Summoner is a Role-Playing game, published by Ertain, which was released in Japan in 2004.", "id": 49713, "name": "Monster Summoner"}, {"genres": [14], "summary": "Mezase! Koushien is a Sports game, developed and published by Tasuke, which was released in Japan in 2005.", "id": 49688, "name": "Mezase! Koushien"}, {"genres": [31], "summary": "Meitantei Conan: Nerawareta Tantei is an Adventure game, developed by Fortyfive and published by Banpresto, which was released in Japan in 2003.", "id": 49694, "name": "Meitantei Conan: Nerawareta Tantei"}, {"genres": [15], "summary": "Marie, Elie & Anis no Atelier: Soyokaze kara no Dengon is a Strategy game, published by Banpresto, which was released in Japan in 2003.", "id": 49699, "name": "Marie, Elie & Anis no Atelier: Soyokaze kara no Dengon"}, {"genres": [15], "summary": "Kisekae Angel is a Strategy game, published by Culture Brain, which was released in Japan in 2004.", "id": 49701, "name": "Majokko Cream-Chan Gokko Series 2: Kisekae Angel"}, {"genres": [14], "summary": "Kurohige no Golf Shiyouyo is a Sports game, developed by Inti Creates and published by Tomy Corporation, which was released in Japan in 2002.", "id": 49671, "name": "Kurohige no Golf Shiyouyo"}, {"summary": "Konchuu Monster: Battle Master is an Action game, developed and published by Culture Brain, which was released in Japan in 2005.", "id": 49682, "name": "Konchuu Monster: Battle Master"}, {"genres": [31], "summary": "Cesti to Meigurumi-tachi no Mahou no Bouken: Kisekko Gurumii is an Adventure game, published by MTO, which was released in Japan in 2003.", "id": 49641, "name": "Cesti to Meigurumi-tachi no Mahou no Bouken: Kisekko Gurumii"}, {"genres": [12], "summary": "Kidou Tenshi Angelic Layer is a role-playing game based on the Angelic Layer manga and anime.", "id": 49643, "name": "Kidou Tenshi Angelic Layer"}, {"genres": [14], "summary": "J.League Pro Soccer Club o Tsukurou! Advance is a Sports game, developed by Smilebit and published by Sega, which was released in Japan in 2002.", "id": 49614, "name": "J.League Pro Soccer Club o Tsukurou! Advance"}, {"genres": [8], "summary": "The final entry of the Hudson Best Collection series collects all four of Master Higgins' major NES adventures.", "id": 49624, "name": "Hudson Best Collection Vol. 6: Bouken Jima Collection"}, {"genres": [12], "summary": "Harobots: Robo Hero Battling!! is a Role-Playing game, published by Sunrise Interactive, which was released in Japan in 2002.", "id": 49634, "name": "Harobots: Robo Hero Battling!!"}, {"genres": [15], "summary": "Hamster Monogatari 2 GBA is a Strategy game, published by Culture Brain, which was released in Japan in 2001.", "id": 49591, "name": "Hamster Monogatari 2 GBA"}, {"summary": "Get Ride! AMDriver: Shutsugeki! Battle Party is a Miscellaneous game, developed by KCEJ and published by Konami, which was released in Japan in 2004.", "id": 49604, "name": "Get Ride! AMDriver: Shutsugeki! Battle Party"}, {"genres": [31], "summary": "Fushigi no Kuni no Alice is a Miscellaneous game, published by Global A, which was released in Japan in 2003.", "id": 49571, "name": "Fushigi no Kuni no Alice"}, {"genres": [31], "summary": "One Piece: Aim! The King of Berry is a Japanese only game for Game Boy Advance. This game takes place from first arc in the story to the Baroque Works Saga.", "id": 49574, "name": "From TV animation One Piece: Mezase! King of Berry"}, {"genres": [31], "summary": "An Eighting developed arcade football game based on the Eyeshield 21 franchise which was published by Nintendo in Japan for the Game Boy Advance.", "id": 49582, "name": "Eyeshield 21: DevilBats DevilDays"}, {"genres": [31], "summary": "Based on the film of the same name, Spirit: Stallion of the Cimarron tells the tale of a rambunctious mustang stallion named Spirit and his journey through the untamed American West. A sudden and violent thunderstorm has hit Homeland and scattered the herd. Even Spirit is nowhere to be found. Luckily, Little Creek and Little Brook know of the lost horses and have set out to help them return to Homeland. Only you can help them get the herd home safely and find out what has happened to Spirit.", "id": 49257, "name": "Spirit: Stallion of the Cimarron"}, {"genres": [15], "summary": "Doubutsu no Shima no Chobi Gurumi is a Miscellaneous game, developed by AI and published by Rocket Science Games, which was released in Japan in 2003.", "id": 49264, "name": "Doubutsu no Shima no Chobi Gurumi"}, {"id": 49229, "name": "Best Friends: My Horse"}, {"genres": [12], "summary": "A crossover Tales series dungeon crawler for GBA.", "id": 49828, "name": "Tales of the World: Narikiri Dungeon 2"}, {"genres": [14], "summary": "Super Real Mahjong Dousoukai is a Miscellaneous game, developed by AI and published by Rocket Company, which was released in Japan in 2004.", "id": 49809, "name": "Super Real Mahjong Dousoukai"}, {"summary": "Slot! Pro Advance: Takarabune & Ooedo Sakura Fubuki 2 is a Miscellaneous game, published by Nippon Telenet, which was released in Japan in 2001.", "id": 49813, "name": "Slot! Pro Advance: Takarabune & Ooedo Sakura Fubuki 2"}, {"genres": [12], "summary": "A Japan only Game Boy Advance game in the Shin Megami Tensei Devil Children series. Along with Fire Book it's the sequel to Book of Light/Book of Dark in the SMT series.", "id": 49775, "name": "Shin Megami Tensei: Devil Children 2 - Koori no Sho"}, {"genres": [31], "summary": "Shin Kisekae Monogatari is an Adventure game, published by Marvelous Entertainment, which was released in Japan in 2003.", "id": 49777, "name": "Shin Kisekae Monogatari"}, {"genres": [15], "summary": "Shikakui Atama o Maru Kusuru Advance: Kokugo Sansuu Shakai Rikahen is a Miscellaneous game, published by Rocket Company, which was released in Japan in 2004.", "id": 49780, "name": "Shikakui Atama o Maru Kusuru Advance: Kokugo Sansuu Shakai Rikahen"}, {"genres": [9], "summary": "Shanghai Advance is a Puzzle game, published by SunSoft, which was released in Japan in 2001.", "id": 49782, "name": "Shanghai Advance"}, {"genres": [12], "summary": "Sengoku Kakumei Gaiden is a Role-Playing game, developed by KCE Studios and published by Konami, which was released in Japan in 2003.", "id": 49786, "name": "Sengoku Kakumei Gaiden"}, {"summary": "Sanrio Puro Land All-Characters is an Action game, developed and published by Tomy Corporation, which was released in Japan in 2003.", "id": 49789, "name": "Sanrio Puro Land All-Characters"}, {"genres": [15], "summary": "San Goku Shi Koumeiden is a Strategy game, developed and published by Koei, which was released in Japan in 2005.", "id": 49791, "name": "San Goku Shi: Koumeiden"}, {"summary": "The first game in the Oshare Princess fashion game series.", "id": 49773, "name": "Oshare Princess"}, {"genres": [15], "summary": "My Animal Centre in Africa is a Strategy game, developed by Zeal and published by Koch Media, which was released in Europe in 2006.", "id": 49758, "name": "Meine Tierklinik in Afrika"}, {"genres": [12], "summary": "Monster Guardians is a Role-Playing game, developed and published by Konami, which was released in Japan in 2001.", "id": 49716, "name": "Monster Guardians"}, {"genres": [12], "summary": "Monster Gate: Ooinaru Dungeon - Fuuin no Orb is a Role-Playing game, developed by KCE Studios and published by Konami, which was released in Japan in 2003.", "id": 49718, "name": "Monster Gate: Ooinaru Dungeon - Fuuin no Orb"}, {"genres": [15], "summary": "More wacky Momotaro train-based board game antics.", "id": 49720, "name": "Momotarou Dentetsu G: Gold Deck o Tsukure!"}, {"genres": [14], "summary": "Minna no Shogi is a Miscellaneous game, published by Success, which was released in Japan in 2004.", "id": 49726, "name": "Minna no Soft Series: Minna no Shogi"}, {"genres": [14], "summary": "Minna no Soft Series: Minna no Mahjong is a Miscellaneous game, developed and published by MTO, which was released in Japan in 2003.", "id": 49727, "name": "Minna no Soft Series: Minna no Mahjong"}, {"genres": [14], "summary": "Happy Trump 20 is a Miscellaneous game, developed by Kouyousha and published by Success, which was released in Japan in 2005.", "id": 49729, "name": "Minna no Soft Series: Happy Trump 20"}, {"genres": [15], "summary": "Majokko Cream-Chan Gokko Series 1: Wan Nyon Idol Gakuen is a Strategy game, published by Culture Brain, which was released in Japan in 2003.", "id": 49702, "name": "Majokko Cream-Chan Gokko Series 1: Wan Nyon Idol Gakuen"}, {"genres": [12], "summary": "A role-playing game based on the Mahou Sensei Negima anime.", "id": 49705, "name": "Mahou Sensei Negima! Private Lesson: Dame Desu Toshokan"}, {"summary": "Little Patissier: Cake no Oshiro is an Action game, developed and published by MTO, which was released in Japan in 2004.", "id": 49661, "name": "Little Patissier: Cake no Oshiro"}, {"summary": "Legendz: Sign of Necrom is an Action game, developed and published by Bandai, which was released in Japan in 2005.", "id": 49667, "name": "Legendz: Sign of Necrom"}, {"summary": "Konchuu Monster: Battle Stadium is an Action game, developed and published by Culture Brain, which was released in Japan in 2005.", "id": 49681, "name": "Konchuu Monster: Battle Stadium"}, {"genres": [9], "summary": "Gundam-flavored Puyo Puyo. \n \nKidou Gekidan Haro Ichiza: Haro no Puyo Puyo is a Puyo Puyo game based on the Mobile Suit Gundam franchise, the original TV series in particular. Puyos are replaced by Haros, and several Gundam characters are playable. The game features a story mode, a verses mode, and a survival mode where random characters throw garbage Haros into the player's field. \n \nWhenever a chain is completed, the chosen character will shout a famous phrase from the anime series; the game provides a large number of phrases that can be assigned to each character by the player.", "id": 49645, "name": "Kidou Gekidan Haro Ichiza: Haro no Puyo Puyo"}, {"genres": [10], "summary": "Initial D: Another Stage is a driving/racing game for Game Boy Advance, based on the anime and manga Initial D.", "id": 49621, "name": "Initial D: Another Stage"}, {"genres": [31], "summary": "Higanbana is an Adventure game, published by Athena, which was released in Japan in 2002.", "id": 49631, "name": "Higanbana"}, {"genres": [15], "summary": "Hanabi Hyakkei Advance is a Strategy game, published by Aruze Corp, which was released in Japan in 2004.", "id": 49636, "name": "Hanabi Hyakkei Advance"}, {"genres": [13], "summary": "Hamster Paradise Advanchu is a Simulation game, developed by Digital Kids and published by Atlus, which was released in Japan in 2002.", "id": 49587, "name": "Hamster Paradise: Advanchu"}, {"genres": [15], "summary": "Hamster Monogatari 3 GBA is a Strategy game, published by Culture Brain, which was released in Japan in 2002.", "id": 49590, "name": "Hamster Monogatari 3 GBA"}, {"genres": [9], "summary": "Hamepane Tokyo Mew Mew is a Puzzle game, developed by WinkySoft and published by Takara, which was released in Japan in 2002.", "id": 49593, "name": "Hamepane Tokyo Mew Mew"}, {"genres": [12], "summary": "Granbo is a Role-Playing game, published by Capcom, which was released in Japan in 2001.", "id": 49596, "name": "Guranbo"}, {"genres": [31], "summary": "Gensou Maden Saiyuuki: Hangyaku no Toshin Taishi is an Adventure game, developed and published by Digital Kids, which was released in Japan in 2003.", "id": 49606, "name": "Gensou Maden Saiyuuki: Hangyaku no Toshin Taishi"}, {"summary": "Genseijin Justirisers is an Action game, developed by WinkySoft and published by Konami, which was released in Japan in 2004.", "id": 49607, "name": "Genseijin Justirisers"}, {"genres": [14], "summary": "Famista Advance is a Sports game, published by Namco, which was released in Japan in 2002.", "id": 49580, "name": "Famista Advance"}, {"summary": "Di Gi Communication 2: Datou! Black GemaGema Dan! is an Action game, developed by M2 and published by Broccoli, which was released in Japan in 2004.", "id": 49537, "name": "Di Gi Communication 2: Datou! Black GemaGema Dan!"}, {"genres": [10], "summary": "Get behind the wheel and back on the streets as Tanner, the world's fastest undercover driver. An international gang war has erupted, and you are caught in the crossfire. Experience all new urban chaos as you dodge U.S. and Brazilian gangsters.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qkwjpqracfbsrrfeiowo.jpg", "width": 1530, "cloudinary_id": "qkwjpqracfbsrrfeiowo", "height": 1370}, "id": 49199, "name": "Driver 2 Advance"}, {"genres": [14], "summary": "Street Jam is a three-on-three street basketball game for Game Boy Advance. Select your team from a roster of 15 teams and over 40 different characters and enter the world of street-ball. Your aim is to win all illegal tournaments held in various locations of the downtown. The individual players differ in game style, speed, special dunks and graphic presentation. Compete in the arcade mode and win eight challenging matches against the CPU, or partake in the story mode. The latter lets you select your team, and try to rise up in the ranks via five different levels from beginner to violence mode throughout 20 different tournaments with animated story sequences.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vlefbwidnbt9qc7lunvo.jpg", "width": 1530, "cloudinary_id": "vlefbwidnbt9qc7lunvo", "height": 1370}, "id": 49219, "name": "Street Jam Basketball"}, {"genres": [5], "summary": "Play as your favorite Gundam Force character from the animated series and save the peaceful capital Neotopia from a mysterious ancient force. You can play the role of Captain Gundam, Zero the Winged Knight, or Musha Bakunetsumaru; equip your characters with weapons and items; and then head into battle. The journey spans three worlds and ends with a final showdown with the evil berserker Abigor. It's up to you to rescue Shute from the Dimension Halo and destroy the evil empire.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rrgvhoryu55ft5dkgwq1.jpg", "width": 1530, "cloudinary_id": "rrgvhoryu55ft5dkgwq1", "height": 1370}, "id": 49224, "name": "SD Gundam Force"}, {"summary": "Game Boy Advance brings CT SPECIAL FORCES 3: NAVY OPS to fans of vertical action combat game play. A special military unit called the Special Intervention Forces has but a single mission- to do away with all terrorist organizations and other menacing threats. The latest threat has to do with the fact that the enemy has in their possession a biochemical weapon that alters human DNA. They have used this chemical to strengthen hostility and athletic genes to produce an original species of insurgent. The Counter Terrorist Special Intervention Forces are the only ones who possess the strength and skill to crush this new adversary. Each player is responsible for controlling his or her member of the CT Special Forces, as each mission becomes increasingly difficult. In the latest threat of terrorism, the need for underwater soldiers has become a necessity. With scuba diving skills, the player can explore several underwater regions. Combat takes place in both the water and on land, so the game presents the player with a number of vehicle and weaponry options. Each skill is the most sophisticated available and designed to seek out and destroy the enemy. The game takes the player through 20 levels that test, challenge and drive the Special Forces towards victory. Fans of combat action games with a patriotic tone must try this intense game.", "id": 49253, "name": "CT Special Forces 3: Navy Ops"}, {"genres": [10], "summary": "Carrera Power Slide is a Racing game, developed by Tiertex Design Studios and published by Stadlbauer, which was released in Europe in 2003.", "id": 49308, "name": "Carrera Power Slide"}, {"genres": [10], "summary": "A group of drivers and teams have split from the Formula 1 Championship, after being held back by rules and regulations for too long. Races have become boring with overtaking and pure racing at an all-time low. The new racing league has been condemned as too dangerous and banned from using circuits around the world. The races instead take place in and around major cities. The cars use all the technology available today, to increase speed and `downforce?. With less stringent rules, teams have worked in different directions creating a wide variety of enhanced super cars.", "id": 22219, "name": "Downforce"}, {"summary": "You are the Human Torch! Unleash your powers as you take on enemies around the globe in this all-new Fantastic 4 adventure.", "id": 49299, "name": "Fantastic 4: Flame On"}, {"summary": "Join Polly and her friends for a day of fun and surprises at Super Splash Island. In Polly Pocket, you can play games and go on water rides while gaining special skills. Collect power-ups and prizes to help Polly move faster, or gain skills in each race to earn tickets. Water-park activities include sliding through colored tubes, racing in bumper boats, playing minigames, and more. As you progress through each event, you'll unlock dressing rooms full of fashion surprises. Polly Pocket also features two-player modes.", "id": 49434, "name": "Polly Pocket!: Super Splash Island"}, {"summary": "Pocket Professor: KwikNotes Volume One is a Miscellaneous game, developed and published by Pocket Direct, L.L.C., which was released in 2006.", "id": 49435, "name": "Pocket Professor: KwikNotes Volume One"}, {"genres": [14], "summary": "Tennis no Oji-Sama: Aim at the Victory! is a Sports game, developed by KCEJ and published by Konami, which was released in Japan in 2002.", "id": 49851, "name": "Tennis no Oji-Sama: Aim at the Victory!"}, {"genres": [15], "summary": "The 4th Super Robot Wars on the Game Boy Advance, D (Destiny) chronicles the battle against the Ruina. \n \nSuper Robot Wars D is the fourth Super Robot Wars game for the GBA. Unlike its (traditional) predecessor, Super Robot Wars R, D offers a more diverse selection of anime series, getting rid of mainstays like G Gundam, Gundam 0083, Zambot 3/Daitarn 3 and Combattler V/Voltes V for debuting series like Daltanius, The Big O and Megazone 23.", "id": 49806, "name": "Super Robot Taisen D"}, {"genres": [9], "summary": "The Block Kuzushi is a Puzzle game, developed by Access and published by D3Publisher, which was released in Japan in 2003.", "id": 49819, "name": "Simple 2960 Tomodachi Series Vol. 2: The Block Kuzushi"}, {"summary": "Silk to Cotton is an Action game, published by Mig Entertainment, which was released in Japan in 2002.", "id": 49820, "name": "Silk to Cotton"}, {"genres": [14], "summary": "Toukon Retsuden Advance is a wrestling game on Game Boy Advance.", "id": 43876, "name": "Shin Nippon Pro Wrestling: Toukon Retsuden 2"}, {"summary": "Shimura Ken no Bakatono-sama: Bakushou Tenka Touitsu Game is a Miscellaneous game, developed by Kamui and published by TDK Core, which was released in Japan in 2002.", "id": 49779, "name": "Shimura Ken no Bakatono-sama: Bakushou Tenka Touitsu Game"}, {"genres": [15], "summary": "Shikakui Atama o Maru Kusuru Advance: Kanji Keisanhen is a Miscellaneous game, published by Rocket Company, which was released in Japan in 2004.", "id": 49781, "name": "Shikakui Atama o Maru Kusuru Advance: Kanji Keisanhen"}, {"genres": [15], "summary": "China's Second Han Dynasty has collapsed. The entire country is in chaos as warlords battle each other for control. Each claims to be emperor, however none is powerful enough to retain the title. Romance of the Three Kingdoms puts you in the role of one of the warlords of Second Century China. As a master, you must recruit the best generals in the country and win their loyalty. They will advise you in times of peace, and fight alongside you on the battlefield. Negotiate with other masters, or simply attack them. Always use terrain to your best advantage, making sure to choose the right kind of attack for the situation. In times of peace, manage your states to increase their productivity and prepare your army for battle. Romance of the Three Kingdoms combines a huge database with advanced programming to give you a game in which the characters are so historically accurate and life-like, and the game events so real, you will swear you're living in Second Century China.", "id": 49790, "name": "San Goku Shi"}, {"summary": "PukuPuku Tennen Kairanban: Youkoso! Illusion Land e is an Action game, developed and published by Marvelous Entertainment, which was released in Japan in 2004.", "id": 49760, "name": "PukuPuku Tennen Kairanban: Youkoso! Illusion Land e"}, {"genres": [31], "summary": "Oshare Princess 3 is an Adventure game, published by Culture Brain, which was released in Japan in 2003.", "id": 49772, "name": "Oshare Princess 3"}, {"genres": [15], "summary": "Oshaberi Inko Club is a Strategy game, published by Alpha Unit, which was released in Japan in 2002.", "id": 49734, "name": "Oshaberi Inko Club"}, {"genres": [15], "summary": "Ochaken no Heya is a Simulation game, published by MTO, which was released in Japan in 2003.", "id": 49742, "name": "Ochaken no Heya"}, {"summary": "Nyan Nyan Nyanko no Nyan Collection is an Action game, developed and published by MTO, which was released in Japan in 2005.", "id": 49745, "name": "Nyan Nyan Nyanko no Nyan Collection"}, {"genres": [14], "summary": "Nippon Pro Mahjong Renmei Kounin: Tetsuman Advance ~Menkyo Kaiden Series~ is a Miscellaneous game, published by Kaga Tech, which was released in Japan in 2002.", "id": 49748, "name": "Nippon Pro Mahjong Renmei Kounin: Tetsuman Advance ~Menkyo Kaiden Series~"}, {"genres": [12], "summary": "Naruto: Path of the Ninja is an RPG based on the anime Naruto. It was released in Japan on Game Boy Advance.", "id": 49751, "name": "Naruto RPG: Uketsugareshi Hi no Ishi"}, {"genres": [15], "summary": "Nakayoshi Pet Advance Series 4: Kawaii Koinu Mini - Wanko to Asobou!! Kogatainu is a Strategy game, published by MTO, which was released in Japan in 2003.", "id": 49754, "name": "Kawaii Koinu Mini: Wanko to Asobou!! Kogatainu"}, {"genres": [14], "summary": "Mobile Pro Yakyuu: Kantoku no Saihai is a Sports game, developed by Mobile 21 and published by Konami, which was released in Japan in 2001.", "id": 49722, "name": "Mobile Pro Yakyuu: Kantoku no Saihai"}, {"genres": [12], "summary": "Metal Max 2 Kai is a Role-Playing game, developed and published by Now Production, which was released in Japan in 2003.", "id": 49690, "name": "Metal Max 2 Kai"}, {"genres": [31], "summary": "Meitantei Conan: Akatsuki no Monument is an Adventure game, developed and published by Banpresto, which was released in Japan in 2005.", "id": 49695, "name": "Meitantei Conan: Akatsuki no Monument"}, {"genres": [12], "summary": "Medarot Navi: Kabuto Version is a Role-Playing game, developed by Natsume and published by Imagineer, which was released in Japan in 2001.", "id": 49697, "name": "Medarot Navi: Kabuto Version"}, {"genres": [15], "summary": "Manga-ka Debut Monogatari: Akogare! Manga Ka Ikusei Game! is a Strategy game, published by TDK Core, which was released in Japan in 2002.", "id": 49700, "name": "Manga-ka Debut Monogatari: Akogare! Manga Ka Ikusei Game!"}, {"genres": [12], "summary": "An RPG developed by Banpresto in 2003 which focuses on character's from the Go Nagai universe, such as Cutie Honey, Devilman and Violence Jack.", "id": 49669, "name": "Legend of Dynamic Goushouden: Houkai no Rondo"}, {"genres": [12], "summary": "Konjiki no Gash Bell!! Makai no Bookmark is an anime-based role-playing adventure.", "id": 49679, "name": "Konjiki no Gash Bell!! Makai no Bookmark"}, {"genres": [13], "summary": "Koino no Kokoro Ikusei Game is a Simulation game, published by TDK Mediactive, which was released in Japan in 2003.", "id": 49683, "name": "Koino no Kokoro Ikusei Game"}, {"genres": [15], "summary": "Koinu to Issho! 2 is a Strategy game, published by Culture Brain, which was released in Japan in 2004.", "id": 49684, "name": "Koinu to Issho! 2"}, {"genres": [14], "summary": "Kinniku Banzuke: Kimeru! Kiseki no Kanzen Seiha is a Sports game, developed by Jupiter Multimedia and published by Konami, which was released in Japan in 2001.", "id": 49642, "name": "Kinniku Banzuke: Kimeru! Kiseki no Kanzen Seiha"}, {"genres": [15], "summary": "A Game Boy Advance Gundam title", "id": 49644, "name": "Mobile Suit Gundam Seed: Tomo to Kimi to Koko de"}, {"genres": [31], "summary": "Kamaitachi no Yoru Advance is an Adventure game, developed and published by ChunSoft, which was released in Japan in 2002.", "id": 49652, "name": "Kamaitachi no Yoru Advance"}, {"genres": [4], "summary": "K-1 Pocket Grand Prix is a kickboxing game, published by Konami, which was released in Japan in 2002. \n \nK-1 Pocket Grand Prix is a fighting game developed by Daft Co. and published by Konami Corporation for Game Boy Advance. \n \nK-1 Pocket Grand Prix is a kickboxing game that uses the K-1 brand and real fighters. \n \nPlayers can choose from one of fourteen different fighters. Players can kick, punch, and use special moves.", "id": 49656, "name": "K-1 Pocket Grand Prix"}, {"genres": [14], "summary": "J.League Winning Eleven Advance 2002 is a Sports game, developed by KCET and published by Konami, which was released in Japan in 2002.", "id": 49613, "name": "J.League Winning Eleven Advance 2002"}, {"genres": [5], "summary": "Hudson Best Collection Vol. 5 is a collection of three shooting-focused games by Hudson. \n \nIncluded in this cartridge: \n \nStar Force \nStar Soldier \nStarship Hector", "id": 49625, "name": "Hudson Best Collection Vol. 5: Shooting Collection"}, {"genres": [15], "summary": "Hello! Idol Debut is a Strategy game, published by TDK Core, which was released in Japan in 2004.", "id": 49632, "name": "Hello! Idol Debut"}, {"genres": [13], "summary": "Hamster Paradise: Pure Heart is a Simulation game, developed by Digital Kids and published by Atlus, which was released in Japan in 2003.", "id": 49588, "name": "Hamster Paradise: Pure Heart"}, {"genres": [12], "summary": "Hamster Monogatari Collection is a Miscellaneous game, published by Culture Brain, which was released in Japan in 2003.", "id": 49589, "name": "Hamster Monogatari Collection"}, {"genres": [31], "summary": "Hamster Club 4: Shigessa Daidassou is an Adventure game, developed by Nekogumi and published by Jorudan, which was released in Japan in 2003.", "id": 49592, "name": "Hamster Club 4: Shigessa Daidassou"}, {"summary": "Ghost Trap is an Action Adventure game, developed by Artoon and published by Eidos Interactive, which was released in Japan in 2002.", "id": 49599, "name": "Ghost Trap"}, {"genres": [31], "summary": "Gakkou no Kaidan: Hyakuyoubako no Fuuin is an Adventure game, published by TDK Core, which was released in Japan in 2004.", "id": 49566, "name": "Gakkou no Kaidan: Hyakuyoubako no Fuuin"}, {"genres": [15], "summary": "A board and dating sim otome game set in the Angelique universe. It was originally released for PC-FX, and later ported to several other platforms.", "id": 49570, "name": "Fushigi no Kuni no Angelique"}, {"genres": [15], "summary": "A Cardcaptor Sakura card game for Game Boy Advance.", "id": 49518, "name": "Card Captor Sakura: Sakura Card-hen - Sakura Card to Tomodachi"}, {"genres": [14], "summary": "BB Ball is a Sports game, developed and published by Micott & Basara, which was released in Japan in 2004.", "id": 49485, "name": "BB Ball"}, {"genres": [15], "summary": "Hudson Best Collectiom Vol.1: Bomberman Collection is a compilation video game for the Game Boy Advance. This was the first game of a series of collections made by Hudson that would span six titles.", "id": 49496, "name": "Hudson Best Collection Vol. 1: Bomberman Collection"}, {"genres": [12], "summary": "The second Fullmetal Alchemist game on Game Boy Advance.", "id": 49594, "name": "Fullmetal Alchemist: Omoide no Sonata"}, {"summary": "Enter the robotic mayhem of BattleBots: Design & Destroy, developed exclusively for the Game Boy Advance. Based on the TV show of the same name, BattleBots the game puts you in control of your favorite robotic vehicles, including Overkill, Tazbot, Diesector, Minion, and more. You can play as one of the combatants in the TV show or build your own BattleBot from six categories of parts and weapons. See how well your machine performs against up to four BattleBots.", "id": 49247, "name": "Battle Bots Design & Destroy"}, {"genres": [14], "summary": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. Furthermore, the game supports up to eight-way multiplayer matches and features a plethora of in-game unlockable content such as legendary players and exclusive apparel.", "id": 49300, "name": "FIFA World Cup Germany 2006"}, {"genres": [14], "summary": "Pinball Challenge Deluxe is an Action game, developed by Binary 9 Studios and published by Ubisoft, which was released in 2002.", "id": 49361, "name": "Pinball Challenge Deluxe"}, {"genres": [4], "summary": "ZATCH BELL: ELECTRIC ARENA by Bandai for the Game Boy Advance takes the original storyline of the cartoon characters and expands on it in this vivid fighting game that allows players to battle it out in a variety of styles. The premise of the cartoon and comic books revolves around a group of magical alien-like creatures known as the mamodos that have come to Earth to fight for their world's crown. The only problem is that they have to use humans in order to access their powerful spells. The main characters are a fourteen-year-old human named Kiyo and a mamodo boy named Zatch. The game offers players the opportunity to play as several different characters as well as several different modes. Like to play air, this does allow for a variety that will keep players engrossed in the world of the game for extended periods of time, but one of the modes allows for a link up to fight it out multiplayer style. In the game a team of players face off against another team in a basic two-dimensional background much like fighter games of the past. In order to win, a team must win two out of three matches, and although the human character is the only one that can take damage the two characters must always move together. Fans of the characters will quickly become reacquainted with the characters and story, and newcomers to the series will have fun learning what it's all about through ZATCH BELL: ELECTRIC ARENA.", "id": 49371, "name": "ZatchBell! Electric Arena"}, {"genres": [15], "summary": "Tokimeki Dream Series 1: Ohanaya-san ni Narou! is a Strategy game, published by MTO, which was released in Japan in 2002.", "id": 49845, "name": "Tokimeki Dream Series 1: Ohanaya-san ni Narou!"}, {"genres": [12], "summary": "Shingata Medarot is a remake of the first Medarot and was the last game in the series until its DS entry years later. Its art style is a huge departure from its predecessors'.", "id": 49823, "name": "Shingata Medarot: Kabuto Version"}, {"genres": [12], "summary": "A Japan only Game Boy Advance game in the Shin Megami Tensei Devil Children series. Along with Ice Book it's the sequel to Book of Light/Book of Dark in the SMT series.", "id": 49776, "name": "Shin Megami Tensei: Devil Children 2 - Honoo no Sho"}, {"genres": [12], "summary": "The third game in the Boktai series. It was never released outside of Japan. \n \nShin Bokura no Taiyou: Gyakushuu no Sabata (aka \"Boktai 3\") is the third in a line of action-RPG's conceived by Hideo Kojima, for the GBA. Despite never being released outside of Japan, Boktai 3 has garnered a cult following in English-speaking countries, so much so that a fan-translation was released to the internet. It maintains the tradition of utilizing an in-cart solar sensor in gameplay. \n \nAn undetermined amount of time after the events of Boktai 2, main character Django finds himself sealed in an underground prison by Sabata. Sabata, falling to the Dark Matter that corrupts his body, has once again sided with the Immortals, a vampiric race, and wishes to release the Beast of Destruction, Vanargand, with the intent of becoming the Beast itself. Django recovers and then sets out on a quest to stop Sabata and the Immortals once again, whether that means killing Sabata or not. \n \nBoktai 3, like its two predecessors, is an action-RPG played from an isometric perspective. Players will control Django to traverse an array of different dungeons. Like the first game, Boktai: The Sun is in Your Hand, Django will wield the Gun Del Sol (lit: Gun of the Sun) and swords (a feature introduced in Boktai 2 ), in addition to using light stealth elements such as pressing against walls and distracting enemies with noise to sneak by.  \n \nBeing an action-RPG, players can pick up loot, equip various pieces of armor, find weapons, and increase stats. Django has three different stats to upgrade: Vitality (increases Django's Hit Points), Spirit (increases Django's energy capacity when using the Gun Del Sol), and Strength (increases Django's overall attack power with all weapon-types). Armor can be equipped to the head, body, legs, in addition to an accessory. Each piece grants various stat bonuses and/or special effects, while different weapons have different attack powers, special effects, and attack styles.   \n \nUnlike Boktai 2, the Gun Del Sol is, once again, customizable with different lenses (change elemental properties), and different frames (change attack style). However, unlike Boktai 2, spears and hammers are no longer availible as melee weapons; the swords, though, now feature a wide array of effects and attack methods.  \n \nAs in past entries, the Boktai 3 cartridge holds a solar sensor. With it, players can use actual sunlight to affect the game. When Django is outside in the sunlight--or by some source of sunlight while inside--players can refill the Gun Del Sol's energy meter, dry up small water bodies, hasten or slow wind speed, speed up or delay timed hazards, or create \"solar bridges\". How much sunlight is hitting the solar sensor is represented by a 10-segment bar at the bottom of the screen.  \n \nIn dungeons, Django will sneak around, combat enemies, and solve puzzles. Occasionally, the player will find themselves in a \"Trap!\" room or a Mission, where the player will be put against a mini boss(es), or asked to fulfill certain objectives to proceed, respectively. At the end of each dungeon waits a boss, usually one of the Immortals. Django will be put into a life-or-death struggle in entertaining, diverse fights. When the battle is over, the boss is sealed in a coffin, and Django must then drag the coffin back through the dungeon, to the entrance (usually following a second, otherwise inaccessible, route through). Once there, Django will set up the \"Pile Driver\", a device used to destroy the Dark Matter that makes up an Immortal--the only way to actually destroy them--in another fight. Here, is one of the times where sunlight hitting the sensor is mandatory . The boss' life will drain only if sunlight gauge has at least one full segment. \n \nNew to the series, is the complete lack of explorable land outside dungeons. Past games had a full overworld and/or a central hub-town to run around in, and sometimes mini-dungeons other than the main Immortal dungeons. This game does not. The main town is a series of menus and small \"playable\" rooms. In between trips between the town and dungeons, are bike segments, new to the franchise, and unique to this game. Players will ride a bike, completely customizable, in a course-like stretch of land, fighting off enemy bikes and avoiding obstacles.", "id": 49778, "name": "Shin Bokura no Taiyou: Gyakushuu no Sabata"}, {"genres": [15], "summary": "Another title in the SD Gundam G Generation franchise. This game follows the system of the Wonderswan G-Gen games, and features a crossover plot.", "id": 49787, "name": "SD Gundam G Generation Advance"}, {"genres": [12], "summary": "Sansara Naga 1x2 is a Miscellaneous game, developed by Groove Box Japan and published by Victor Interactive Software, which was released in Japan in 2001.", "id": 49793, "name": "Sansara Naga 1x2"}, {"genres": [14], "summary": "Power Poke Dash is a Sports game, developed and published by Konami, which was released in Japan in 2006.", "id": 49764, "name": "Power Poke Dash"}, {"summary": "Pinky Monkey Town is a Miscellaneous game, published by Starfish, which was released in Japan in 2001.", "id": 49769, "name": "Pinky Monkey Town"}, {"genres": [15], "summary": "Ohanaya-san Monogatari GBA is a Strategy game, published by TDK Core, which was released in Japan in 2002.", "id": 49740, "name": "Ohanaya-san Monogatari GBA"}, {"genres": [31], "summary": "Natural 2: Duo is an Adventure game, published by Omega Micott, which was released in Japan in 2002.", "id": 49750, "name": "Natural 2: Duo"}, {"genres": [12], "summary": "Japanese festival RPG.", "id": 49719, "name": "Momotaro Matsuri"}, {"summary": "Miracle! Panzou: 7-tsu no Hoshi no Uchuu Kaizoku is an Action game, developed and published by Atlus, which was released in Japan in 2005.", "id": 49723, "name": "Miracle! Panzou: 7-tsu no Hoshi no Uchuu Kaizoku"}, {"genres": [14], "summary": "Minna no Soft Series: Shanghai is a Miscellaneous game, published by Success, which was released in Japan in 2003.", "id": 49725, "name": "Minna no Soft Series: Shanghai"}, {"genres": [15], "summary": "MiniMoni: Onegaio Hoshisama! is a Miscellaneous game, published by Konami, which was released in Japan in 2002.", "id": 49685, "name": "MiniMoni: Onegaio Hoshisama!"}, {"genres": [12], "summary": "Little Buster Q is a Role-Playing game, developed by Amedio and published by Tomy Corporation, which was released in Japan in 2002.", "id": 49662, "name": "Little Buster Q"}, {"genres": [12], "summary": "Zoids Saga: Fuzors is a Role-Playing game, developed by Amedio and published by Tomy Corporation, which was released in Japan in 2004.", "id": 49666, "name": "Zoids Saga: Fuzors"}, {"genres": [31], "summary": "Koinu to Issho! Aijou Monogatari is an Adventure game, developed and published by Culture Brain, which was released in Japan in 2003.", "id": 49637, "name": "Koinu to Issho! Aijou Monogatari"}, {"genres": [12], "summary": "This entry in the Klonoa series sees the floppy-eared hero training to become a true hero in a new RPG system. \n \nKlonoa Heroes: Densetsu no Star Medal is a spin-off of the Klonoa franchise, released only in Japan on December 13, 2002. Klonoa Heroes was developed by Namco and published by Namco for the Game Boy Advance. Klonoa Heroes is a twist on the traditional Klonoa games, putting Klonoa in a more action role playing game along the lines of Legend of Zelda or Beyond Oasis. The game does have voice acting, as well. Kumiko Watanabe plays Klonoa, Takahiro Sakurai plays Guntz, Shouzou Iizuke plays Pango, and Yutaka Shimaka plays Garlen. \n \nKlonoa Heroes' gameplay is very similar to the gameplay of The Legend of Zelda. Players can control one of three characters (Klonoa, Guntz, and Pango) in a top-down perspective, hitting enemies with various attacks (Klonoa with the Wind Ring seen in the platforming games, albeit with a few differences). Guntz uses a handgun, while Pango throws bombs. In addition, these characters can collect more weapons as the game progresses. Every enemy in the game is given a color (either blue or red), and the player must attack that enemy with the corresponding attack (as each weapon has a blue and red attack). \n \nKlonoa Heroes also has role playing aspects. Experience points are gathered by picking up Dream Shards after defeating enemies (failure to pick them up results in no experience). Enemies also drop coins, which can be spent on items and weapons. These items can be found in chests scattered throughout the levels, as well. Most items can be used to restore health, but there are various other uses (such as stat benefits). Leveling up also allows the player to distribute points in several different areas (traditional role playing game stats, such as attack, defense, and agility). These changes are not permanent, and can be changed at any time (when not in the middle of a level).", "id": 49638, "name": "Klonoa Heroes"}, {"summary": "Jurassic Park Institute Tour: Dinosaur Rescue is an Action game, developed and published by Rocket Company, which was released in Japan in 2003.", "id": 49657, "name": "Jurassic Park Institute Tour: Dinosaur Rescue"}, {"genres": [15], "summary": "Jinsei Game Advance is a Miscellaneous game, published by Takara, which was released in Japan in 2002.", "id": 49659, "name": "Jinsei Game Advance"}, {"genres": [12], "summary": "Hunter X Hunter: Minna Tomodachi Daisakusen!! is a Game Boy Advance RPG based on the manga series.", "id": 49623, "name": "Hunter X Hunter: Minna Tomodachi Daisakusen!!"}, {"summary": "Princess Blue: Hime Kishi Monogatari is an Action game, published by Tonkin House, which was released in Japan in 2002.", "id": 49628, "name": "Princess Blue: Hime Kishi Monogatari"}, {"genres": [14], "summary": "Hanafuda Trump Mahjong: Depachika Wayounaka is a Miscellaneous game, published by Global A, which was released in Japan in 2002.", "id": 49635, "name": "Hanafuda Trump Mahjong: Depachika Wayounaka"}, {"summary": "Goemon: New Age Shutsudou! gives the franchise a facelift, putting Goemon and his friends in a futuristic rendition of Japan, fending off a supernatural force threatening the city. \n \nGoemon: New Age Shutsudou! is a Japan only title in the Ganbare Goemon franchise. New Age Shutsudou is a semi-port/remake of Ganbare Goemon: Shin Sedai Shuumei, containing similar levels and plot to the PlayStation title. New Age Shutsudou was developed and published by Konami Corporation in 2002. The game (as well as Shin Sedai Shuumei) gives the Goemon universe a facelift. It takes place in futuristic Japan, Goemon is skinnier and sports a new hair-do, Ebisumaru is replaced with a shy girl who has a crush on Goemon named Ebisu, and Yae is replaced with Yui, a mermaid-like creature. \n \n The Impact scenes take place inside of a large mech. \nIn terms of gameplay, Goemon: New Age Shutsudou! is a fairly traditional side-scrolling action platformer. The player controls either Goemon or Ebisu, attacking enemies with their respective weapons (which can be leveled up three times in terms of power), and gathering coins. Each level is fairly linear in comparison to earlier Ganbare Goemon titles, and at the end of each level the player is taken to a world map. \n \nSome levels differentiate from this formula. These levels put the player in control of different characters. There are side-scrolling shoot-em-up stages starring characters like Sasuke. The weapon power-up system still works identically here, the gameplay style is just shifted. Additionally, there are stages where the player takes control of Yui, a mermaid-like creature. These stages are underwater. \n \nNew Age Shutsudou marks the return of the first person Impact scenes, which were previously in some of the Super Famicom Goemon games. These scenes put the player in control of a large mech, fighting other robots. The mech is immobile, but is able to melee attack, guard, and fire counter-attacking lasers.", "id": 49598, "name": "Goemon: New Age Shutsudou!"}, {"genres": [31], "summary": "GET! Boku no Mushi Tsukamaete is an Adventure game, developed by Wizard and published by Kemco, which was released in Japan in 2003.", "id": 49603, "name": "GET! Boku no Mushi Tsukamaete"}, {"summary": "Get Ride! AMDriver: Senkou no Hero Tanjou is an Action game, developed by WinkySoft and published by Konami, which was released in Japan in 2004.", "id": 49605, "name": "Get Ride! AMDriver: Senkou no Hero Tanjou"}, {"genres": [14], "summary": "Dream Management is a Sports game, published by Game Village, which was released in Japan in 2003.", "id": 49608, "name": "Dream Management"}, {"genres": [14], "summary": "Gambler Densetsu Tetsuya: Yomigaeru Densetsu is a Miscellaneous game, published by Athena, which was released in Japan in 2002.", "id": 49611, "name": "Gambler Densetsu Tetsuya: Yomigaeru Densetsu"}, {"summary": "A Game Boy Advance game based on the anime of the same name.", "id": 49578, "name": "Fantastic Children"}, {"genres": [14], "summary": "Dan Doh!! Tobase Shouri no Smile Shot is the second game based on the golf manga \"Dan Doh!!\"", "id": 49542, "name": "Dan Doh!! Tobase Shouri no Smile Shot"}, {"summary": "Unlock the mystery behind the sudden reappearance of the legendary swordsmen Demon Eyes Kyo in this fast-paced action adventure. Take up your weapons and battle against hordes of enemies, as you experience the story of Samurai Deeper Kyo! Features: Perform devastating special moves. Play as Demon Eyes Kyo, Kyoshiro Mibu, Yuya Shiina, Yukimura Sanada, or Benitora. Unlock powerful weapons and extra modes.", "id": 49424, "name": "Samurai Deeper Kyo"}, {"genres": [15], "summary": "Galaxy Angel Game Boy Advance: Moridakusan Tenshi no Full Course Okawari Jiyuu is a Strategy game, published by Marvelous Entertainment, which was released in Japan in 2002.", "id": 49562, "name": "Galaxy Angel Game Boy Advance: Moridakusan Tenshi no Full Course Okawari Jiyuu"}, {"summary": "In Gizmo's story, the cute Mogwai has to prevent Stripe from ruining Christmas for Kingston Falls by retrieving all the presents that Stripe has stolen. Gizmo uses a flashlight to kill gremlins after rolling into a ball and weakening the gremlins. He also must destroy any gremlins that get in his way. In Stripe's story, he comes up with a scheme to destroy his mortal enemy Gizmo and destroy mogwais. \nIf playing as Gizmo, all the enemies are generic gremlins. If playing as Stripe, the player will instead fight mogwais.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nupgndtofjcqmiripxxt.jpg", "width": 1531, "cloudinary_id": "nupgndtofjcqmiripxxt", "height": 1370}, "id": 49232, "name": "Gremlins: Stripe vs. Gizmo"}, {"genres": [14], "summary": "Backyard Skateboarding is a fast-paced extreme sports game that lets kids skate as a junior version of eight-time world skateboarding champion, Andy Macdonald. The 2006 edition of Backyard Skateboarding features new challenges, missions, gear, power ups, and unlockables. The game also has easier controls and faster gameplay.", "id": 49312, "name": "Backyard Skateboarding"}, {"genres": [12], "summary": "Sylvania Family: Yosei no Stick to Fushigi no Ki - Maron Inu no Onna no Ko is a Role-Playing game, published by Epoch, which was released in Japan in 2003.", "id": 49801, "name": "Sylvania Family: Yosei no Stick to Fushigi no Ki - Maron Inu no Onna no Ko"}, {"genres": [12], "summary": "Sylvania Families: Fashion Designer ni Naritai! Kurumi Risu no Onna no Ko is a Role-Playing game, published by Epoch, which was released in Japan in 2004.", "id": 49802, "name": "Sylvania Families: Fashion Designer ni Naritai! Kurumi Risu no Onna no Ko"}, {"summary": "Starcom: Star Communicator is a Miscellaneous game, published by Konami, which was released in Japan in 2001.", "id": 49804, "name": "Sutakomi: Star Communicator"}, {"genres": [31], "summary": "Sister Princess: Re Pure is an Adventure game, developed and published by Marvelous Entertainment, which was released in Japan in 2003.", "id": 49815, "name": "Sister Princess: Re Pure"}, {"summary": "Sentouin: Yamada Hajime is an Action game, developed by Rokumendo and published by Kids Station, which was released in Japan in 2004.", "id": 49785, "name": "Sentouin: Yamada Hajime"}, {"genres": [14], "summary": "Pro Mahjong Tsuwamono Advance is a Miscellaneous game, developed and published by Culture Brain, which was released in Japan in 2005.", "id": 49763, "name": "Pro Mahjong Tsuwamono Advance"}, {"genres": [8], "summary": "The Japanese-only sequel to Pinobee.", "id": 49768, "name": "Pinobee & Phoebee"}, {"genres": [15], "summary": "Pika Pika Nurse Monogatari: Hatsuratsu Nurse Ikusei Game is a Strategy game, published by TDK Core, which was released in Japan in 2003.", "id": 49770, "name": "Pika Pika Nurse Monogatari: Hatsuratsu Nurse Ikusei Game"}, {"genres": [15], "summary": "Okuman Chouja Game: Nottori Daisakusen! is a Miscellaneous game, developed by Mobile 21 and published by Takara, which was released in Japan in 2001.", "id": 49738, "name": "Okuman Chouja Game: Nottori Daisakusen!"}, {"summary": "Ojarumaru: Gekkou Machi Sanpo de Ojaru is an Action game, published by MTO, which was released in Japan in 2003.", "id": 49739, "name": "Ojarumaru: Gekkou Machi Sanpo de Ojaru"}, {"genres": [15], "summary": "Ochaken no Yume Bouken is a Simulation game, developed and published by MTO, which was released in Japan in 2005.", "id": 49741, "name": "Ochaken no Yume Bouken"}, {"genres": [31], "summary": "An otome dating sim.", "id": 49749, "name": "Harukanaru Toki no Naka de"}, {"genres": [15], "summary": "Kawaii Hamster is a Strategy game, developed and published by MTO, which was released in Japan in 2001.", "id": 49756, "name": "Kawaii Hamster"}, {"genres": [14], "summary": "Nakayoshi Mahjong: Kapu Richi is a Miscellaneous game, developed by KCET and published by Konami, which was released in Japan in 2001.", "id": 49757, "name": "Nakayoshi Mahjong: Kapu Richi"}, {"genres": [12], "summary": "Monster Maker 4: Killer Dice is a Role-Playing game, published by Success, which was released in Japan in 2002.", "id": 49714, "name": "Monster Maker 4: Killer Dice"}, {"genres": [31], "summary": "Minna no Ouji-Sama is a Miscellaneous game, developed and published by Konami, which was released in Japan in 2003.", "id": 49733, "name": "Minna no Ouji-Sama"}, {"summary": "Metalgun Slinger is a run-and-gun game for Game Boy Advance.", "id": 49689, "name": "Metalgun Slinger"}, {"genres": [12], "summary": "Matantei Loki Ragnarok: Gensou no Labyrinth is a Role-Playing game, published by J-Wing, which was released in Japan in 2003.", "id": 49698, "name": "Matantei Loki Ragnarok: Gensou no Labyrinth"}, {"summary": "Released in 2005 for the Game Boy Advance. Two \"sequels\" were released.", "id": 49674, "name": "Kunio-Kun Nekketsu Collection"}, {"summary": "Kouchuu Ouja Mushiking: Greatest Champion e no Michi is an action game for the Gameboy Advance. It is based on the Japanese card game Mushi King where players do battle using beetle-like monsters.", "id": 49675, "name": "Konchuu Ouja Mushiking: Greatest Champion e no Michi"}, {"genres": [15], "summary": "Kiss x Kiss: Seirei Gakuen is a Strategy game, developed by Kamui and published by Bandai, which was released in Japan in 2004.", "id": 49640, "name": "Kiss x Kiss: Seirei Gakuen"}, {"genres": [10], "summary": "A kart racing game for the Game Boy Advance involving characters from the Keroro Gunsou anime/manga franchise.", "id": 49646, "name": "Keroro Gunsou Taiketsu! Keroro Cart de Arimasu!!"}, {"genres": [12], "summary": "Monster capture/battle sequel. \n \nLike the previous game, Keitai Denjuu Telefang 2 comes in Power and Speed varieties. In this incarnation, players take control of a young man named Kyou, who is trapped in the Denjuu World when a sinister Denjuu called Diablos destroys all but one of the Antenna Trees, which are the conduit between the human world and the Denjuu World. Kyou must raise his Denjuu partners and prevent Diablos from destroying the last Antenna Tree.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qbdsbuwdyuc7hiji0w9q.jpg", "width": 500, "cloudinary_id": "qbdsbuwdyuc7hiji0w9q", "height": 318}, "id": 27495, "name": "Keitai Denjuu Telefang 2: Speed"}, {"genres": [4], "summary": "K-1 Pocket Grand Prix 2 is a Kickboxing game, published by Konami, it was released only in Japan in 2002. \n \nK-1 Pocket Grand Prix 2 is a Japan only sequel in which you can select from a roster of 17 famous K-1 fighters from different regions and compete to win the grand prix tournament. You can also create a fighter and select a region and selection of punches and kicks for him. The game represents the fighters as over top cartoony sprites in the same style as puzzle fighter does for street fighter characters. The game plays out in sped up 3 minute rounds and does not represent accurate K-1 fighting as fighters can utilize special moves such as flaming kicks. The game borrows features from other 2D fighters such as street fighter allowing you to do charge attacks, parries, super moves and you win the game by depleting your opponents health bar. The game is a little tongue in cheek, when cro-cop wins a fight he does his winning pose in his famous cop uniform.", "id": 49655, "name": "K-1 Pocket Grand Prix 2"}, {"genres": [12], "summary": "GetBackers Dakkanya: Jagan Fuuin! is a Role-Playing game, published by Konami, which was released in Japan in 2003.", "id": 49602, "name": "GetBackers Dakkanya: Jagan Fuuin!"}, {"genres": [12], "summary": "Gegege no Kitarou: Kiki Ippatsu! Youkai Rettou is a Role-Playing game, developed and published by Konami, which was released in Japan in 2003.", "id": 49609, "name": "Gegege no Kitarou: Kiki Ippatsu! Youkai Rettou"}, {"genres": [8], "summary": "In an effort to seek revenge on Shrek, Princess Fiona and all of the fairy tale characters, The Ghost of Lord Farquaad has cast an evil spell! It is now up to you to play as Shrek or Princess Fiona and save your fairy tale friends!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i2cy9ihknahzf6qosvhr.jpg", "width": 1530, "cloudinary_id": "i2cy9ihknahzf6qosvhr", "height": 1370}, "id": 49222, "name": "Shrek: Reekin' Havoc"}, {"genres": [14], "summary": "Backyard Baseball 2007 is the fifth iteration of the best selling youth baseball video game of all time and the only kid's game to hold the coveted Major League Baseball (MLB) and Major League Baseball Players Association (MLBPA) licenses. Backyard Baseball 2007 features a roster full of top MLB pros as kids and includes all 30 MLB teams, uniforms, and logos. In addition, the game's kid-friendly, non-violent format, and high level of diversity makes it especially popular with parents.", "id": 49243, "name": "Backyard Sports: Baseball 2007"}, {"genres": [14], "summary": "Join world renowned pool game designer Archer Maclean at the table in ARCHER MACLEAN'S 3D POOL for the Game Boy Advance. This virtual pool game by Ignition Entertainment puts players up against 20 different computer adversaries or against other players in a true three dimensional environment. The one-player mode features several different options. Players can select to use either coin-op or professional rules. Both American and UK variations of the game are available as well. A rule editor feature allows players to pick and choose which of the different rules will be in effect for the game. A trick-shot table editor gives players a chance to set trick shot options. Pool fans will be pleased at the game's graphics and smoothness, and while some pool games occasionally defy the laws of physics, ARCHER MACLEAN'S 3D POOL is nearly flawless, perfectly simulating every shot. The free camera can be positioned almost anywhere around the table, letting players find that perfect angle to line up their shots. In addition to the one-player mode, a multiplayer option lets players run a tournament for up to eight players. With this multiplayer feature, the many game options, and the amazing graphics, gamers and pool fans alike will be ready to rack 'em and sink 'em with ARCHER MACLEAN'S 3D POOL.", "id": 49315, "name": "Archer Maclean's 3D Pool"}, {"summary": "Explore, soar and save the day in an action-packed epic adventure, based on Universal Studios' motion picture event, Peter Pan. Play as Peter Pan and join Wendy, John, Michael and Tinker Bell on a fantastic journey from London to Neverland. Relive fierce pirate battles, hair-raising danger, narrow escapes and ultimately face off against the notorious Captain Hook. Played from a three-quarter view perspective, Peter Pan can fly, jump, dive, roll, walk, and use his sword to fight enemies. In addition to combat, puzzle solving, and platform jumping, players have to collect special objects for extra lives and bonus points. Developed by Saffire, Peter Pan also features digitized scenes from the movie.", "id": 49317, "name": "Peter Pan: The Motion Picture Event"}, {"genres": [14], "summary": "Tennis no Oji-Sama 2004: Stylish Silver is a Sports game, published by Konami, which was released in Japan in 2004.", "id": 49846, "name": "Tennis no Oji-Sama 2004: Stylish Silver"}, {"genres": [14], "summary": "The Trump is a Miscellaneous game, developed by Access and published by D3Publisher, which was released in Japan in 2003.", "id": 49816, "name": "Simple 2960 Tomodachi Series Vol. 4: The Trump - Minna de Asoberu 12 Shurui no Trump Game"}, {"genres": [9], "summary": "Shin Megami Tensei: Devil Children - Puzzle de Call! is a Puzzle game, published by Atlus, which was released in Japan in 2003.", "id": 49821, "name": "Shin Megami Tensei: Devil Children - Puzzle de Call!"}, {"summary": "A Japanese exclusive fishing game. \n \nScan Hunter: Sennen Kaigyo o Oe! is an action oriented fishing game published by PCCW Japan for Game Boy Advance.", "id": 49788, "name": "Scan Hunter"}, {"genres": [4], "summary": "Comedic beat-'em-up based on the manga. Includes many references to past Konami games, including levels with graphic rips directly from Castlevania, and an entire level of 8-bit NES-style levels, concluding with a set of Yie Ar Kung-Fu bouts.", "id": 49797, "name": "Pyuu to Fuku! Jaguar Byuu to Deru! Megane-Kun"}, {"genres": [31], "summary": "Oshare Princess 5 is an Adventure game, developed and published by Culture Brain, which was released in Japan in 2005.", "id": 49771, "name": "Oshare Princess 5"}, {"genres": [12], "summary": "Onmyou Taisenki: Zeroshiki is a Role-Playing game, developed by Kamui and published by Bandai, which was released in Japan in 2004.", "id": 49735, "name": "Onmyou Taisenki: Zeroshiki"}, {"genres": [12], "summary": "One Piece: Dragon Dream! is a Role-Playing game, developed by M2 and published by Bandai, which was released in Japan in 2005.", "id": 49737, "name": "One Piece: Dragon Dream!"}, {"genres": [9], "summary": "Nonono Puzzle Chai-Rian is a Miscellaneous game, developed by Creatures Inc. and published by Nintendo, which was released in Japan in 2005.", "id": 49747, "name": "Nonono Puzzle Chai-Rian"}, {"genres": [15], "summary": "Kawaii Koinu is a Strategy game, published by MTO, which was released in Japan in 2002.", "id": 49755, "name": "Kawaii Koinu"}, {"genres": [15], "summary": "Mutsu: Water Looper Mutsu is a Simulation game, developed by Alpha Unit and published by Tomy Corporation, which was released in Japan in 2001.", "id": 49709, "name": "Mutsu: Water Looper Mutsu"}, {"genres": [14], "summary": "Morita Shogi Advance is a Miscellaneous game, published by Hudson, which was released in Japan in 2001.", "id": 49712, "name": "Morita Shogi Advance"}, {"genres": [12], "summary": "Monster Maker 4: Flash Card is a Role-Playing game, developed and published by Success, which was released in Japan in 2002.", "id": 49715, "name": "Monster Maker 4: Flash Card"}, {"genres": [12], "summary": "Monster Gate is a Role-Playing game, developed by KCE Studios and published by Konami, which was released in Japan in 2002.", "id": 49717, "name": "Monster Gate"}, {"summary": "Minna no Soft Series: Hyokkori Hyoutan Shima is an Action game, published by MTO, which was released in Japan in 2003.", "id": 49728, "name": "Minna no Soft Series: Hyokkori Hyoutan Shima"}, {"genres": [15], "summary": "Boku no Kabuto - Kuwagata is a Strategy game, published by MTO, which was released in Japan in 2003.", "id": 49731, "name": "Minna no Shiiku Series: Boku no Kabuto - Kuwagata"}, {"summary": "Mermaid Melody Pichi Pichi Pitch Party is a licensed game developed by Konami and published for the Game Boy Advance platform. It is a version of Mario Party using characters, locations, items, and storylines from the anime series of the same name.", "id": 49693, "name": "Mermaid Melody: Pichi Pichi Pitch - Pichi Pichi Party"}, {"summary": "Kurohige no Kurutto Jintori is an Action game, developed by Happy-Smile and published by Tomy Corporation, which was released in Japan in 2002.", "id": 49670, "name": "Kurohige no Kurutto Jintori"}, {"summary": "The third and final Kunio-Kun collection for Game Boy Advance.", "id": 49672, "name": "Kunio-Kun Nekketsu Collection 3"}, {"genres": [9], "summary": "Kotoba no Puzzle Mojipittan Advance is a GBA puzzle game.", "id": 49676, "name": "Kotoba no Puzzle: Mojipittan Advance"}, {"genres": [12], "summary": "Konjiki no Gash Bell!! Makai no Bookmark is an anime-based role-playing adventure.", "id": 49677, "name": "Konjiki no Gash Bell!! The Card Battle for GBA"}, {"genres": [14], "summary": "Goku Mahjong Deluxe: Mirai Senshi 21 is a Miscellaneous game, published by Athena, which was released in Japan in 2001.", "id": 49639, "name": "Goku Mahjong Deluxe: Mirai Senshi 21"}, {"genres": [12], "summary": "Monster capture/battle sequel. \n \nLike the previous game, Keitai Denjuu Telefang 2 comes in Power and Speed varieties. In this incarnation, players take control of a young man named Kyou, who is trapped in the Denjuu World when a sinister Denjuu called Diablos destroys all but one of the Antenna Trees, which are the conduit between the human world and the Denjuu World. Kyou must raise his Denjuu partners and prevent Diablos from destroying the last Antenna Tree.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fkuytplqmhv6vtbxk9y8.jpg", "width": 500, "cloudinary_id": "fkuytplqmhv6vtbxk9y8", "height": 318}, "id": 27494, "name": "Keitai Denjuu Telefang 2: Power"}, {"genres": [15], "summary": "Kami no Kijutsu: Illusion of the Evil Eyes is a Strategy game, developed by KCEJ and published by Konami, which was released in Japan in 2002.", "id": 49651, "name": "Kami no Kijutsu: Illusion of the Evil Eyes"}, {"genres": [14], "summary": "J.League Pocket 2 is a Sports game, developed by KCEO and published by Konami, which was released in Japan in 2002.", "id": 49615, "name": "J.League Pocket 2"}, {"genres": [14], "summary": "Playing Next Generation Tennis is like playing a match and watching it live on TV at the same time, with slow motion replays, umpire announcements, realistic player behaviour and crowd noise all adding that touch of authenticity. With over 10 game modes (including 4 hidden ones), Next Generation Tennis offers a broad palette of pleasures, from the most classic to the most innovative. \n \nThanks to the help of the teams at Roland Garros and the US Open, who provided exact plans of their stadiums, the development team were able to produce faithfully accurate models of the most famous courts at Roland Garros and the US Open, as well as of 6 other courts with different surfaces (grass, synthetic). The players must prove themselves on the authentic courts of these world-famous tournaments, in front of crowds who react to their performance.", "id": 49320, "name": "NGT: Next Generation Tennis"}, {"genres": [14], "summary": "Leave the quarters at home as you take on four themed pinball tables -- Soccer, RoboMech, Retro, and Station -- all brought to life with realistic pinball physics, animated flippers and scoring elements (bumpers, rails, kickers, spinners and more) and digitized music and sound effects.", "id": 49296, "name": "Hardcore Pinball"}, {"summary": "You're never too young for adventure, at least when the Koala Brothers are involved! The Brothers and all their best buddies are waiting for new friends to join them on adventures through the beautiful Australian Outback. Preschoolers can play as all their favorite characters from the Koala Brothers TV show in 10 games packed with between 4 and 20 levels apiece. Kids learn how to handle the easy controls by using graphic-based instructions, so no reading is required! Players can help the brothers find George's lost mail, play tennis with Archie, hop around as Josie the Kangaroo, help Lolly run her ice cream truck, and more!", "id": 49398, "name": "The Koala Brothers: Outback Adventures"}, {"genres": [14], "summary": "Tennis no Oji-Sama 2004: Glorious Gold is a Sports game, published by Konami, which was released in Japan in 2004.", "id": 49847, "name": "Tennis no Oji-Sama 2004: Glorious Gold"}, {"genres": [14], "summary": "Tennis no Oji-Sama: Genius Boys Academy is a Sports game, developed by KCEJ and published by Konami, which was released in Japan in 2002.", "id": 49850, "name": "Tennis no Oji-Sama: Genius Boys Academy"}, {"genres": [31], "summary": "Tantei Gakuen Q: Meitantei Hakimida! is an Adventure game, published by Konami, which was released in Japan in 2003.", "id": 49853, "name": "Tantei Gakuen Q: Meitantei Hakimida!"}, {"genres": [31], "summary": "Tanbi Musou: Meine Liebe is an Adventure game, developed by Mobile 21 and published by Konami, which was released in Japan in 2001.", "id": 49825, "name": "Tanbi Musou: Meine Liebe"}, {"genres": [15], "summary": "A spin-off of the Tales series set in the Tales of Phantasia universe.", "id": 49826, "name": "Tales of the World: Summoner's Lineage"}, {"genres": [9], "summary": "Space Hexcite: Maetel Legend EX is a Puzzle game, published by Jorudan, which was released in Japan in 2001.", "id": 49808, "name": "Space Hexcite: Maetel Legend EX"}, {"summary": "PukuPuku Tennen Kairanban is an Action game, published by Victor Interactive Software, which was released in Japan in 2002.", "id": 49759, "name": "PukuPuku Tennen Kairanban"}, {"genres": [15], "summary": "Ochaken no Bouken Jima: Honwaka Yume no Island is a Simulation game, developed and published by MTO, which was released in Japan in 2005.", "id": 49743, "name": "Ochaken no Bouken Jima: Honwaka Yume no Island"}, {"genres": [15], "summary": "Nobunaga Ibun is a Strategy game, published by Global A, which was released in Japan in 2002.", "id": 49746, "name": "Nobunaga Ibun"}, {"genres": [15], "summary": "Nakayoshi Youchien is a Strategy game, published by TDK Core, which was released in Japan in 2002.", "id": 49753, "name": "Nakayoshi Youchien"}, {"genres": [14], "summary": "Moero!! Jaleco Collection is a Miscellaneous game, published by Jaleco Entertainment, which was released in Japan in 2004.", "id": 49721, "name": "Moero!! Jaleco Collection"}, {"genres": [9], "summary": "Minna no Soft Series: Tetris Advance is a Puzzle game, published by Success, which was released in Japan in 2003.", "id": 49724, "name": "Minna no Soft Series: Tetris Advance"}, {"genres": [31], "summary": "Minami no Umi no Odyssey is an Adventure game, published by Global A, which was released in Japan in 2002.", "id": 49687, "name": "Minami no Umi no Odyssey"}, {"summary": "Mermaid Melody Pichi Pichi Pitch Pichitto Live Start! is a licensed game developed by Konami and published for the Game Boy Advance platform. It takes inspiration from the Dance Dance Revolution series, using music and characters from the anime of the same name. It includes all the songs from the first Mermaid Melody GBA game and adds more from the second half of the TV series.", "id": 49692, "name": "Mermaid Melody: Pichi Pichi Pitch - Pichi Pichitto Live Start!"}, {"genres": [12], "summary": "Mahou Sensei Negima! Private Lesson 2: Ojama Shimasu Parasite de Chu is a Role-Playing game, developed and published by Marvelous Entertainment, which was released in Japan in 2006.", "id": 49704, "name": "Mahou Sensei Negima! Private Lesson 2: Ojama Shimasu Parasite de Chu"}, {"genres": [31], "summary": "Lilliput Oukoku: Lillimoni to Issho-puni! is a Miscellaneous game, developed by Alpha Unit and published by Sega, which was released in Japan in 2004.", "id": 49663, "name": "Lilliput Oukoku: Lillimoni to Issho-puni!"}, {"genres": [31], "summary": "Licca-chan no Oshare Nikki is a Game Boy Advance game based on the Licca-chan fashion doll.", "id": 49664, "name": "Licca-chan no Oshare Nikki"}, {"summary": "Legendz: Yomigaeru Shiren no Shima is an Action game, developed by Bec and published by Bandai, which was released in Japan in 2004.", "id": 49665, "name": "Legendz: Yomigaeru Shiren no Shima"}, {"genres": [12], "name": "Final Fantasy V Advance", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rqnntvxtmjbqzarq5vyh.jpg", "width": 1530, "cloudinary_id": "rqnntvxtmjbqzarq5vyh", "height": 1370}, "summary": "The winds fail. Ships stand still, unable to fill their sails. The world races to its end. Unless a handful of heroes can protect the remaining crystals, the world will fall into ruin. Set off on a grand adventure in the finest version of FINAL FANTASY V ever released!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/mpndzjapioynvemilx0i.jpg", "width": 480, "cloudinary_id": "mpndzjapioynvemilx0i", "height": 319}], "id": 20597}, {"genres": [15], "summary": "The second Super Robot Wars game for the Game Boy Advance, R (Reversal) follows the battles of the \"Round Knights\" as they fight against various mecha anime villains. \n \nSuper Robot Wars R is the second Super Robot Wars game for the Game Boy Advance. The game adds no new mechanics to the franchise, and is identical to its predecessor in many ways, including the usage of \"static\" sprites, much of the anime roster, and general interface. The game does, however, implement many of the changes introduced in Super Robot Wars Alpha and Alpha Gaiden that were not present in Super Robot Wars A. \n \nR removes the original Gundam series, Gundam 0083, Daimos, the classic Getter Robo series and Dragonar, and replaces them with Gundam X and the debuting Gear Fighter Dendoh, Shin vs. Neo Getter Robo, and Nadesico: Prince of Darkness. \n \nThe story follows the Excellence Team, including main character Raul or Fiona Gureden (depending on the player's choice), as they find themselves caught in the middle of the events of Nadesico: Prince of Darkness or Mobile Suit Gundam: Char's Counterattack. After an ambush by a mysterious entity, the Excellence Team is thrown into the past.", "id": 49805, "name": "Super Robot Taisen R"}, {"genres": [12], "summary": "Summon Night Craft Sword Monogatari: Hajimari no Ishi is a Role-Playing game, developed by Flight-Plan and published by Banpresto, which was released in Japan in 2005.", "id": 49810, "name": "Summon Night Craft Sword Monogatari: Hajimari no Ishi"}, {"genres": [9], "summary": "The Simple 2960 Tomodachi Series Vol. 3: The Itsudemo Puzzle - Massugu Soroete Straws is a Puzzle game, developed by BeeWorks and published by D3Publisher, which was released in Japan in 2003.", "id": 49817, "name": "Simple 2960 Tomodachi Series Vol. 3: The Itsudemo Puzzle - Massugu Soroete Straws"}, {"genres": [14], "summary": "The Table Game Collection is a Miscellaneous game, developed by Access and published by D3Publisher, which was released in Japan in 2003.", "id": 49818, "name": "Simple 2960 Tomodachi Series Vol. 1: The Table Game Collection"}, {"genres": [15], "summary": "Shin Megami Tensei: Devil Children - Messiah Riser is a Strategy game, developed by Rocket Company and published by Atlus, which was released in Japan in 2004.", "id": 49774, "name": "Shin Megami Tensei: Devil Children - Messiah Riser"}, {"summary": "Shaman King: Chou Senjiryakketsu 2 is an Action Adventure game, developed by Studio Saizensen and published by King Records, which was released in Japan in 2002.", "id": 49784, "name": "Shaman King: Chou Senjiryakketsu 2"}, {"genres": [12], "summary": "Game Boy Advance version of RPG Maker.", "id": 49795, "name": "RPG Tsukuru Advance"}, {"summary": "Relaxuma na Mainichi is an Action game, developed and published by Imagineer, which was released in Japan in 2005.", "id": 49796, "name": "Relaxuma na Mainichi"}, {"summary": "Puzzle & Tantei Collection is a Miscellaneous game, published by Culture Brain, which was released in Japan in 2003.", "id": 49798, "name": "Puzzle & Tantei Collection"}, {"genres": [31], "summary": "PukuPuku Tennen Kairanban: Koi no Cupid Daisakusen is an Adventure game, published by Marvelous Entertainment, which was released in Japan in 2004.", "id": 49761, "name": "PukuPuku Tennen Kairanban: Koi no Cupid Daisakusen"}, {"genres": [15], "summary": "Oshare Princess 2 + Doubutsu Kyaranabi Uranai is a Miscellaneous game, published by Culture Brain, which was released in Japan in 2002.", "id": 49767, "name": "Oshare Princess 2 + Doubutsu Kyaranabi Uranai"}, {"genres": [9], "summary": "Ochaken Kururin ~ Honwaka Puzzle de Ho~ttoshiyou? is a Simulation game, published by MTO, which was released in Japan in 2004.", "id": 49744, "name": "Ochaken Kururin: Honwaka Puzzle de Ho~ttoshiyou?"}, {"genres": [14], "summary": "Yuushun Rhapsody is a Sports game, developed by TOSE and published by Capcom, which was released in Japan in 2001.", "id": 49752, "name": "Yuushun Rhapsody"}, {"summary": "Mugenborg is an Action game, developed by KCET and published by Konami, which was released in Japan in 2003.", "id": 49710, "name": "Mugenborg"}, {"summary": "Boku no Kabuto Mushi is an Action game, published by MTO, which was released in Japan in 2001.", "id": 49730, "name": "Minna no Shiiku Series 1: Boku no Kabuto Mushi"}, {"genres": [15], "summary": "MiniMoni: Mika no Happy Morning Chatty is a Strategy game, published by Shogakukan, which was released in Japan in 2002.", "id": 49686, "name": "MiniMoni: Mika no Happy Morning Chatty"}, {"summary": "Mermaid Melody Pichi Pichi Pitch is a licensed game developed by Konami and published for the Game Boy Advance platform. It takes inspiration from Dance Dance Revolution using music from the anime series of the same name.", "id": 49691, "name": "Mermaid Melody: Pichi Pichi Pitch"}, {"genres": [31], "summary": "Mail de Cute is an Adventure game, published by Konami, which was released in Japan in 2002.", "id": 49703, "name": "Mail de Cute"}, {"genres": [14], "summary": "Mahjong Keiji is a Miscellaneous game, published by Hudson, which was released in Japan in 2001.", "id": 49706, "name": "Mahjong Keiji"}, {"genres": [12], "summary": "In Mystic Heroes, it's up to you to find hidden Runes that will help you defeat an enemy army. As one of four main characters, you'll battle through Mt. Hoshin, Mt. Senkai, and The City of the Ancients. In each stage, you must equip your Runes strategically in order to defeat powerful enemies and bosses. The more Runes you gather, the more spells you unlock and levels you advance. There are 70 total Runes hidden throughout the single-player missions and multiplayer modes.", "id": 49707, "name": "Magical Houshin"}, {"summary": "Mar Heaven: Knockin' on Heaven's Door is an Action game, developed by Alpha Unit and published by Konami, which was released in Japan in 2005.", "id": 49660, "name": "Mar Heaven: Knockin' on Heaven's Door"}, {"summary": "Players take on the role of each of the four Cheetah Girls – Galleria, Chanel, Aquanetta and Dorinda, plus Galleria’s pedigree pooch, Toto. To prepare for a big gig in Barcelona, players create their own tunes in the music studio, choreograph dance moves and coordinate Cheeta-licious outfits. The game also features mini jobs for each girl -- flip ribs on the grill with Aqua; teach dance with Dorinda; make music with Galleria and Toto at home or coordinate outfits at a high-end fashion store with Chanel.", "id": 49367, "name": "The Cheetah Girls"}, {"genres": [14], "summary": "Tennis no Oji-Sama 2003 is a Sports game, published by Konami, which was released in Japan in 2003.", "id": 49848, "name": "Tennis no Oji-Sama 2003: Passion Red"}, {"genres": [14], "summary": "Tennis no Oji-Sama 2003 is a Sports game, published by Konami, which was released in Japan in 2003.", "id": 49849, "name": "Tennis no Oji-Sama 2003: Cool Blue"}, {"genres": [12], "summary": "Sylvania Families 4: Meguru Kisetsu no Tapestry is a Role-Playing game, published by Epoch, which was released in Japan in 2002.", "id": 49800, "name": "Sylvania Families 4: Meguru Kisetsu no Tapestry"}, {"genres": [14], "summary": "Enhanced remake compilation of the two portable Kawa no Nushi Tsuri games (released as Legend of the River King and Legend of the River King 2 in the west).", "id": 20519, "name": "Kawa no Nushi Tsuri 3 & 4"}, {"genres": [13], "summary": "Hamsterz Life 2 features more than 90 different hamsters for hours of fun with your Petz! Each hamster will get attached to you slowly, as you take care of it and play with it. Create and customize your hamsters' cages, play lots of mini-games and let them meet their fellow friends. Thanks to the Nintendo wireless system, you will be able to see your friends' pets and even trade your own hamsters!", "id": 49474, "name": "Petz: Hamsterz Life 2"}, {"summary": "Petz Vet introduces players to life as a veterinarian, diagnosing and treating 35 different medical cases. Being a vet is always an interesting occupation, as you quickly learn while taking care of a dog with a broken leg, a bunny with a stomach ache, a cat with asthma, a sunburned frog, a bird with - who knows? Do you know what happens when a dog accidentally swallows aspirin? You'll learn, when you assume the role of veterinarian in this busy animal hospital. In addition to taking care of the animals' medical needs, you can also perform some basic caretaking functions, such as washing and grooming your pet.", "id": 49459, "name": "Petz Vet"}, {"genres": [9], "summary": "M&M's Blast! for Game Boy Advance reunites players with those lovable candy-coated M&M characters--Red, Blue, Green, and Yellow--in a brand-new adventure. Players complete a number of game challenges within a variety of board-game-style levels.", "id": 49330, "name": "M&M's Blast!"}, {"genres": [14], "summary": "A collection of six minigame challenges -- Shooting (shoot down clay pidgeons), Archery (score points with 10 arrow shots), Javelin (throw for the longest distance), Football (kick fieldgoals for completion and accuracy), Pole Vault (the best of three attempts are judged for height and finesse), and Hammer Throw (toss the hammer for distance).", "id": 49384, "name": "Stadium Games"}, {"summary": "Princess Natasha: Student, Secret Agent, Princess Natasha is a Zoravian princess and the only daughter of King Carl and Queen Lena. She's also a secret agent! She's been sent to Illinois to stop her evil Uncle Lubek from stealing the Zoravian throne. She pretends to be just an ordinary exchange student and can't tell any of her friends that she's actually a princess. That would spoil the whole 'secret' agent thing-like they'd believe her anyway!", "id": 49432, "name": "Princess Natasha: Student Secret Agent"}, {"genres": [12], "summary": "The third in the \"Narikiri Dungeon\" series of Namco's \"Tales of\" franchise. It includes a number of crossovers with previous Tales games, including Tales of Symphonia and and Tales of Eternia.", "id": 49827, "name": "Tales of the World: Narikiri Dungeon 3"}, {"genres": [12], "summary": "Medarot Navi: Kuwagata Version is a Role-Playing game, developed by Natsume and published by Imagineer, which was released in Japan in 2001.", "id": 49696, "name": "Medarot Navi: Kuwagata Version"}, {"genres": [14], "summary": "Card Party is a Japanese card game for the Game Boy Advance. \n \nCard Party is a card game developed by NDCube and published by MediaKite for the Game Boy Advance platform. Card Party was only released in Japan.", "id": 49520, "name": "Card Party"}, {"genres": [14], "summary": "Pinball Advance features the Tarantula, Jailbreak and Daredevil pinball tables, all fully rendered in shiny 3D and each with their own exclusive single and multiball game modes. The Tarantula table will allow budding pinball wizards to venture into the spider?s lair and fight their way onto the scoreboard overcoming the terror of the table. In Jailbreak, players will have to prove their innocence to the judge or escape past the prison guards. Finally, The Daredevil will let players take their chances with the Wheel of Death and The Loop of Fire.", "id": 49316, "name": "Pinball Advance"}, {"genres": [31], "summary": "Kong: The 8th Wonder of the World is an action/adventure video game developed by Ubisoft for the Nintendo Game Boy Advance. In Europe, it is known as King Kong: The Official Game of the Movie. Due to the limited technology the Game Boy Advance has, King Kong: The 8th Wonder of the World is very different from the home console versions of the game. In this game, players switch between various roles - one being the movie exhibition visiting Skull Island to do filming which comprises actress Ann Darrow, director Carl Denham and scriptwriter Jack Driscoll, and the 25 ft gorilla and king of Skull Island, King Kong. While the overhead human section focuses on puzzle-solving and adventuring elements, Kong sections are combat-oriented side-scrollers.", "id": 49397, "name": "Kong: The 8th Wonder of the World"}, {"summary": "Slot! Pro 2 Advance: Go Go Juggler & New Tairyou is a Miscellaneous game, published by Nippon Telenet, which was released in Japan in 2002.", "id": 49814, "name": "Slot! Pro 2 Advance: Go Go Juggler & New Tairyou"}, {"genres": [12], "summary": "Shingata Medarot is a remake of the first Medarot and was the last game in the series until its DS entry years later. Its art style is a huge departure from its predecessors'.", "id": 49822, "name": "Shingata Medarot: Kuwagata Version"}, {"genres": [12], "summary": "Based on the Magi Nation collectible trading card game. \n \nMagi Nation is a collectible card game developed and published by Interactive Imagination for the Gameboy Advance.", "id": 49708, "name": "Magi Nation"}, {"genres": [14], "summary": "Isseki Hacchou: Kore 1-pon de 8 Shurui! is a Miscellaneous game, published by Konami, which was released in Japan in 2002.", "id": 49617, "name": "Isseki Hacchou: Kore 1-pon de 8 Shurui!"}, {"genres": [14], "summary": "Gachinko Pro Yakyuu is a Sports game, developed and published by Now Production, which was released in Japan in 2002.", "id": 49567, "name": "Gachinko Pro Yakyuu"}, {"genres": [13], "id": 49469, "name": "Alexandra Ledermann"}, {"genres": [13], "summary": "Tend to the everyday needs of your puppy and kitty guests. Rid them of those pesky fleas. Groom, bathe and feed your pet guests to keep them happy. Pamper your VIP guests to earn extra money in order to move on to bigger and better 5 star resorts!", "id": 49473, "name": "Puppy Luv: Spa and Resort"}, {"summary": "In Matchbox Cross Town Heroes, young game players will take the wheel of popular Matchbox vehicles like the Fire Crusher or Rescue Net Police Car in three extensive worlds. Players can drive and explore amazing interactive environments to search for new emergencies. Every time a new world is visited, the location of the emergency tasks will be different, allowing for endless replay. Each world will also feature bonus mini games and puzzles along with more than 50 different characters, animals and creatures. Upon completing emergency tasks, players will earn hero awards allowing them to unlock new vehicles and earn printable certificates of heroic achievement.", "id": 49329, "name": "Matchbox Cross Town Heroes"}, {"summary": "Action game based on the animated movie franchise. Take control of five popular and loved young dinosaurs from the The Land Before Time movies and Venture through NICE spectacular areas, each with its own unique game play and environments, in order to find the young T-rex Chomper. Players have to use the different strengths and abilities of the individual dinosaurs to help the others overcome various obstacles and dangers. The game features advanced graphics and sound over its predecessor and makes the world of the dinosaurs come alive on a handheld like never before. Easy and intuitive tutorials makes the game available for players of all ages.", "id": 49332, "name": "The Land Before Time: Into the Mysterious Beyond"}, {"genres": [14], "summary": "Premier Action Soccer is a Sports game, developed by Independent Arts and published by East Entertainment Media, which was released in 2006.", "id": 49356, "name": "Premier Action Soccer"}, {"summary": "Portable fighting fun with Ultraman and company.", "id": 49799, "name": "Taiketsu! Ultra Hero"}, {"summary": "Sweet Cookie Pie is an Action game, published by Culture Brain, which was released in Japan in 2001.", "id": 49803, "name": "Sweet Cookie Pie"}, {"genres": [14], "summary": "Saibara Rieko no Dendou Mahjong is a Miscellaneous game, developed by Warashi and published by Media Rings, which was released in Japan in 2001.", "id": 49794, "name": "Saibara Rieko no Dendou Mahjong"}, {"genres": [31], "summary": "Boku no Kuwagata is an Adventure game, published by MTO, which was released in Japan in 2001.", "id": 49732, "name": "Minna no Shiiku Series 2: Boku no Kuwagata"}, {"summary": "Hachiemon is an Action game, developed by Natsume and published by Namco, which was released in Japan in 2003.", "id": 49595, "name": "Hachiemon"}, {"genres": [12, 15], "summary": "A millennium ago, on the continent of Blaine, humans and dragons fought. Humans, unable to match the power of the dragons, gathered together and saved themselves from the brink of extinction by relocating to Solum. \n \nOn this new continent, the people were divided--and over time, each territory formed its own way of life, choosing how its people would live and what ideals they would carry. \n \nHowever, this all changes when Magnus, an empire with the greatest military on the continent, begins to invade the other territories. Though their campaign is time-consuming, they are successful in every way imaginable, quickly dominating Alicia to the north and Atheya to the east. \n \nBut across the continent, there are people ready to fight back to their dying breath. One of them is Siegfried, a former Knight Commander who has been in hiding ever since an injury he received from ten years ago. With his pain serving as a reminder of the vow he made that fated day, he and his son, Shon, take up arms to gather allies and do whatever it takes to stop Magnus from dominating the continent. \n \n...Because some promises, are just worth dying for.", "id": 49462, "name": "The Last Promise"}, {"summary": "Groove Adventure Rave: Hikari to Yami no Daikessen is an Action game, published by Konami, which was released in Japan in 2002.", "id": 49597, "name": "Groove Adventure Rave: Hikari to Yami no Daikessen"}, {"genres": [14], "summary": "The latest installment in the Family Tennis series.", "id": 49581, "name": "Family Tennis Advance"}, {"genres": [15], "summary": "Gourmet Kitchen: Suteki na Obentou is a Strategy game, published by MTO, which was released in Japan in 2003.", "id": 49544, "name": "Gourmet Kitchen: Suteki na Obentou"}, {"genres": [10], "summary": "Trick Star is a Racing game, developed by Tantalus Interactive and published by Oxygen Interactive, which was released in Europe in 2006.", "id": 49456, "name": "Trick Star"}, {"genres": [8], "summary": "Dr. Eggman is up to his old tricks! \n \nJoin Sonic, Tails, Knuckles, and their new friend, Cream the Rabbit, as they take off on a blazingly fast quest to thwart Dr. Eggman's nefarious scheme. Dash through space age metal labyrinths and other new locales as Sonic, Tails, Knuckles and Cream \n \n-Unlock special features and stages by collecting Chaos Emeralds and Special Rings \n-4 players can compete on one Game Pak \n-Visit the new Chao Garden and connect to Sonic Adventure 2: Battle on the Nintendo GameCube", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ygtkbnthuxupsq0rl6o4.jpg", "width": 256, "cloudinary_id": "ygtkbnthuxupsq0rl6o4", "height": 256}, "id": 6598, "name": "Sonic Advance 2"}, {"genres": [8], "name": "Sonic Advance", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gfrwra7xc7hdwr4q7ti3.jpg", "width": 250, "cloudinary_id": "gfrwra7xc7hdwr4q7ti3", "height": 255}, "summary": "Sonic Advance is notable for being the first Sonic game released on a Nintendo console, despite both Sega and Nintendo being well-known rivals on the console market throught the 1990s. \n \nSonic Advance features four playable characters and marks the first playable appearance of Amy Rose on a 2D title. The game borrows elements from the original Sonic the Hedgehog titles for the Sega Genesis, but with the post-Dreamcast artstyle for the characters which was introduced in Sonic Adventure. The game also includes multiplayer features and mini-games.", "storyline": "The game follows Sonic and his friends as they travel through various zones in order to stop Dr. Eggman from taking over South Island. The game features four playable characters; Sonic, Tails, Knuckles and Amy. Each character has the same moveset as they did in Sonic the Hedgehog 3 and Sonic & Knuckles, with the addition of a melee attack. Each character has a special ability, such as Sonic's splice shield, Tails' flight and Knuckles' gliding and climbing abilities. In her playable 2D debut, Amy cannot perform the Spin Dash or get into ball form when jumping like the others, and must rely on her Piko Piko Hammer to defend herself, making her unique amongst the characters. Grind rails first introduced in Sonic Adventure 2 also make their first 2D appearance. Sonic and Tails can also be used at the same time during the story by inputting a cheat code at the character selection screen. When playing as both characters, the gameplay is similar to that of Sonic the Hedgehog 2: The player can only control Sonic and a CPU-controlled Tails follows him.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jgdzydpdyevg9nyt02hd.jpg", "width": 600, "cloudinary_id": "jgdzydpdyevg9nyt02hd", "height": 399}], "id": 6283}, {"genres": [14, 30], "summary": "It's time to get the party started right with \"Sonic Pinball Party\" for the Game Boy Advance. Sonic The Hedgehog returns to the Game Boy Advance, with the ultimate handheld pinball experience, delivering fresh pinball boards filled with SONICTEAM characters and a huge assortment of multiplayer party games. With SONICTEAM characters from \"Sonic The Hedgehog,\" \"Samba de Amigo\" and \"Nights,\" \"Sonic Pinball Party\" challenges players to shoot, tilt, and flip their way through a slew of pinball boards, lightning fast mini-games and party games that promise to give gamers the pinball fix they've been craving!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dr2b4a0x9frfdaynrbq6.jpg", "width": 250, "cloudinary_id": "dr2b4a0x9frfdaynrbq6", "height": 249}, "id": 6601, "name": "Sonic Pinball Party"}, {"genres": [4, 31], "summary": "Sonic and pals are gearing up for some brawling action! \n \nFight as one of nine characters including Sonic, Tails and Shadow! \nKnock 'em dead with special attacks and team-based assaults. \nCreate and train fighting partner for 2-on-2 battles. \nDuke it out with your friends in 4 player battles. \n \nIt is the second fighting game in the Sonic the Hedgehog series, the first being Sonic the Fighters. It is also the first Sonic fighting game to be on a handheld.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kx0dytclsdsxuukw97o7.jpg", "width": 256, "cloudinary_id": "kx0dytclsdsxuukw97o7", "height": 257}, "id": 6600, "name": "Sonic Battle"}, {"genres": [24], "name": "Tom Clancy's Splinter Cell", "videos": [{"video_id": "VlVxOhiKe-s", "name": "Splinter Cell Intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sirlrkxjkqerudsevbk1.jpg", "width": 640, "cloudinary_id": "sirlrkxjkqerudsevbk1", "height": 817}, "summary": "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! \n \nYou are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyber terrorism and international tensions are about to explode into WWIII.", "storyline": "In April 2004, the President of Georgia is assassinated, allowing Georgian billionaire Kombayn Nikoladze to seize power with a bloodless coup d'état. In August 2004, former U.S. Navy SEAL officer and Gulf War veteran Sam Fisher is recruited by the National Security Agency to work within its newly formed division, \"Third Echelon.\" Working with his old friend Irving Lambert, Fisher is introduced to technical expert Anna \"Grim\" Grimsdóttír, and field runner Vernon Wilkes Jr. \n \nIn October 2004, Fisher is dispatched to Tbilisi, Georgia to investigate the disappearance of two CIA officers. Fisher attempts to meet an informant, Thomas Gurgenidze, only to find him dying in a burning building. Gurgenidze warns that one agent's transmission mentioned proof that could cause a war. Finding the agents' corpses in a police morgue, Fisher learns that a former Spetsnaz agent, Vyacheslav Grinko, removed their subdermal tracking implants. Tracking Grinko's license plate number using CCTV, Third Echelon tracks him to the Georgian Ministry of Defense. \n \nFisher arrives at the Ministry, and records a meeting between Grinko and Canadian hacker Phillip Masse, through which he learns that Nikoladze is conducting an illegal operation in Azerbaijan. Fisher hacks Nikoladze's computer, and learns Nikoladze has been waging an ethnic cleansing campaign across Azerbaijan, by deploying Georgian commandos. In retaliation, NATO forces enter Azerbaijan, prompting Nikoladze to go underground. \n \nThird Echelon learns that Georgian soldiers stationed on a Caspian oil rig have been exchanging data with the Georgian Presidential Palace. Fisher infiltrates the rig during the middle of a NATO airstrike to apprehend a local technician, Lejava, and retrieve his laptop containing the rig's computer data. After interrogating the technician, Fisher learns that the data contains a file on \"The Ark\", Fisher recovers his laptop and encryption key and extracts. \n \nExamining Lejava's laptop, Grim reveals that the intel could have come from a CIA mole. Lambert then reveals that North America has just been hit by a massive cyber warfare attack, directed primarily against military targets. In a broadcast, Nikoladze claims responsibility for the attack and officially declares war on the United States and its allies. Fisher infiltrates the CIA headquarters and accesses the CIA computer mainframe, allowing Grim to trace the data leak to the computer of Mitchell Dougherty. Captured for interrogation, Dougherty claims ignorance of the leak, but the NSA learns that his obsessive–compulsive disorder caused him to back up data on an insecure laptop, which was exploited by a network owned by Kalinatek, Inc. \n \nGeorgia-hired mafiosos attempt to remove all traces of Nikoladze from the Kalinatek offices by destroying the building and murdering the staff. Intercepting a 911 call from a technician named Ivan, Fisher is deployed to the building and retrieves Ivan's encryption key while the FBI rescues Ivan. Fisher extracts with the help of Wilkes, who is mortally wounded in the process and later dies. Using the encryption key, the NSA discovers Nikoladze has been using a network of unconventional relays to communicate with Georgian military cells. The NSA traces the full relay network to the Chinese Embassy in Yangon, Myanmar. Worried Chinese support could cause World War III, Fisher sneaks into the embassy and eavesdrops on a conversation between Nikoladze and General Kong Feirong, and learns they are working together. \n \nFisher learns that captured U.S. Army soldiers and high-ranking Chinese officials are in a local slaughterhouse, so he delays interrogating Feirong to save the hostages, who are scheduled to be executed on a live broadcast. Fisher meets with a Chinese official among the hostages, and learns that Feirong is part of a rogue collective not backed by the Chinese government. Fisher is detected, and in a firefight, Fisher kills Grinko. Returning to the embassy, Fisher grabs a drunken Feirong before he can commit suicide, and forces him to share the information stored on his computer; the information reveals Nikoladze has fled back to Georgia, where he is trying to activate a suitcase nuke known as \"The Ark\". \n \nInfiltrating the Georgian Presidential Palace containing Nikoladze and new de facto Georgian president Varlam Cristavi, Fisher attempts to recover the key to the Ark, which has been placed somewhere in the United States. Fisher corners Nikoladze, who bargains to give the Ark key in exchange for safe passage out of Georgia; before Fisher can recover it, Cristavi soldiers take Nikoladze and the Ark key elsewhere. About to be executed, Fisher escapes when Lambert causes a brief blackout. Discovering Nikoladze is offering the Ark's location for protection, Fisher assassinates Nikoladze. Discovering the Ark, the U.S. Army evacuates an apartment complex in Hope Gate, Maryland on claims of a gas leak, and secretly recovers the Ark. \n \nDespite World War III being averted, Nikoladze's corpse sparks international backlash due to the suspicious circumstances around his death. Watching the Presidential broadcast on the crisis, Fisher then receives a secure phone call from Lambert for another assignment. \n \n[from Wikipedia.org]", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zylmk1vqs5naozsmj2tq.jpg", "width": 800, "cloudinary_id": "zylmk1vqs5naozsmj2tq", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jlrcmjkzzfe4qzmizvc7.jpg", "width": 800, "cloudinary_id": "jlrcmjkzzfe4qzmizvc7", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xlbfh15qbodwa4rhopua.jpg", "width": 1024, "cloudinary_id": "xlbfh15qbodwa4rhopua", "height": 768}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/osk9fgnqbkmvpy3uzdki.jpg", "width": 1024, "cloudinary_id": "osk9fgnqbkmvpy3uzdki", "height": 819}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lyloewxlqoe8vlvk3qvl.jpg", "width": 800, "cloudinary_id": "lyloewxlqoe8vlvk3qvl", "height": 600}], "id": 910}, {"genres": [8], "summary": "JOIN THE QUEST TO DEFEAT THE EVIL DR. EGGMAN! \n \n*Team up with any one of 5 different characters \n*Pull off different combinations of attack moves \n*Experience changes in game play depending on a player's partner selection \n*Multiplayer option allows up to 4 players (Game Link)", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wenlq1b37e2jhfwf0lwc.jpg", "width": 256, "cloudinary_id": "wenlq1b37e2jhfwf0lwc", "height": 256}, "id": 6599, "name": "Sonic Advance 3"}, {"genres": [4, 25], "name": "International Karate +", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mx09xpsdg8vqezbvvryx.jpg", "width": 1233, "cloudinary_id": "mx09xpsdg8vqezbvvryx", "height": 1563}, "summary": "Call it a sequel... And you'll land up flat on your back. \n \nThey called International Karate \"the greatest Karate beat' em up yet\" (Commodore User). And who are we to argue? But Archer Maclean has come up with a stunner: A third fighter. An amazing animated background. New moves (including double head-kick and a spectacular backflip). Re-mixed music by Rob Hubbard. And Balls!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ifdmd4xwsonztjcawkoz.jpg", "width": 320, "cloudinary_id": "ifdmd4xwsonztjcawkoz", "height": 256}], "id": 8397}]