[{"genres": [4, 14], "name": "3 Count Bout", "videos": [{"video_id": "AJ3gLOwUmB8", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jwsnoqubcas9pvciapal.jpg", "width": 632, "cloudinary_id": "jwsnoqubcas9pvciapal", "height": 805}, "summary": "3 Count Bout is a one-on-one fighting game. Choose from ten wrestlers who have their own power attacks. There are ten rounds in the game, and each one of them has you fighting other wrestlers that are much tougher than the previous ones. You defeat each one by biting, kicking, and performing other moves to the point where their damage meter is empty. But just because it is empty doesn't mean that you win. You have to pin him for the infamous-three count. Also features competitive play and tag match battles. \n\n3 Count Bout by SNK Corporation attempts to take you into the world of professional wrestling by giving you control of one of many different wrestlers as you fight both in the ring and in the seedy underworld in your quest to become an accomplished wrestling champion. Choose from one of ten different characters, each with his own strengths and weaknesses, and employ your wrestling moves using a combination of three buttons. There are also a number of hidden moves and combinations which can be unlocked for even greater variety in the gameplay. When you have your opponent on the mat, keep him there until the count of three and you've won the match. In two-player mode, you can either take on your opponent in a match or wrestle tag team. This game uses the Neo-Geo MVS cartridge system.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/i8bmga2edxbl0pcdvpl0.jpg", "width": 304, "cloudinary_id": "i8bmga2edxbl0pcdvpl0", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hqbvtfgcaokvukymaamc.jpg", "width": 320, "cloudinary_id": "hqbvtfgcaokvukymaamc", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cvj8l06kt7ouvesmtvw6.jpg", "width": 304, "cloudinary_id": "cvj8l06kt7ouvesmtvw6", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bnintbimqzc1xusvsxfq.jpg", "width": 320, "cloudinary_id": "bnintbimqzc1xusvsxfq", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iyekdlidjhr6wwupqtui.jpg", "width": 304, "cloudinary_id": "iyekdlidjhr6wwupqtui", "height": 224}], "id": 6734}, {"genres": [4], "summary": "This fighting game began the story of the Sakazaki family and Robert Garcia. Yuri Sakazaki has been abducted by Mr. Big to punish her father, Takuma, and her brother, Ryo. To rescue her, Ryo and Robert must take on numerous enemies around South Town, eventually reaching the mysterious Mr. Karate. The passion of the game’s creators is evident in the unique game play elements introduced. These include an energy gauge that is depleted every time a fighter uses a special maneuver, Desperation Attacks that are usable only when a fighter’s health is low, and camera zooming that adjusts on the fly as fighters move around the stage. All these features ensure that players use strategy and tactics, rather than simply mash buttons. Adding to the mix are little touches such as characters showing cuts when they are injured and voice-over samples during cut scenes. Can you perfect the art of fighting and save Yuri?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bxzyqmxpmcorep74ke4y.jpg", "width": 714, "cloudinary_id": "bxzyqmxpmcorep74ke4y", "height": 1010}, "id": 4514, "name": "Art of Fighting"}, {"genres": [4], "summary": "In this third and final entry in the Art of Fighting series, the story shifts from Ryo Sakazaki to his best friend and rival, Robert Garcia, as he ventures into Mexico to try and locate Freia Lawrence, a childhood friend, who asked for his help. However, he leaves without the consent of The Garcia Foundation, which sends an agent named Karman Cole to get him back. But not everything is as simple as it looks... because Robert is not the only one looking for Freia. \n \nArt of Fighting 3: The Path of The Warrior features ten playable characters with different fighting styles, a completely new fighting system based on joystick and button combinations, and incredibly detailed graphics and animation.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ihj78jbtzuozs6m7kq2y.jpg", "width": 946, "cloudinary_id": "ihj78jbtzuozs6m7kq2y", "height": 938}, "id": 6566, "name": "Art of Fighting 3: The Path of The Warrior"}, {"genres": [4], "summary": "The second installment in the AoF series added the \"rage gauge\"; similar to the \"spirit system\" of its predecessor, it limited the use and effectiveness of special attacks. \nThe game's story is set a year after the original. Geese Howard, a rising star in South Town's criminal underworld, calls fighters to the city for a new tournament, \"The King of Fighters.\" Howard was the final boss and series villain of SNK's other fighting game franchise Fatal Fury (though he is a secret boss in this game), whose story took place over a decade after the events of Art of Fighting. \nArt of Fighting 2 was the only time Yuri Sakazaki was a playable character in the series. It also marked the only time that she donned her trademark outfit, which was made famous in The King of Fighters series. This game also marks the debut of Takuma Sakazaki without his Mr. Karate persona, as well as Eiji Kisaragi, who both appear in the King of Fighters series. Ryuhaku Todo, the first boss in the original AOF, is the only character dropped; all characters are playable from the beginning. The final boss is always Mr. Big, though as mentioned earlier, an extra match will be played against Geese Howard if the player unlocks him through good performance. \nThis game is also notorious for its difficulty, with it being referred in many fighting circles as having some of the toughest opponent AI in a fighting game.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vjcrkdgtgczvf0myarnz.jpg", "width": 635, "cloudinary_id": "vjcrkdgtgczvf0myarnz", "height": 820}, "id": 6556, "name": "Art of Fighting 2"}, {"genres": [4], "name": "King of the Monsters", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cpnv3vukqkjmkg4qckve.jpg", "width": 600, "cloudinary_id": "cpnv3vukqkjmkg4qckve", "height": 775}, "summary": "Players get to choose any one of six monsters (four in the 16-bit ports) for battle, and two players can join forces to fight the monsters together. Battles end when one of the monsters is pinned for a three count or if time expires (in which case the player loses).\n\nThe game consists of 12 total levels: the player first must defeat all six monsters, with the last monster being oneself, but in a different palette. Then the player must defeat the six monsters again, in the same order, but this time in different cities", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/sxg3sndw5wlakvwol5h5.jpg", "width": 304, "cloudinary_id": "sxg3sndw5wlakvwol5h5", "height": 224}], "id": 6800}, {"genres": [4], "summary": "The game brings back the team play composed by three characters each that was a tradition in previous games. The game has also several important changes in the gameplay, like the \"Free Cancel System\" or \"Max Mode System\", the \"Quick Emergency Evasion\" and \"Quick MAX Mode Activation\", aside from the countless changes in each character's special moves and their properties.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jckadf3qkh3dbfhkgrje.jpg", "width": 202, "cloudinary_id": "jckadf3qkh3dbfhkgrje", "height": 304}, "id": 5884, "name": "The King of Fighters 2002"}, {"genres": [5, 8], "name": "Metal Slug 3", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/n94aylowxepr3ktkn4kn.jpg", "width": 850, "cloudinary_id": "n94aylowxepr3ktkn4kn", "height": 1099}, "summary": "“METAL SLUG 3”, the masterpiece in SNK’s emblematic 2D run & gun action shooting game series, still continues to fascinate millions of fans worldwide to this day for its intricate dot-pixel graphics, and simple and intuitive game controls! The most highly praised title in the series among Metal Slug fans for its refined balance and game volume, heads out to the Steam gaming platform! MAIN FEATURES・ARCADE MODE (MAIN MISSION): \nPlay the arcade version of “METAL SLUG 3” from the beginning, and explore 5 immense challenging stages featuring multiple branching paths to explore exciting new areas! Make your way through the deluge of fire and fight off gigantic boss characters!\n\n・MISSION MODE (STAGE SELECT):\nPlay your favorite stages at will and train alone or with a brother-in-arms on the missions you have unlocked so far!\n\n・ONLINE MISSION (ONLINE MULTIPLAYER):\nConnect to Steam and clear missions with friends far away via Online Co-Op Play.\nFind a fellow countryman or foreign ally and let the mission begin!\n\n・SETTINGS:\nConfigure display, control, and language settings.\n\n・GALLERY:\nView original illustrations of the game that you've unlocked.\n\n・LEADERBOARDS\nCheck your current rank and score in“METAL SLUG 3” at any time,\nand compete with other players to become the world's No. 1 soldier!\n\n** WILL NOT RUN ON XP **", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jpxtdpbye8hlhw7zrvfu.jpg", "width": 600, "cloudinary_id": "jpxtdpbye8hlhw7zrvfu", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ux7j5o2be0oxm5wpduxi.jpg", "width": 600, "cloudinary_id": "ux7j5o2be0oxm5wpduxi", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ov4yyqvsajzmzeogplay.jpg", "width": 600, "cloudinary_id": "ov4yyqvsajzmzeogplay", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dv6kodas2qnol0ehbqvm.jpg", "width": 600, "cloudinary_id": "dv6kodas2qnol0ehbqvm", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vtqfi8tunxg90yrzriid.jpg", "width": 480, "cloudinary_id": "vtqfi8tunxg90yrzriid", "height": 270}], "id": 1408}, {"genres": [5, 8, 31], "name": "Metal Slug 5", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r2qrjblqzrwaclp6cvu5.jpg", "width": 408, "cloudinary_id": "r2qrjblqzrwaclp6cvu5", "height": 613}, "summary": "A special disc that contains deep and intricate secrets about the Metal Slug project is stolen by a mysterious group called the Ptolemaic Army, whose specialty lies from within archaeological excavation and espionage. Marco and Tarma of the Peregrine Falcon Strike Force follow in hot pursuit against the group and in the process are joined by Eri and Fio of SPARROWS. Together once more, the quartet investigate the shrouded objective of the Ptolemaic Army.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/egzrn2cjkud6djx1ixum.jpg", "width": 1440, "cloudinary_id": "egzrn2cjkud6djx1ixum", "height": 1061}], "id": 1410}, {"genres": [5, 31], "name": "Metal Slug 4", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gfbbd4zdiyuaoxoi6lss.jpg", "width": 392, "cloudinary_id": "gfbbd4zdiyuaoxoi6lss", "height": 609}, "summary": "One year after the events of Metal Slug 3, the world is trembling under the new threat of a mysterious but deadly cyber virus that threatens to attack and destroy any nation's military computer system. With Tarma and Eri unable to help due to their own assignments in the matter, Marco and Fio are called in to investigate the situation and are joined by two newcomers, Nadia and Trevor. In their investigation, the group discovers that a terrorist organization known as Amadeus is behind the nefarious plot and that they head into battle against Amadeus' forces, hoping to destroy the cyber virus before it gets the chance to wipe out the entire world's military computer system", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yjn4xuiiu0tpluis68sz.jpg", "width": 1000, "cloudinary_id": "yjn4xuiiu0tpluis68sz", "height": 775}], "id": 1409}, {"genres": [4], "name": "Samurai Shodown V", "videos": [{"video_id": "OT-KVPoVtOk", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/scgmlrvxhvw1ksooszum.jpg", "width": 225, "cloudinary_id": "scgmlrvxhvw1ksooszum", "height": 335}, "summary": "Samurai Shodown V brings back the classic side-scrolling action with a completely new storyline, new characters and new moves. A samurai's quest to prove himself against the Shogun leads to a gathering of the world's greatest warriors to compete for the right to be named the greatest.", "id": 6026}, {"genres": [4], "name": "SNK vs. Capcom: SVC Chaos", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kcob0mx49bprsczavqqg.jpg", "width": 225, "cloudinary_id": "kcob0mx49bprsczavqqg", "height": 333}, "summary": "SNK vs. Capcom: SVC Chaos primarily utilizes the command system of The King of Fighters series, incorporating light/strong kicks, punches, cancels and charging attacks. Unlike its predecessor, Capcom vs. SNK 2, this game lacks both air guards and a \"groove system\", instead focusing on quicker gameplay. Characters are provided with a basic 3-level bar system for executing super-special attacks with basic filling options attributed to strikes and damage. Additionally, the sprites from the various series received new models and some special effects were changed in the command lists (for example, the player cannot increase the damage of the Zujou Sashi used by Choi Bounge by tapping the buttons anymore).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/qolvbuf6zzm8fsrclwoz.jpg", "width": 1440, "cloudinary_id": "qolvbuf6zzm8fsrclwoz", "height": 1008}], "id": 6184}, {"genres": [4], "name": "Fatal Fury Special", "videos": [{"video_id": "AlZ1q2Gddsc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cwc6ncgkxaftroc2rb1w.jpg", "width": 250, "cloudinary_id": "cwc6ncgkxaftroc2rb1w", "height": 335}, "summary": "The GRANDMOTHER of all battles! 15 of the FATAL FURY series' top stars gather in the match of the millenium! Use the resurrected Geese Howard and Wolfgang Krauser in a dazzling arena! All you have ever wanted in a fighting game is here in FATAL FURY SPECIAL!", "id": 5385}, {"genres": [4], "summary": "After Geese Howard's death in the original Fatal Fury, a mysterious nobleman becomes the sponsor of the new \"King of Fighters\" tournament. This time, the tournament is held worldwide with fighters around the globe competing. As the single player mode progresses, the mysterious challenger begins defeating the participants from the previous Fatal Fury game, searching for the man responsible for defeating Geese.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iudxvmedr6u16twdzfvc.jpg", "width": 255, "cloudinary_id": "iudxvmedr6u16twdzfvc", "height": 327}, "id": 4435, "name": "Fatal Fury 2"}, {"genres": [4], "summary": "In early Japan, a man named Shiro Tokisada Amakusa preaches a heretic religion. Little does anyone know that Amakusa is really a servant of the evil Ambrosia, who took over Amakusa's body. Ambrosia wishes to shroud the world in darkness. Now, choose between 12 warriors (and 3 bonus characters) to fight for the honor of destroying Amakusa, and fulfilling a mission.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dyeld0ai8x2hskftzdtk.jpg", "width": 1612, "cloudinary_id": "dyeld0ai8x2hskftzdtk", "height": 3083}, "id": 4260, "name": "Samurai Shodown"}, {"genres": [4, 12, 13, 15, 25], "name": "Sengoku", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wptw6deizpes0gxh70xg.jpg", "width": 230, "cloudinary_id": "wptw6deizpes0gxh70xg", "height": 293}, "summary": "Use your power as a Feudal Lord to unite the land of the Rising Sun under your iron fist.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/g2ukftw81cw6f6sjm9wo.jpg", "width": 1920, "cloudinary_id": "g2ukftw81cw6f6sjm9wo", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jxi5nc5fph8aru5wc2tn.jpg", "width": 1920, "cloudinary_id": "jxi5nc5fph8aru5wc2tn", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qmyhaoqqkjsrvfvlebtp.jpg", "width": 1920, "cloudinary_id": "qmyhaoqqkjsrvfvlebtp", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wkd8ntzfwf60ij8s8nlm.jpg", "width": 1920, "cloudinary_id": "wkd8ntzfwf60ij8s8nlm", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w8i1qcb6aemuodat0yai.jpg", "width": 1920, "cloudinary_id": "w8i1qcb6aemuodat0yai", "height": 1080}], "id": 5433}, {"genres": [5, 8, 31, 33], "name": "Metal Slug 2", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w77bw6wbwr6qprutaxlv.jpg", "width": 864, "cloudinary_id": "w77bw6wbwr6qprutaxlv", "height": 1203}, "summary": "“METAL SLUG 2”, the 2nd entry in SNK’s emblematic 2D run & gun action shooting game returns to the battlefield on the Steam gaming platform!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ftfbv8gax3iznaezpoxd.jpg", "width": 800, "cloudinary_id": "ftfbv8gax3iznaezpoxd", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ytbqd8fugj7jclz0qjkp.jpg", "width": 800, "cloudinary_id": "ytbqd8fugj7jclz0qjkp", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qbl0kitfowkfjmanfess.jpg", "width": 800, "cloudinary_id": "qbl0kitfowkfjmanfess", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/emn900imbibjrqbxgvy6.jpg", "width": 800, "cloudinary_id": "emn900imbibjrqbxgvy6", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ux49v0arkvk5hpahslg0.jpg", "width": 800, "cloudinary_id": "ux49v0arkvk5hpahslg0", "height": 600}], "id": 1407}, {"genres": [14], "name": "Baseball Stars 2", "videos": [{"video_id": "xfpoV8b8nxc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xft5fvr2gurh1kkdduti.jpg", "width": 225, "cloudinary_id": "xft5fvr2gurh1kkdduti", "height": 282}, "summary": "Baseball Stars 2 is the sequel to the very successful Baseball Stars game released for Nintendo in the late 1980s. It was released by SNK for Arcade, as well as the Nintendo Entertainment System. It has since been released for Virtual Console, as well as the PlayStation network.", "storyline": "The Baseball Stars series set the early benchmark for quality baseball sports games, and introduced a number of features that have become standard in more current sports games, such as managerial control and player creation. Baseball Stars 2 built on this by introducing new batting stances, enhanced pitch control, the ability to alter field formations for enhanced coaching strategies, and a number of other features. Players can create leagues of up to 125 games, with 6 teams. Statistics are tracked over the length of the season, and players can be upgraded over time.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ejjzkknndfyqiveqnqq1.jpg", "width": 400, "cloudinary_id": "ejjzkknndfyqiveqnqq1", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/h6gwm7ncknosk6psuiju.jpg", "width": 557, "cloudinary_id": "h6gwm7ncknosk6psuiju", "height": 418}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/e9afgqlatpdzx9yj8fnw.jpg", "width": 550, "cloudinary_id": "e9afgqlatpdzx9yj8fnw", "height": 432}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yu1is2atddna9yimnahe.jpg", "width": 320, "cloudinary_id": "yu1is2atddna9yimnahe", "height": 240}], "id": 9942}, {"genres": [33], "summary": "After the space pilot Vanessa Gaiden defeated the Evil Empire in the events of the game Last Hope, she got missing on her way back and wasn't heard of anymore. Vanessa's husband, Gordian Gaiden, sets out to search for her. Meanwhile, a new evil has appeared in the galaxy: a planet lord called \"The Master\", who can create and control evil beings made of steel, and uses his power to terrorize the galaxy. On his search, Gordian comes across the evil presence of The Master and sets out in his Gunlord suit for the planet Kairos II.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r4k1r7tuwyakl7jkydd4.jpg", "width": 300, "cloudinary_id": "r4k1r7tuwyakl7jkydd4", "height": 419}, "id": 9124, "name": "Gunlord"}, {"genres": [4, 33], "name": "Garou: Mark of the Wolves", "videos": [{"video_id": "MW3MYzuskZM", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nmwdnhatwln9waqdp08j.jpg", "width": 1362, "cloudinary_id": "nmwdnhatwln9waqdp08j", "height": 1350}, "summary": "If you thought you'd seen the last of the incredible Garou: Mark of The Wolves series, you were sorely mistaken. Join classic brawlers and fresh finds (there are 11 new additions in all) for the fighting experience of the decade. The game's three unique modes of play include Offensive, Defensive, and Tactical, and there are plenty of Super Moves and Hidden Abilities to unlock. The realm of 2D fighting has rarely been this exciting, and it gets even more addicting when you play against a friend.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/tdr2voacyaqbfkzclgaj.jpg", "width": 1920, "cloudinary_id": "tdr2voacyaqbfkzclgaj", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gllxuyj92l4bhpgbdbbc.jpg", "width": 1920, "cloudinary_id": "gllxuyj92l4bhpgbdbbc", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ngpyuexix6wdivbhrhmj.jpg", "width": 1920, "cloudinary_id": "ngpyuexix6wdivbhrhmj", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hargla8rkvixrflp38is.jpg", "width": 1920, "cloudinary_id": "hargla8rkvixrflp38is", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zhk0frll8garhb7bl7zw.jpg", "width": 1920, "cloudinary_id": "zhk0frll8garhb7bl7zw", "height": 1080}], "id": 10605}, {"genres": [14, 33], "name": "Windjammers", "videos": [{"video_id": "-tYWIOI0SQI", "name": "Trailer"}, {"video_id": "I5OSsVUyhe0", "name": "Gameplay video"}, {"video_id": "u0pAuIwMmM4", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f8z0picpbymabhzsrpsz.jpg", "width": 250, "cloudinary_id": "f8z0picpbymabhzsrpsz", "height": 322}, "summary": "Windjammers (also known as Flying Power Disc in Japan) is a fast paced sports arcade game released by Data East on the Neo Geo arcade system in 1994 and later on the Wii Virtual Console in Japan on June 22, 2010. Following the bankruptcy of Data East, the intellectual rights for this game were acquired by Paon.[1] It was delisted in Japanese Virtual Console for the Wii on December 24, 2013, making it the only delisted Neo-Geo game for the Wii Virtual Console. \n \nThe game mechanics are essentially the same as Pong or air hockey, where players continuously shoot the disc at the goal zone of the opponent attempting to score. The game can be played against the computer or in a 2 player versus.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xnmpzka2wnm4mje5iqod.jpg", "width": 1920, "cloudinary_id": "xnmpzka2wnm4mje5iqod", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zaow7ce2lcpah89gdk0c.jpg", "width": 1920, "cloudinary_id": "zaow7ce2lcpah89gdk0c", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q979yo7ntwj91rf7vhi3.jpg", "width": 1920, "cloudinary_id": "q979yo7ntwj91rf7vhi3", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eb5twchyop3foums44ty.jpg", "width": 1920, "cloudinary_id": "eb5twchyop3foums44ty", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kgh22gwsnlycfac3wmgl.jpg", "width": 1920, "cloudinary_id": "kgh22gwsnlycfac3wmgl", "height": 1080}], "id": 11222}, {"genres": [8, 33], "name": "Magician Lord", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z6l8w4trlpvx3gbaldlj.jpg", "width": 600, "cloudinary_id": "z6l8w4trlpvx3gbaldlj", "height": 780}, "summary": "Magician Lord (マジシャンロード Majishan Roodo?), is a side-scrolling platform game developed by ADK that was released on April 26, 1990. It was a launch title for both the Neo-Geo MVS (arcade) and AES (home) systems, and was one of the pack-in games for the Neo-Geo AES. The game was re-released through the Virtual Console download service in Europe and Australia on October 26, 2007, and in North America on October 29, 2007. It was later released for the PlayStation 3 and PlayStation Portable through the PlayStation Store. It was previously included in SNK Arcade Classics Vol. 1, released for the Wii, PlayStation 2 and PlayStation Portable in North America on May 1, 2008.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vtlmx3wlvqkt5rpphz3j.jpg", "width": 1280, "cloudinary_id": "vtlmx3wlvqkt5rpphz3j", "height": 720}], "id": 19109}, {"genres": [4, 33], "name": "The King of Fighters '95", "videos": [{"video_id": "greALx7jn4U", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bzwd3mjw7ghoptfjdpkl.jpg", "width": 1130, "cloudinary_id": "bzwd3mjw7ghoptfjdpkl", "height": 1000}, "summary": "The King of Fighters '95 is a 1995 fighting game produced by SNK for the Neo Geo arcade and home console. It is the sequel to The King of Fighters '94 and the second game in The King of Fighters series. It is also the first game in the series to be ported to other home consoles besides the Neo Geo AES and Neo-Geo CD, with versions released for the PlayStation, Sega Saturn and Game Boy. It was also rereleased in The King of Fighters Collection: The Orochi Saga in 2008 for the PlayStation 2, PlayStation Portable and Wii.", "storyline": "The King of Fighters '95 marks the beginning of a story arc that later became known as the \"Orochi Saga\". However, the only elements from the Orochi Saga known in this game is the introduction of Kyo's rival, Iori Yagami, and Rugal's use of the Orochi power. \n \nRugal Bernstein, thought to have perished in an explosion in the previous game, had in fact survived and sent out invitations to the teams from the previous game signed simply ‘R'. Only one of the previous teams failed to attend the new tournament: the American Sports Team, now replaced by the \"Rival Team\" consisting of Iori Yagami, Billy Kane (from Fatal Fury: King of Fighters), and Eiji Kisaragi (from Art of Fighting 2). Saisyu Kusanagi, Kyo's father, appears as a fighter for the first time (having made a non-playable cameo in KOF '94) as a computer-controlled sub-boss character. After defeating Saisyu in the arcade mode, it is revealed that Saisyu was being brainwashed and that Rugal will fight once again as a boss character, but as an enhanced version named \"Omega Rugal\".", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/r2qsukspiwjkoa2gaxic.jpg", "width": 320, "cloudinary_id": "r2qsukspiwjkoa2gaxic", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qebbs3nzux0ezlctt2qc.jpg", "width": 304, "cloudinary_id": "qebbs3nzux0ezlctt2qc", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xloi3a5nmxsb4c2hveqc.jpg", "width": 304, "cloudinary_id": "xloi3a5nmxsb4c2hveqc", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ky7jy6roi6xidjg4somv.jpg", "width": 640, "cloudinary_id": "ky7jy6roi6xidjg4somv", "height": 480}], "id": 15427}, {"genres": [4], "summary": "From Wikipedia: \"The King of Fighters '96 is a 1996 fighting game released by SNK for the Neo Geo arcade and home consoles. It is the third game in The King of Fighters series, following The King of Fighters '95. Like its predecessor, the game was ported to the Neo-Geo CD, as well as the PlayStation and Sega Saturn. Unlike the previous game, the PlayStation and Saturn versions were released only in Japan, with a language setting allowing the player to set the game to English. It is also part of the compilation The King of Fighters Collection: The Orochi Saga for the PlayStation 2, PlayStation Portable and Wii. It was also released on the Wii Virtual Console in Japan on February 15, 2011, in North America on July 12, 2012 and in the PAL region on November 22, 2012.\"", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xuualau3u1ablucboxak.jpg", "width": 251, "cloudinary_id": "xuualau3u1ablucboxak", "height": 251}, "id": 12588, "name": "The King of Fighters '96"}, {"genres": [5, 33], "name": "Last Resort", "videos": [{"video_id": "aybhwlEV0EM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aw2ulsmplys3uy7lsjvk.jpg", "width": 802, "cloudinary_id": "aw2ulsmplys3uy7lsjvk", "height": 1024}, "summary": "Last Resort is an arcade shoot 'em up video game by SNK released in 1992.", "id": 36750}, {"genres": [4], "name": "Fatal Fury 3: Road to the Final Victory", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/itjdxf3i9ncgvbmnwqwx.jpg", "width": 906, "cloudinary_id": "itjdxf3i9ncgvbmnwqwx", "height": 1278}, "summary": "An adaptation of the Neo-Geo fighting game. 2-D scrolling one-on-one fighter with pseudo-3D aspects (that allows for players to \"escape\" holds, throws, and other attacks). Part of the incestuously-popular SNK fighting game pantheon...", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ic5gy3bjc7usyzxvqbap.jpg", "width": 1000, "cloudinary_id": "ic5gy3bjc7usyzxvqbap", "height": 700}], "id": 6690}, {"genres": [4, 33], "summary": "Are you ready for a fierce battle in an ultra-deathmatch!? Who is the greatest hero in the world? You will find out today! A scientist has created a time machine that eight heroes will travel through time with to prove who is the greatest fighter of all time!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qf1q4yxmhuws3rlkqlag.jpg", "width": 600, "cloudinary_id": "qf1q4yxmhuws3rlkqlag", "height": 750}, "id": 4463, "name": "World Heroes"}, {"genres": [4], "summary": "The plot of Fatal Fury centers around a martial arts tournament known as the \"King of Fighters\" tournament, held in the fictional American city of South Town and sponsored by local crime boss Geese Howard. Ten years prior to the events of the game, Geese murdered a rival martial artist named Jeff Bogard who was on his trail. Now, Jeff's sons, Terry and Andy, along with their friend Joe Higashi, enter the tournament to get their revenge on Geese.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/okqzjl7mb2pt8ayccy16.jpg", "width": 220, "cloudinary_id": "okqzjl7mb2pt8ayccy16", "height": 278}, "id": 5386, "name": "Fatal Fury: King of Fighters"}, {"genres": [9], "name": "Puzzle Bobble", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mfnqzocpkwwgw1tj2xhz.jpg", "width": 300, "cloudinary_id": "mfnqzocpkwwgw1tj2xhz", "height": 437}, "summary": "Puzzle Bobble, also known as Bust-a-Move in North America, is a 1994 tile-matching arcade puzzle video game for one or two players created by Taito Corporation. It is based on Taito's popular 1986 arcade game Bubble Bobble, featuring characters and themes from that game. Its characteristically cute Japanese animation and music, along with its play mechanics and level designs, made it successful as an arcade title and spawned several sequels and ports to home gaming systems.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/a8wsf4rclnpikke9qkph.jpg", "width": 320, "cloudinary_id": "a8wsf4rclnpikke9qkph", "height": 224}], "id": 28391}, {"genres": [14], "summary": "Published in 1993, the original Super Sidekicks (known as Tokuten Ou, \"Goal-Scoring King\" in Japan) was SNK's first soccer video game. It features 12 teams divided into two groups which compete for the \"SNK Cup\" (the main differences between teams is their formations on the field): \n \nGroup A: Germany, Italy, Spain, England, Mexico, Japan \nGroup B: Argentina, Holland, Brazil, France, United States, South Korea \n \nThe players' team plays against all the others in their group, then it goes into an elimination tournament's semifinals and then the final to win the cup. There was also a hidden feature in the game, which wasn't documented, and affects a single player game. During a free kick for the CPU if the player has tapped button A for player two, the CPU performs a short-shot, while pressing the button A performs a longer kick.", "id": 52191, "videos": [{"video_id": "3XJAP_Uzhwg", "name": "Gameplay video"}, {"video_id": "1QKB5vnFDXs", "name": "Gameplay video"}], "name": "Super Sidekicks"}, {"genres": [26], "name": "Quiz King of Fighters", "videos": [{"video_id": "vPKfiT0mIOg", "name": "Attract Mode / Demo"}, {"video_id": "KNnHSKwTv_c", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ri3lxreqinc7me8n0eqx.jpg", "width": 680, "cloudinary_id": "ri3lxreqinc7me8n0eqx", "height": 680}, "summary": "A quiz game released for arcades running NeoGeo MVS hardware (and later ported to the NeoGeo AES and NeoGeo CD) exclusively in Japan. \n \nThe spiritual successor to SNK's Quiz Daisousasen series, Quiz King of Fighters uses the series' engine and structure (including a variety of new mini-games) while incorporating many characters from the Art of Fighting, Fatal Fury, and Samurai Shodown series (often lifting the assets from the games themselves). \n \nThe truth is sleeping in the battle ...", "storyline": "\"Quiz City is dangerous!\" Yuri Sakazaki screams before she is kidnapped. Who is Yuri's kidnapper? And what is \"Quiz City\"? Called by the city's challenge, six heroes brace themselves and prepare to test their mettle in the streets!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/itufmgmhsnb4cwet86c6.jpg", "width": 320, "cloudinary_id": "itufmgmhsnb4cwet86c6", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xghaxytoz6msjc6yc0xz.jpg", "width": 320, "cloudinary_id": "xghaxytoz6msjc6yc0xz", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kv15isixv45r2fd5gwpv.jpg", "width": 320, "cloudinary_id": "kv15isixv45r2fd5gwpv", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xspjvktnpmcfwiovw69i.jpg", "width": 304, "cloudinary_id": "xspjvktnpmcfwiovw69i", "height": 224}], "id": 51692}]