[{"summary": "Never 7: The End of Infinity is the first title in the Infinity series, and is followed by Ever 17: The Out of Infinity, Remember 11: The Age of Infinity, 12Riven: The Psi-Climinal of Integral, and Code_18.\n\nIn the game, the player takes the role of Makoto Ishihara, a college student who attends a seminar camp on an island together with three other students; he also befriends three other people who he meets on the island. The game takes place over the course of a week, and consists of the player reading the story, occasionally making choices that affect the direction of the plot; on the sixth day, one of the female characters dies, and the game moves back in time to the beginning, letting the player use knowledge from the first set of six days to make new choices, to try to prevent the character's death.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oggwhddea8limsbxj48e.jpg", "width": 500, "cloudinary_id": "oggwhddea8limsbxj48e", "height": 725}, "id": 18018, "name": "Never 7: The End of Infinity"}, {"genres": [13], "summary": "Melon Chan's Growth Diary (Japan: Melon-chan no Seichouki) is a Life simulation game it is comparable to Tamagotchi and other virtual life simulations. In Melon Chan's Growth Diary the player raises and nurtures little girl Melon Chan. The games was only released in Japan and was one of the earliest titles released for the Neo Geo Pocket. \n \nThe game was released for the Neo Geo Pocket and features monochrome graphics; however the Neo Geo Pocket Color is backwards compatible with the game.", "id": 47622, "name": "Melon Chan's Growth Diary"}, {"genres": [9], "summary": "Renketsu Puzzle Tsunagete Pon! is a game where blocks have to be dissolved. New blocks constantly scroll into the screen from the top. The game is over when the first blocks reach the bottom of the screen.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zvcfldwmeomzhmbodiai.jpg", "width": 1500, "cloudinary_id": "zvcfldwmeomzhmbodiai", "height": 1500}, "id": 47623, "name": "Renketsu Puzzle Tsunagete Pon!"}, {"genres": [4], "summary": "The King of Fighters: R1 marks SNK's first time bringing the KOF series onto a handheld... and what better system than their own Neo Geo Pocket to do just that? 14 of the most well known KOF characters make their appearance in KOF: R-1, along with some recognizable backgrounds and gameplay features based on The King of Fighters '97. Players can choose from \"Extra\" & \"Advance\" play modes similar to KOF '97, and most characters play closely to their original versions.", "id": 47602, "name": "King of Fighters R-1"}, {"genres": [4], "summary": "Iza To! En Garde! Dude! Twelve of the mightiest samurai, ninja, knights, and warriors from Japan, France, the United States, and China lock swords in NEO GEO's SAMURAI SHODOWN. With blades, bare knuckles, rage, and various Methods of Mayhem, fight your way to the final battle with Satan's Shogun. Use all powers at your disposal to get a head!", "id": 47586, "name": "Samurai Shodown!"}, {"genres": [14], "summary": "Pocket Tennis a simple tennis game with two play modes: Exhibition and Tournament. \n \nExhibition is a single match against computer or human opponent (requires link cable). There do exist eight player characters with different skills (human player must select one of those eight characters too) and four (five in the color version) different courts. Also amount of sets per game can be selected (1, 3 or 5). \n \nTournament is only against computer. Human player can pick his/her character but not the computer opponent. Also selection of courts and amount of sets is missing. Three games will be played: quarter and semifinals and of course the final.", "id": 47601, "name": "Pocket Tennis"}]