[{"summary": "GAME DETAILS \nYour Littlest Pet Shop Pets Come to Life! Each game comes with 6 unique pets, collect them all! \n \nCollect and name 20 pets - including brand new Fanciest, Cuddliest, Sportiest, Chilliest and more! Dress up your pets with over 100 accessories to make them even cuter. Explore 4 unique pet-sized worlds! Compete in mini games with your little pets to earn Kibble Coins! Play 16 fun and challenging games with your pets to unlock accessories, playsets, and new pets too!", "id": 48020, "name": "Littlest Pet Shop: Garden"}, {"genres": [12, 31], "summary": "Enchanted Folk and the School of Wizardry est un jeu d'aventure sur DS prenant pour cadre une école de magie. Au milieu d'une promotion de plus de cent étudiants, le joueur doit apprendre à maîtriser une série de sorts et incantations pour espérer obtenir sa Licence de Magicien et devenir un Maître Sorcier.", "id": 23019, "name": "Enchanted Folk and the School of Wizardry"}, {"genres": [9], "summary": "Meet Margot, the new video game queen of word play! Margot has devised a set of six fiendish and compelling word-based puzzles to test your vocabulary, spelling, and general vocabulary skills. No two games will ever be the same as you wrack your brain against the clock to create words from randomly generated letters in order to score maximum points! \n \nEach puzzle presents a unique challenge, and players will have to master them all to become the ultimate Word Brain. Puzzle examples - Word Mine, Word Link, and Word Safe. \n \nWord Brain mode pits the player against all six of the games in succession. Their score is recorded so players can track their progression as they play again and again. \n \nEasy to use menus and gameplay make Margot's Word Brain a game that is accessible to gamers of all ages and experience levels. \n \nGame tracks high scores so players can compare and compete with friends.", "id": 47961, "name": "Margot's Word Brain"}, {"genres": [13], "summary": "Dora's Cooking Club was published by 2K Play on October 26, 2010 in North America. In the game, players have to chop veggies, stir soups, top pizzas, and stuff using math skills. They may be sorting cookies into numbered groups or counting out different amounts of ingredients.", "id": 47964, "name": "Dora's Cooking Club"}, {"genres": [15], "summary": "Deforestation, pollution, global warming and industrialization are just some of the many important themes in Eco Creatures: Save the Forest, a unique real-time strategy game and the only game of its kind that promotes awareness of environmental perils while tasking players with defending the Mana Woods against them. Players use the Touch Screen to control units of woodland creatures—named Ecolis, Ecoby and Ecomon—that will protect the naturally beautiful Mana Woods and recover the polluted land. All creature types have unique skills that must be strategically managed. With proper nurturing, they can evolve to learn new abilities that help a player complete the game’s more than 40 environmental missions. As players grow their woodland army, they must also plant new trees to prevent deforestation and revitalize the woodlands. In addition, Eco Creatures includes a creative Land Make feature that lets players build and play their own maps. This eco-friendly RTS also supports two-player play via Nintendo Wi-Fi Connection, and up to four players via single card download play or ad-hoc multi-card play.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/s2qukz0pdkvscddqpcyc.jpg", "width": 256, "cloudinary_id": "s2qukz0pdkvscddqpcyc", "height": 384}], "id": 21280, "name": "Eco-Creatures: Save the Forest"}, {"genres": [9, 31], "summary": "Franklin the Turtle is off with his friends in the summer embarking on new adventures and meeting new friends. Franklin's Great Adventures is an adventure game with light puzzles.", "id": 48044, "name": "Franklin's Great Adventures"}, {"genres": [12, 15], "id": 47720, "name": "Shining Force Feather"}, {"genres": [9], "summary": "Dr. Kawashima's Brain Training: How Old Is Your Brain? is an entertainment video game that employs puzzles. \n \nBrain Training presents quick mental activities that help keep your DS brain in shape. Activities include quickly solving simple math problems, counting people going in and out of a house simultaneously, drawing pictures on the Touch Screen, reading classic literature out loud, and more. You can also play Sudoku, the number puzzle game which has become an extremely popular feature in U.S. newspapers \nBrain Age is inspired by the research of Professor Ryuta Kawashima, a prominent Japanese neuroscientist. His studies evaluated the impact of performing certain reading and mathematic exercises to help stimulate the brain.", "id": 47723, "name": "Dr. Kawashima's Brain Training: How Old is Your Brain"}, {"id": 47712, "name": "Slingo Quest"}, {"genres": [9], "summary": "WordJong features simple, yet engrossing gameplay: Use a set of lettered tiles to create words, clearing the board as you use tiles. Shoot for high-scoring words, earn bonus tiles, and work to clear the board with no leftover letters. WordJong boasts several new features exclusive to the Nintendo DS system, including local and online wireless play as well as DS Download play, a variety of Solo Play modes, a 100,000+ word dictionary, full support for both the Control Pad and Touch Screen, and much, much more!", "id": 47715, "name": "Word Jong"}, {"genres": [31], "summary": "Disney Princess: Magical Jewels for Nintendo DS invites girls to play as their favorite Disney Princesses in an enchanted adventure. Girls explore the game at their own pace and skill level to recover the Magical Jewels and restore the magical power of a kingdom. In a magic-filled romp through locations familiar to young girls, players experience the excitement of interacting with the environments through the Nintendo DS touch screen to solve puzzles and tasks that help each Princess on her adventure. A tiered design provides an accessible play experience for the younger player, yet also provides layers of challenges for older players. Multiplayer modes allow the player to have a friend join the fun.", "id": 47698, "name": "Disney Princess: Magical Jewels"}, {"genres": [12], "summary": "Digimon World Dawn and Digimon World Dusk, originally released as Digimon Story Sunburst & Moonlight in Japan, are two Digimon video games for the Nintendo DS handheld game console. They were released in Japan on March 29, 2007 and North America on September 18, 2007. Together, they serve as the second game in the Digimon Story series, though they were marketed as games within the Digimon World series in North America.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/fwzpiwkvdmzamnbk5nfr.jpg", "width": 256, "cloudinary_id": "fwzpiwkvdmzamnbk5nfr", "height": 384}], "id": 21521, "name": "Digimon World Dawn/Dusk"}, {"summary": "Video games based on Fullmetal Alchemist have been released. The storylines of the games often diverge from those of the anime and manga, and feature original characters. Square Enix has released three role-playing games (RPG)—Fullmetal Alchemist and the Broken Angel, Curse of the Crimson Elixir, and Kami o Tsugu Shōjo. Bandai has released two RPG titles, Fullmetal Alchemist: Stray Rondo (鋼の錬金術師 迷走の輪舞曲 Hagane no Renkinjutsushi Meisō no Rondo?) and Fullmetal Alchemist: Sonata of Memory (鋼の錬金術師 想い出の奏鳴曲 Hagane no Renkinjutsushi Omoide no Sonata?), for the Game Boy Advance and one, Dual Sympathy, for the Nintendo DS. In Japan, Bandai released an RPG Fullmetal Alchemist: To the Promised Day (鋼の錬金術師 Fullmetal Alchemist 約束の日へ Hagane no Renkinjutsushi Fullmetal Alchemist Yakusoku no Hi e?) for the PlayStation Portable on May 20, 2010.[37] Bandai also released a fighting game, Dream Carnival, for the PlayStation 2. Destineer released a game based on the trading card game in North America for the Nintendo DS.[38][39] Of the seven games made in Japan, Broken Angel, Curse of the Crimson Elixir, and Dual Sympathy have seen international releases. For the Wii, Akatsuki no Ōji (暁の王子?, lit. Fullmetal Alchemist: Prince of the Dawn) was released in Japan on August 13, 2009.[40] A direct sequel of the game, Tasogare no Shōjo (黄昏の少女?, lit. Fullmetal Alchemist: Daughter of the Dusk), was released on December 10, 2009, for the same console.[41] \n \nFunimation licensed the franchise to create a new series of Fullmetal Alchemist related video games to be published by Destineer Publishing Corporation in the United States.[42] Destineer released its first Fullmetal Alchemist game for the Nintendo DS, a translation of Bandai's Dual Sympathy, on December 15, 2006, and said that they plan to release further titles.[43] On February 19, 2007, Destineer announced the second game in its Fullmetal Alchemist series, the Fullmetal Alchemist Trading Card Game, which was released on October 15, 2007.[44] A third game for the PlayStation Portable titled Fullmetal Alchemist: Senka wo Takuseshi Mono (背中を託せし者?) was released in Japan on October 15, 2009.[45] A European release of the game, published by with Namco Bandai, was announced on March 4, 2010.[46] The massively multiplayer online role-playing game MapleStory also received special in-game items based on the anime series.[47] \n \nArakawa oversaw the story and designed the characters for the RPG games, while Bones—the studio responsible for the anime series—produced several animation sequences. The developers looked at other titles—specifically Square Enix's action role-playing game Kingdom Hearts and other games based on manga series, such as Dragon Ball, Naruto or One Piece games—for inspiration. The biggest challenge was to make a \"full-fledged\" game rather than a simple character-based one.[48] Tomoya Asano, the assistant producer for the games, said that development took more than a year, unlike most character-based games.[49]", "id": 47697, "name": "Fullmetal Alchemist: Trading Card Game"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qgprefiurkp7riaqp8iq.jpg", "width": 1500, "cloudinary_id": "qgprefiurkp7riaqp8iq", "height": 1350}, "id": 47792, "name": "Murder In Venice"}, {"summary": "Set forth on a quest to become a puzzle master! Use your keen sense of logic and the Laws of Physics to solve brain teasing puzzles.", "id": 47770, "name": "Logic Machines"}, {"genres": [13], "summary": "Virtual life: create your own tropical aquarium. \n \nCreate, populate, and decorate your perfect fish tank. Feed and breed over 30 different types of tropical fish, including Clown Fish, Neon Tetras, Angel Fish, and more! Customize your tank with decorative rocks, plants, figurines, and other accessories. You can even trade your fish with friends via the Nintendo Wi-Fi Connection!", "id": 47776, "name": "Aquarium by DS"}, {"genres": [9], "summary": "Become Nancy Drew as she unravels the mystery of the missing billionaire in this engaging action adventure game for the Nintendo DS. Use Nancy's detective skills to solve puzzles and discover clues left by a slew of suspicious characters.", "id": 47808, "name": "Nancy Drew: The Deadly Secret of Olde World Park"}, {"genres": [15], "summary": "Yu-Gi-Oh! World Championship 2008 is one of the World Championship game series, that released for 2008. \n \nTournament dueling is back with the official software of Yu-Gi-Oh! World Tournament 2008! Battle it out on two exciting game modes: \"World Championship\" mode, and the new \"Duel World\" mode, where you can venture through events, meet duel spirits, and buy new cards.", "id": 47809, "name": "Yu-Gi-Oh! World Championship 2008"}, {"genres": [9, 14], "summary": "Mama develops her wilderness skills in Camping Mama: Outdoor Adventures that features 100 different stylus based games across a broad range of challenges. Craft a fishing pole, use it to fish then cook your catch; capture wild chickens for a tasty egg breakfast; set up your tent; collect exotic insects and much more. \n \nBoth girls and boys can enjoy fun outdoor activities like rock climbing, spelunking, rowing and tree climbing as they navigate 38 different levels that span forests, mountains and seas. Would-be campers can choose to play as either the son or daughter with Mama or Papa providing guidance depending on the challenge. With customization options and collectible play, Camping Mama lets everyone go wild in the great outdoors.", "id": 47942, "name": "Camping Mama: Outdoor Adventures"}, {"genres": [31], "summary": "Star Wars: The Clone Wars – Jedi Alliance is an action/adventure game developed and published by Lucasarts. It was released for the Nintendo DS entertainment system on November 11, 2008. It is set in the science fiction universe of Star Wars and is a tie-in to The Clone Wars TV series.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gyojjftzvuohfwuatknr.jpg", "width": 256, "cloudinary_id": "gyojjftzvuohfwuatknr", "height": 192}], "id": 21335, "name": "Star Wars The Clone Wars: Jedi Alliance"}, {"genres": [9], "summary": "Gunpey (グンペイ?), often written as \"Gun Pey\" or \"GunPey\", is a series of handheld puzzle games released by Bandai. It was originally released for the WonderSwan, and has been ported to WonderSwan Color, Playstation, Nintendo DS and PlayStation Portable. The game was named as a tribute to the developer of the game, Gunpei Yokoi.[1] He is known for developing several handheld consoles such as Nintendo's Game Boy, Virtual Boy, and Bandai's Wonderswan system. In the series, players move line fragments vertically in a grid in order to make a single branching line connect horizontally from one end to the other. The objective of the game differs by what game mode players choose.", "id": 47805, "name": "Gunpey DS"}, {"genres": [14], "summary": "Challenge the world's best soccer teams! Select your matches from 12 opposing teams from around the world. As Captain Kunio, you can strategize by changing your formations, checking weather forecasts, talking to your teammates, and giving them special items to boost their performance!", "id": 47838, "name": "River City Soccer Hooligans"}, {"genres": [15], "summary": "For the first time, the Yu-Gi-Oh! World Championship Tournament series makes its debut on the Nintendo DS. The official software of the 2007 Yu-Gi-Oh! World Tournament makes worldwide wireless dueling possible utilizing the Nintendo Wi-Fi connection. The game will include 1,600 of the latest cards and more cards will be available for download. Create your best deck and prepare for the World Tournament in the Summer of 2007.", "id": 47840, "name": "Yu-Gi-Oh! Duel Monsters World Championship 2007"}, {"genres": [9, 31], "name": "Doctor Who: Evacuation Earth", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gyshetm5nrdoxxmlmpta.jpg", "width": 1000, "cloudinary_id": "gyshetm5nrdoxxmlmpta", "height": 899}, "summary": "This is your chance to be the Doctor and guide him and Amy Pond on a thrilling new adventure. \nArriving on Earth only hours before a Solar Storm is due to wipe out all life on the planet, the Doctor and his companion discover the last group of humans preparing to evacuate. No sooner have they arrived then the TARDIS disappears and they embark on a mission to recover it, encountering Silurians and Daleks along the way. \n \nStaring the voices of Matt Smith and Karen Gillan, this brand new official Doctor Who storyline includes over 100 puzzles, plus over 60 exciting locations to explore.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/putmgqwypflcxrmsevtr.jpg", "width": 1340, "cloudinary_id": "putmgqwypflcxrmsevtr", "height": 1000}], "id": 47842}, {"genres": [15], "summary": "Scene It? Twilight players will be completely submerged into the chilling universe of the Twilight novels and movies as they interact with some of the most iconic locations, characters and scenes from the first film. Fans will put their knowledge to the test to determine who the ultimate Twilight expert is!", "id": 47845, "name": "Twilight scene it"}, {"genres": [5, 10], "summary": "Based on the hit television series, Transformers Animated: The Game delivers an exciting action-adventure experience. As they blast through Decepticon-controlled hoverbots, players must solve challenging team-building puzzles and race through futuristic Detroit roadways, dodging on-coming traffic while seamlessly morphing between robot and vehicle form. Fans take control of all their favorite Autobot characters, including Optimus Prime, Bumblebee, Bulkhead and Prowl, as they work together to reclaim the lost fragments of the Allspark before the Decepticons intercept it and claim Cybertron as their own.", "id": 47846, "name": "Transformers Animated: The Game"}, {"genres": [12, 15], "name": "Bleach: The 3rd Phantom", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f4dkxfwqqe3b2ygqi3cb.jpg", "width": 1500, "cloudinary_id": "f4dkxfwqqe3b2ygqi3cb", "height": 1344}, "summary": "In this exclusive storyline, exciting details are revealed about the BLEACH universe from before the start of the anime series. The story highlights the close partnership between two fraternal twin Soul Reapers, Matsuri Kudo and her brother Fujimaru. In fierce battles. For the first time, players create and command their own team of eight Soul Reapers. In team-based battles, players decide where to place their team on the campaign map and also how to customize their character's powers with the experience points they received. With exciting revelations and a lot more choice, strategy and cooperative gameplay, BLEACH: The 3rd Phantom will thrill fans and newcomers to the series.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nyt3aqthbs0clxridevg.jpg", "width": 256, "cloudinary_id": "nyt3aqthbs0clxridevg", "height": 384}], "id": 19103}, {"genres": [4, 31], "summary": "This game was released only in Japan.", "id": 47832, "name": "Bleach DS 4th: Flame Bringer"}, {"genres": [13], "summary": "The next evolution of virtual pets comes to the Nintendo DS. Utilizing a toy puppy that interacts with the player through the Nintendo DS, Wappy Dog teaches young gamers to raise their very own puppy in both the real and virtual worlds and teach it cool tricks, play mini-games together and even converse! Each pet is a fully personalized experience, enabling players to customize both the in-game version and physical dog with different colors and accessories. \n \nThe player's interaction with their Wappy Dog determines the pet’s constantly evolving personality, skills, and happiness. Players communicate with Wappy using commands given through the Nintendo DS™ and he responds both virtually, by wagging its tail among other tricks, and physically, with vocal barks and movements, just like a real pet! One that also sings and dances that is. \n \nPlayers choose between \"Home Mode\", which enables them to engage with Wappy Dog through the Nintendo DS, or \"Travel Mode\", which gives on-the-go players a chance to continue caring for and playing with their pet virtually without the physical dog. When the player returns home, their dog’s progress instantly transfers to the toy as if they’ve never been apart.", "id": 47852, "name": "Wappy Dog"}, {"genres": [31], "summary": "In Zenses Ocean, players relax themselves playing puzzle games inspired by the movements of the tide, rippling water, riffs and corals, beach vegetation and sea life. An indulgent, soothing experience, Zenses Ocean includes high quality visuals and ambient sounds inspired by the natural sounds of the sea. Subliminal addictive puzzles such as Hot Spot, Shell Twirl, Turtle Turn, Pearl Diver and Wave Breaker (names are currently being reviewed and may change) were created to give players an escape from the stress of every day life. \n« less", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x5lkixnqflju4f1g2ncd.jpg", "width": 1000, "cloudinary_id": "x5lkixnqflju4f1g2ncd", "height": 888}, "id": 21138, "name": "Zenses: Ocean"}, {"summary": "Let's Yoga makes it so easy to learn yoga that you'll feel like you have your very own personal instructor. You can set your DS down next to you and let the vocal instructions tell you exactly what to do, or just read the subtitles. If you're confused by how to do something, you can always rotate the image on the screen 360 degrees to see all angles of the pose. The vocal instructions will even tell you when to inhale or exhale or you can look at the flower symbols on the screen.", "id": 47857, "name": "Let's Yoga"}, {"genres": [13], "summary": "The worlds fastest growing online game for children presents Moshi Monsters: Moshing Zoo on Nintendo DS. Boasting over 50 million players across over 150 countries worldwide Moshi Monsters is one of the largest and most loved online games for children. Moshi Monsters: Moshing Zoo is set to become one of the most sought after presents for children. \n \nFind ‘em, Keep ‘em: Explore the woolly Wilderness in the search of the ultra rare Moshlings to add to your Moshling Zoo! \nPlay Cool Mini-Games: Play exclusive Moshi mini-games to help boost your Moshlings Level, Mood, Health and Happiness. \nExplore the World: Explore all new areas of Monstro City including Busters Baby Care, the Glormatorium and Raaghly’s Stararcade. \nUnlock Moshi Rewards: Unlock ultra rare Moshi Monster rewards including achievements, trophies and super secret items to be unlocked within MoshiMonsters.com.", "id": 47892, "name": "Moshi Monsters: Moshling Zoo"}, {"genres": [14], "summary": "Become a World Class Dancer! \n \nPlay as Laura, an athletic and passionate young girl, who dreams of becoming the world champion of modern dance. With the help of her eccentric coach, she will learn new skills and soon reveal her full potential as a dancer. However, the road to victory will be full of surprises.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xxjkvbexnuvirbdd2i80.jpg", "width": 900, "cloudinary_id": "xxjkvbexnuvirbdd2i80", "height": 807}, "id": 47921, "name": "Ener-G Dance Squad"}, {"genres": [14], "summary": "Officially licensed Little League baseball action hits the Wii and DS! \n \nThe first officially licensed Little League video game to hit next-generation consoles. Players will bat, pitch and field their way from local sandlot slugger to Little League World Series Champion. Featuring eight U.S. and eight international teams, extraordinarily deep character customization, World Series Mode, and a variety of skill based challenges, Little League World Series offers an exciting, authentic baseball experience. Motion-sensing controls on the Wii make it accessible for Little League players and parents alike, while the DS version gives players the freedom to get on the diamond anywhere.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xsscwghrt3sp9engnsw4.jpg", "width": 1017, "cloudinary_id": "xsscwghrt3sp9engnsw4", "height": 900}, "id": 47953, "name": "Little League World Series Baseball 2008"}, {"genres": [9], "summary": "THINK THEREFORE I PLAY! \n \nLogic, observation, memory, speed of perception and analysis: these are the qualities that defi ne the famous Intelligence Quotient and the ones that Best of Tests DS will enable you to test, according to renown scientifi c protocols. It will also allow you to improve them! \n \nThrough the very many tests and using all the functionalities specifi c to the Nintendo DS which are found in the three gaming modes (Training – verbal, numbers and letters, drawings, playing cards, dominos, etc. - Memory and Tests) \nBest of Tests DS calculates your I.Q. and adapts itself to your level in order to offer you a personalized challenge that is always renewed and updated. \nAll the classic challenges of I.Q. tests on your Nintendo DS. \nAn excellent way to maintain and improve your intelligence, while you are having fun! \nSeveral hundred different questions \nThe best way to prepare for professional I.Q. tests! \nA continually renewed interest thanks to the varied rules and different ways to answers the questions. \nAn incremental diffi culty level with tests that are increasingly more diffi cult! \nSerious results, presented in a humorous manner.", "id": 47930, "name": "Best of Tests DS"}, {"genres": [12], "summary": "GAME DETAILS \nSome Heroes Are Made and Some Are Born. \n \nEnter a world where you play as Percy Jackson and fight with his inherited powers to stop the forces of darkness from destroying the universe. Explore the world to reveal the hidden secrets of Camp Half-Blood, the Underworld, and even Olympus itself! \n \nAssemble your perfect team, then match wits and strength against fantastical opponents from the pantheon of Greek mythology, including Medusa, Hydra, and Minotaur! \n \nFeatures: \n \n• MYTHOLOGICAL BATTLES: Pit your team against fierce enemies and beasts from the Percy Jackson franchise. \n• UPGRADES AND CUSTOMIZATION: An addictive leveling system lets you unlock new abilities and upgrades for all characters under your command. \n• TEAMWORK WITH BUFFING AND HEALING: Work together as a team by helping each other with buffs and healing to earn devastating group attacks. \n• EXPLORATION: From Camp Half-Blood to Olympus and beyond, travel through lands filled with evil creatures determined to prevent you from achieving your destiny. \n• WINNING BATTLES AND COMPLETING QUESTS: Defeat enemies to achieve valuable items and experience points which increase the level and power of your characters.", "id": 47899, "name": "Percy Jackson and the Olympians: The Lightning Thief"}, {"id": 47904, "name": "Learn Geography"}, {"genres": [13], "summary": "Become a sensational pop star and travel the globe with your spectacular performances. \n \nSing, play guitar, drums and keyboard as you take your band to the top of the charts! Go solo or jam with your friends – the choice is yours! \n \nFeatures: \n \n• Choose your very own band name! \n• Determine your band’s unique look – outfits, instruments and more! \n• Sing, play the guitar, drums and keyboard – It’s your band, you do what you want! \n• No additional peripherals required. \n• Play solo or jam along with your friends!", "id": 47906, "name": "Dreamer Series: Pop Star"}, {"genres": [31], "summary": "Cory in the House is an adventure stealth video game directed by Lyndon H. Moore III and written by Gerrin Tramis, based on the television series \"Cory in the House\".[2] Cory in the House was developed by Handheld Games Corporation and published by Disney Interactive Studios in 2008 for the Nintendo DS. \n \nGameplay: \n \nCory in the House is an adventure game that requires the player to play as Cory Baxter, a teenager who lives with his father Victor Baxter after Victor gets accepted as head chef at The White House. The basic premise for the game is Cory, after winning a toy contest, starts an endeavor to sell bobbleheads depicting the President of the United States to the citizens of Washington, D.C.. The bobbleheads however are taken into possession by The Evil Toymaker, who tries to utilize the bobbleheads as a means of hypnotic technology on the population of Washington, D.C.[3] Cory is then tasked with retrieving the bobbleheads to stop the hypnosis plan. \n \nThe gameplay can be described as an adventure stealth game, where the player controls Cory and his friends as they move through locations including halls in The White House, a school, a mall, and streets of Washington, D.C. Tasks involve sneaking past Secret Service agents, examining rooms for specific items, throwing pastries at hypnotized teachers, and talking to non-playable characters. Additional features include mini-games, which involve tapping the Nintendo DS stylus against the touchscreen along with music or simulating connecting electrical circuits.[4] \n \nReception: \n \nAt release Cory in the House was critically panned, earning an overall score of 35% out of 100 on aggregate review website GameRankings.IGN's Jack DeVries criticized the gameplay controls, calling them \"clunky\" and \"hard to control\", and also found fault with the game's included laugh track that goes along with the dialogue sequence jokes. Review website Game Boyz also excoriated the game's gameplay, graphics, and sound, concluding that not even hardcore fans of the television series would appreciate it. However, on Metacritic, the game has an average user score of 9.5, making it the highest user-rated DS game on the site.", "id": 47969, "name": "Cory in the House"}, {"genres": [4, 31], "summary": "Doki Doki Majo Shinpan! (どきどき魔女神判!?, lit. \"Thump-Thump Witch Judgement\", or more accurately translated as \"Heart-Pounding Magical Investigation\") [1] is a video game developed by SNK Playmore for Nintendo DS. The player assumes the role of a junior high school student who is asked by an angel to locate a witch that has sneaked into his school. In order to find the witch, he must search the suspects' bodies for a \"witch mark.\" The preferred method is by using touch (using the stylus to guide his hands). A sequel titled Doki Doki Majo Shinpan 2 Duo was released 31 July 2008, and a third game titled Doki Majo Plus was released on July 30, 2009.", "id": 47970, "name": "Doki Doki Majo Shinpan!"}, {"genres": [31], "summary": "Barbie Horse Adventures: Riding Camp is the fourth game of the Barbie Horse Adventures video game series based on the Barbie line of dolls by Mattel. The game was released on Microsoft Windows, Nintendo DS, PlayStation 2, and Wii in 2008. \n \nGameplay: \nThe player on the role of Barbie on an island which has been the victim of a storm. The game is freeform in a sandbox world, allowing the player a range of activities. \n \nThe core gameplay is based around equestrianism: players tame, feed, groom, and train horses of various breeds. \n \nAs Barbie, the player has the option of completing various quests given to her by the denizens of the island, such as finding lost items or fixing broken objects. Travel over the island is on horseback. \n \nBarbie can participate in timed horse races. \n \nBarbie can also buy diverse sets of clothing, enabling her to play dress-up.", "id": 45175, "name": "Barbie Horse Adventures: Riding Camp"}, {"summary": "Littlest Pet Shop Jungle sur DS vous propose d'ouvrir votre propre petite boutique d'animaux et vous en occuper de vos pensionnaires, de les nourrir et de les divertir. Gérez votre petite animalerie et débloquez des accessoires et autres bonus en faisant faire à vos petits protégés des mini-jeux, à travers quatre environnements différents.", "id": 48019, "name": "Littlest Pet Shop: Jungle"}, {"genres": [9], "summary": "Revive the deserted island! Summon the clouds and use the limited amount of water each carries to restore the island's lush flowers to their former beauty. Draw and erase lines to guide the water's flow to the most needed areas and watch as once struggling vegetation beings to bloom again.", "id": 48048, "name": "Nanda's Island"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lijxd0eeirls4zuefhdn.jpg", "width": 1532, "cloudinary_id": "lijxd0eeirls4zuefhdn", "height": 1370}, "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xantkyzucl4bpvsrcwi3.jpg", "width": 272, "cloudinary_id": "xantkyzucl4bpvsrcwi3", "height": 408}], "id": 21336, "name": "The Legend of Kage 2"}, {"genres": [14], "summary": "Transport yourself to a wonderful fairy tale land full of color and cheer! Gummy Bears MiniGolf can be enjoyed by up to four friends or family members of any age, or on your own. Collect achievements, and customize nine unique holes for a personalized adventure! Come play in the fantastic world of Gummy Bears!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cyelorz2u457c5wvvash.jpg", "width": 1477, "cloudinary_id": "cyelorz2u457c5wvvash", "height": 1477}, "id": 47722, "name": "Gummy Bears Minigolf"}, {"genres": [31], "summary": "Assassin's Creed II: Discovery, in contrast to Altaïr's Chronicles, the previous title in the Assassin's Creed series to be on the DS, is a 2.5D side-scroller. \nThe game's story takes place 14 years after the beginning of its console counterpart, Assassin's Creed II. It follows that game's protagonist, Ezio Auditore da Firenze, as he travels to 15th century Spain to free his fellow assassins, who have been imprisoned under the guise of the Spanish Inquisition.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kzcqtxtc33biohxvgbch.jpg", "width": 953, "cloudinary_id": "kzcqtxtc33biohxvgbch", "height": 853}, "id": 45118, "name": "Assassin's Creed 2: Discovery"}, {"summary": "Preschoolers favorite little Guppies - Molly, Gil, Deema, Nonny, Oona, Goby and Bubble Puppy – make a splash in the very first Bubble Guppies videogame! Now your child can dive into this watery world of learning and laughter with over 20 interactive activities based on Nickelodeon’s top-rated preschool series. It’s a fin-tastic adventure like no other!", "id": 47708, "name": "Nickelodeon Bubble Guppies"}, {"genres": [9], "summary": "Crosswords DS supports up to four different players, and features two basic modes - Training and Main Game. The main game includes three classifications of puzzles - Crosswords, Word Searches, and Anagrams. The game uses similar handwriting mechanics to solve the puzzles as the popular Brain Age series of video games, as well as requiring the player to hold the Nintendo DS like a book. All three puzzles have varying difficulty levels, all of them featuring unlockable puzzles and difficulty levels.", "id": 47766, "name": "Crosswords DS"}, {"screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/awvetene6ldylenrs2mp.jpg", "width": 650, "cloudinary_id": "awvetene6ldylenrs2mp", "height": 366}], "id": 21735, "name": "Dream Chronicles"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dlydg10sh51kz8oipxjk.jpg", "width": 1532, "cloudinary_id": "dlydg10sh51kz8oipxjk", "height": 1373}, "id": 47701, "name": "Jewel Master Egypt"}, {"genres": [15], "summary": "America's favorite family card game is mixed with the modern poker craze to create Uno 52. Ten themed backgrounds set the stage in this fast-paced game from America’s favorite toymaker. Four styles of Poker play, including Solitaire and Challenge means the fun never stops!", "id": 47706, "name": "UNO 52"}, {"genres": [31], "summary": "A brand-new tale, based on the fourth season of the show, unfolds as William is being held captive somewhere on Lyoko by the evil virus X.A.N.A. Gamers will follow our heroes on a quest to destroy X.A.N.A. Their final challenge is to defeat the mysterious and dangerous Volcano Replika containing the very core of X.A.N.A.: a crater containing a number of towers one of which holds William... \n \nCode Lyoko: Fall of X.A.N.A delivers a brand new experience for both fans of the animated series and RPG video games. In order to complete their missions, Code Lyoko's four main characters will explore the different sectors of the digital worlds, wirth all new, upgraded weaponery in their fight against the evil supervirus XANA and its minions in a brand new turn-based battle system adapted to the Nintendo DS platform.", "id": 47793, "name": "Code Lyoko: The Fall of X.A.N.A"}, {"genres": [31], "summary": "Kit Kittredge is a 1930s girl with a nose for news! To make ends meet, the Kittredge household has had to take in boarders--and it seems as though every one of them has a mystery for Kit to solve.", "id": 47786, "name": "American Girl: Kit Mystery Challenge!"}, {"genres": [31], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ayj3b3j9n7qgpiyzjjsa.jpg", "width": 256, "cloudinary_id": "ayj3b3j9n7qgpiyzjjsa", "height": 384}], "id": 20760, "name": "Operation: Vietnam"}, {"genres": [15], "summary": "Based on the hit ABC TV show, Wipeout: The Game challenges fans to master speed, balance, and precision to overcome the world's largest obstacle course while enduring the inevitable hilarious falls, sometimes at the hands of your friends and family! \n \nIn Wipeout: The Game, players will prove they have what it takes to make it to the grand finale \"Wipeout Zone\" for their chance to be proclaimed champion. Four players can compete at the same time, even allowing players to hurl objects at and taunt their opponents. The video game features everything that people love about the hit ABC show, including commentary from the show's hosts, John Anderson, John Henson and co-host Jill Wagner. Players will have to run, jump and dodge all of Wipeout's various obstacles, including the brutal Sucker Punch, the beloved Big Balls, and the insanely difficult Sweeper.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cxfvm2qnlcsfo4sjsmbr.jpg", "width": 1500, "cloudinary_id": "cxfvm2qnlcsfo4sjsmbr", "height": 1344}, "id": 47821, "name": "Wipeout: The Game"}, {"genres": [10], "summary": "GameMill Entertainment brings the exciting world of DaGeDar to the gaming market via the Nintendo DS in time for the 2011 holiday season. Each DaGeDar holds a unique “spirit within” that offers advantage to the player during each race. Using sharp reflexes players do battle in a game of speed and skill as they race their DaGeDar ball to the end of a virtual raceway. Each raceway is composed lanes that loop, drop, climb and bank - but also contain blocks, and gaps that will knock the player off their game. 100 basic DaGeDar balls to unlock and choose from. Each ball carries abilities of Acceleration, Top Speed, Defense and Attack. Single or Multi-Player game play. 2 balls are in play at a time. 50 fast and furious raceways. Typical race time is 2-3 min.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/womobdop0iyxpcmfhn85.jpg", "width": 1056, "cloudinary_id": "womobdop0iyxpcmfhn85", "height": 946}, "id": 47924, "name": "DaGeDar"}, {"genres": [13], "summary": "Nintendogs (Japanese: ニンテンドッグス Hepburn: Nintendoggusu?) is a realtime pet simulation video game developed and published by Nintendo for the Nintendo DS handheld video game console. It was first released in Japan, and was later released in North America, Australia, Europe, and other regions. It was originally released in three different versions: Dachshund & Friends, Lab & Friends (Shiba & Friends in Japan), and Chihuahua & Friends. It has been re-released twice since then, first as a bundled release with a special edition Nintendo DS with a new version called Nintendogs: Best Friends, and then later as Nintendogs: Dalmatian & Friends. \n \nNintendogs uses the DS's touchscreen and built-in microphone. The touch screen allows the player to pet a dog, as well as to use various items that can be found or purchased. These range from balls and frisbees, to toys, to grooming supplies to keep the dogs happy. The microphone is used to call to the player's dog by speaking the name given to the dog in the beginning of the game as well as to teach the dog tricks such as \"sit\" or \"roll over\". Players can bring their dogs on walks and to the park if they so choose. They may interact with other players in multi-player by using the DS's wireless linkup. It also uses the DS's internal clock and calendar to allow the dog to grow hungrier or dirtier based on the elapsed time. \n \nNintendogs received critical acclaim. It has an aggregate score of 85% at Game Rankings,[3] and has won many awards, including the 2006 Innovation Award from PC World and Best Handheld Game from the Associated Press. As of March 31, 2015, all versions of Nintendogs combined have sold 23.96 million copies worldwide, making it second on the Nintendo DS best-sellers list, behind only New Super Mario Bros.[4] Because of Nintendogs' success, Nintendo has made several related products, including Nintendogs toys[5] and a series of Nintendogs trading cards.[6] At E3 2010, it was announced a sequel, titled Nintendogs + Cats, would be released for the Nintendo 3DS.", "id": 47944, "name": "Nintendogs: Lab & Friends"}, {"genres": [5], "summary": "Set on the Earth’s moon in the mid-21st century, in Moon, players take on the role of Major Kane. Chief of Military Operations for the Extra Terrestrial Encounter Organization (ETEO), you and your team have been brought in to investigate a series of strange happenings. Ever since the Roswell incident it has been clear that Earth has been visited by other beings, now a hundred years later it would seem that something similar may be happening on the moon. Contact with a distant lunar outpost was lost shortly after they reported discovery of a ‘hatch’ of alien origin during a routine excavation. What follows could be the next giant leap forward for mankind, but just what are we stepping into? Whatever it is, erratic energy readings from deep below the lunar surface has you thinking that it will not be a diplomatic mission. \n \nWelcome to the Moon Major.", "id": 21898, "name": "Moon"}, {"genres": [15], "summary": "In Yu-Gi-Oh! 5D's Stardust Accelerator: World Championship 2009, players can experience the most robust offering in the World Championship franchise to date with up to 2,800 playable cards. The title features multiple gameplay modes including Story Mode, where players journey from Satellite to Neo Domino City and duel with characters from the animated series in various situations. Players can also compete in the World Championship Mode, where head-to-head battles take place against Yu-Gi-Oh! gamers around the world. Offering more playable cards than any other Yu-Gi-Oh! World Championship title, Yu-Gi-Oh! 5D's Stardust Accelerator: World Championship 2009 includes playable cards from the latest booster pack \"Crimson Crisis,\" as well as three exclusive trading cards bundled in the package.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ktdr5eflo0vbgjuiku5t.jpg", "width": 640, "cloudinary_id": "ktdr5eflo0vbgjuiku5t", "height": 574}, "id": 21129, "name": "Yu-Gi-Oh! 5D's Stardust Accelerator World Championship Tournament 2009"}, {"genres": [4], "summary": "Naruto Shippuden: Ninja Destiny 2 features fast paced Naruto Shippuden 3D fighting action with the addition of an all-new Quest Mode, new characters, jutsu and a storyline based on the Naruto Shippuden animated series. The title also features wireless multiplayer gameplay, offering Naruto fans and newcomers to the series competitive 3D fighting on the Nintendo DS.", "id": 47935, "name": "Naruto Shippuden: Ninja Destiny 2"}, {"genres": [9], "summary": "Rebuild the all-conquering Roman Empire - in 3D! The best-selling Jewel Master series comes to the 3DS with its most successful brand to date - Cradle of Rome. \n \n Welcome back to Rome, where you are given powers of the greatest Emperor ever and are tasked with rebuilding this great civilization. Swap tiles to create matches of three or more identical tiles to gather gold and resources. The more you collect the faster you can erect beautiful houses and magnificent palaces. \n \n• 100 levels of addictive match-3 gameplay \n• Collect resources such as wood, food and gold \n• The more you collect, the faster Rome is built \n• Obtain special power-ups to aid your progress through difficult stages \n• The best-selling match-3 series now presented in glorious 3D", "id": 47830, "name": "Jewel Master: Cradle of Rome 2"}, {"genres": [10], "summary": "Nintendo DS racing game from Skyworks Technologies and Majesco. Jump behind the wheel of your favorite monster truck and race on 25 different all-terrain tracks in five different environments. Master eight different monster rides, each with different starting attributes. As you complete challenges, you can upgrade your monster trucks in the performance shops between races with the cash you earn by winning the races. Tear-up the tracks and put it all on the line with your friends via a four-person multiplayer mode.", "id": 47864, "name": "Monster Trucks DS"}, {"genres": [14], "summary": "Captain Tsubasa: Gekito no Kiseki (キャプテン翼 激闘の軌跡?) - known in Europe as Captain Tsubasa: New Kick Off - is a video game developed and published by Konami, which was released in 2010 to celebrate the 30th Anniversary of the Captain Tsubasa series.", "id": 47865, "name": "Captain Tsubasa: New Kick Off"}, {"summary": "Inspired by the Warner Bros. Pictures feature film and more than 60 years of DC Comics' lore. As the Man of Steel, you’ll hone your unworldly super powers such as Flight, X-Ray Vision, Heat Vision, Super Hearing, Super Strength, Super Speed, and Super Breath to fight villains that only Superman can defeat.", "id": 47867, "name": "Superman Returns: The Videogame"}, {"summary": "The Bratz are in their first year of high school! They're going to be the most fabulous friends ever to grace Carry Nation High School! But the school class president has different plans and breaks up the Bratz girls into designated cliques. The girls want to find a way to bring all the cliques in the school together...and what better way than through a fabulous talent show!", "id": 47872, "name": "Bratz 4 Real"}, {"genres": [15], "summary": "Become the greatest general of all time. \n \nIn Stratego: Next Edition you must demonstrate your strategic skills on the battlefield. Stratego' s unique game play pits you against opponents who will do everything in their power to outsmart you. Rise to the challenge and confront them in battle. Emerge victorious and you’ll become the greatest general of all time.", "id": 47886, "name": "Stratego: Next Edition"}, {"summary": "By combining a fast paced brick-and-paddle system along with great level design, we are bringing the fun and excitement in the vein of Breakout to a whole another level. This retro title has been enhanced with the better graphics, gameplay and the ability to use both screens. If you're a fan of action pinball, this title is for you. Utilize the features of the DS to add a new element of fun and control to the game as you bounce your magical orb through the labyrinth both horizontally and vertically. Use the shoulder buttons to rotate your paddles to shoot your orb in any direction. Find and utilize various power-ups throughout your journey to aid you in your fight against evil. There is a total of 5 levels (with several sub-levels within each) with new and unique challenges and varying environments. Each level has a unique end boss that must be defeated to continue. The game automatically saves your progress so you can come back and play (replay) a level at anytime.", "id": 47890, "name": "Classic Action: Devilish"}, {"genres": [13], "summary": "Create your own family of cute puppies and watch them grow with fun and individual personalities. Dress them, play with them and breed them with your friends' pets to produce unique babies!", "id": 47895, "name": "Petz: My Puppy Family"}, {"genres": [13], "summary": "FASHION IS FUN WITH LISA AND HER FRIENDS! \n \nLovely Lisa helps younger girls learn the importance of having fun and working hard while earning your way to your own fashion style! Earn Lisa-points by perfecting your beauty skills and techniques, helping out around the house and even learning what it takes to become a successful career girl! Providing a well-rounded approach to beauty and fashion, Lovely Lisa rewards girls with gorgeous accessories, original clothes and fabulous hairstyles and make-up! Prove you’ve got what it takes in the Heart Hills pageant-with-a-difference! Only the girl with the best skills in all categories can win – because after all, beauty is only skin deep!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kupeuv7smrtlwks3wy5x.jpg", "width": 1500, "cloudinary_id": "kupeuv7smrtlwks3wy5x", "height": 1348}, "id": 47911, "name": "Lovely Lisa and Friends"}, {"genres": [13], "summary": "Welcome to Hugsville! \n \nWelcome to Hugsville! Build-A-Bear Workshop mascots Bearemy and Pawlette Coufur guide you throughout this open-ended adventure. Explore the world, decorate your home, play games, or chat with friends! \n \nFeatures: \n \n• 13 playable furry friends to choose from and customize \n• Go on quests, build and create, play local wireless mini-games with your furry friends, and more! \n• 5 different \"Fun Zones\" featuring mini-games, including the Beach, Forest, Jungle, Desert and Icecap. \n• Collect items to unlock new gameplay and rewards.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/briftfkpksa5iqeohjq8.jpg", "width": 1000, "cloudinary_id": "briftfkpksa5iqeohjq8", "height": 897}, "id": 47913, "name": "Build-a-Bear Workshop: Welcome to Hugsville"}, {"genres": [9], "summary": "Scribblenauts Collection is a Nintendo DS game featuring both Super Scribblenauts and the original Scribblenauts. The package includes both game cartridges, each with their respective levels, objects, and features.", "id": 47914, "name": "Scribblenauts Collection"}, {"genres": [9], "summary": "Take a picture and make your own unique puzzle using the camera in your Nintendo Dsi System. \nSolve a puzzle by yourself, or compete with a friend in a head-to-head race to be the first to complete a jigsaw puzzle. \nPlay against the clock to earn medals and unlock new pictures and mini-games in time challenge mode.", "id": 47919, "name": "Jigapix Wild World"}, {"genres": [31], "summary": "Sesame Street: Elmo's A-to-Zoo Adventure is a Sesame Street video game released on October 19, 2010 from Warner Bros. Interactive Entertainment for the Wii, the Nintendo DS, and Windows. \n \nThe Wii version will come packaged with an Elmo \"gameplay helper\", a soft plush cover for the Wiimote that hides unnecessary buttons from the preschool player's busy fingers. The DS version comes with a special stylus.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j5cdkelby7qbccnrbrwb.jpg", "width": 1542, "cloudinary_id": "j5cdkelby7qbccnrbrwb", "height": 1382}, "id": 47920, "name": "Sesame Street Elmo's A-to-Zoo Adventure the Videogame"}, {"summary": "That's So Raven: Psychic on the Scene is a point-and-click video game that is based on the TV series That's So Raven. In the video game, Raven has to stop the Thompson theater from closing. \n \nGameplay: \nThe player has to go through many places while collecting items and talking to characters. The only way for the player to get inside certain areas is by making Raven change into a disguise. There is a fashion area of the game where the player can change how Raven looks in a variety of ways. There is a small number of mini-games. \n \nReception: \nLucas M. Thomas of IGN said that, \"Most games like this deserve ridicule, but that this one doesn't because the fans will like it. \"Common Sense Media said that the game is well-designed and that it has high entertainment value, but that the game might be too easy for some kids. Matt Paddock of Game Vortex said that the only flaw is the bad grammar and negative talk.", "id": 47951, "name": "That's So Raven: Psychic on the Scene"}, {"genres": [7], "summary": "Rock University Presents: The Naked Brothers Band The Videogame is an interactive music experience based on the highly successful Nickelodeon series. Band Manager Cooper has secured a nationwide tour for the Naked Brothers Band. The journey to success, however, is not going to be easy. Players will experience the real superstar life of the Naked Brothers Band on tour while playing instruments and singing along to 25 of their favorite Naked Brothers Band songs. \n \nFeatures: \n \n• Be a Rock Star! Play as each of the members of the Naked Brothers Band on five different instruments and vocals \n• Rock Out with Friends! 2 player functionality allows you to challenge your friends to see whose band is better \n• Run the Stage Show! Control the lights, pyrotechnics and other special effects \n• Manage the Band! Capture the perfect video footage to drum up PR \n• Head to the Recording Studio! Re-compose some of your favorite songs and share your creations with friends \n• Unlock up to 14 Naked Brothers Band songs and upgrade with new instruments, stage effects, outfits, cameras and more", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uae5slsgzrrfexx5rpox.jpg", "width": 1000, "cloudinary_id": "uae5slsgzrrfexx5rpox", "height": 896}, "id": 47955, "name": "The Naked Brothers Band: The Video Game"}, {"summary": "Go on a healthy habits adventure with your favorite Sesame Street friends! Join Grover, Elmo, and Abby Cadabby on an exciting obstacle course that encourages healthy habits through fun, active gameplay. \n \nFeatures: \n \n• Promotes healthy habits for life including physical activity, good nutrition, hygiene, and rest and relaxation. \n• Provides easy to follow audio-visual directions. \n• Nintendo DS version includes a Grover Jumbo Click Stylus, making it easier for your child to grip and play.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pmtssgavw6qw7bc5nlzr.jpg", "width": 1000, "cloudinary_id": "pmtssgavw6qw7bc5nlzr", "height": 918}, "id": 47954, "name": "Sesame Street: Ready, Set, Grover! With Elmo the Videogame"}, {"genres": [5], "summary": "The Earth Defense Forces attempts to ensure the Earth's continued security by monitoring the future with the help of their own time machine, but both their agent and a special team sent there have been confirmed MIA. Knowing something is wrong, General Graves sends in the famous Duke Nukem.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/n5bvadufu2r06wdrnvuv.jpg", "width": 1080, "cloudinary_id": "n5bvadufu2r06wdrnvuv", "height": 970}, "id": 47967, "name": "Duke Nukem: Critical Mass"}, {"genres": [7], "summary": "With Guitar Rock Tour you can perform the guitar and drum tracks of the most popular worldwide hits on your NintendoDS and live the most explosive musical experience on the DS! Targeted for all audiences, Guitar Rock Tour features solo and multiplayer modes where beginners can have loads of fun right from the start and fans of music games can discover plenty of nuances. Without any musical knowledge, learn how to quickly master the basic controls of each instrument by using the Nintendo DS-s Touch Screen or buttons and kick off your career as a rock star!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yvu2kwjurmuyhfrpqw37.jpg", "width": 256, "cloudinary_id": "yvu2kwjurmuyhfrpqw37", "height": 384}], "id": 21261, "name": "Guitar Rock Tour"}, {"genres": [13], "summary": "Adopt your very own family of hamsters! Care for them, teach them fun tricks and unlock new toys and accessories to give them lots of love! Care for your hamsters by feeding them, playing with them and keeping them clean and warm. Discover your hamsters' unique personalities - watch them react with cute and funny facial expressions. Teach your hamsters fun activities like bowling or running on ramps and watch them progress. Earn coins that can be used to unlock new toys and accessories for your lovable hamsters.", "id": 47972, "name": "Petz: Hamster Superstar"}, {"genres": [13], "summary": "Play with your style! \n \nTake your picture with the Nintendo DSi camera and use it to create your very own face in the game! Ever wonder what you look like with curly hair? Black hair? Or midnight blue eyeshadow? You can perfect your unique look by experimenting with different makeup and hairstyles. Win points playing fun minigames, and use them to shop for new beauty products! \n \nFeatures: \n \n• Become Part of the Game \n• Take your picture with the Nintendo DSi and use it to create your own face in the game! \n• Find the perfect styles to suit your facial features. \n• Transform Yourself \n• Take on beauty challenges to improve your skills and earn points and rewards. \n• Learn new tips and tricks \n• Discover your own unique style with personality tests and in-game expert recommendations. \n• Unleash your creativity in free mode… your imagination has no limits! \n• Share Your Style \n• Take pictures of your friends and give them makeovers with your new expertise! \n• Use your mini-game points to go shopping for new beauty products and send them to friends. \n• Share your new looks with friends via local wireless.", "id": 47980, "name": "Style Lab Makeover"}, {"summary": "It's time to hit the town! Explore new worlds, customize accessories, and enjoy awesome mini-games, and collect six exclusive city pets with The Littlest Pet City Friends! \n \nThe Littlest Pet Shop: Friends series brings the party to you with a new cast of quirky pets and their best friends. Play tons of new mini-games and explore new towns with your favorite pets. \n \nWith enhanced multiplayer features, you can even double your fun by playing with your best friend! Venture on quests, deliver invitations, serve up ice cream, and style your pets as you get ready for the biggest Littlest Pet Shop party of the year. And be prepared for a few surprises along the way, like an all-new mystery pet that just might show up at your party!", "id": 48022, "name": "Littlest Pet Shop: City Friends"}, {"genres": [13], "summary": "Cooking Mama World: Hobbies & Fun gives DS owners the chance to try their hand at a variety of home crafting activities such as pottery, woodwork, jewellery design, origami and many more. Following Mama's careful instructions, players will be shown how to create a selection of gadgets and trinkets, including a bird box, necklace, kaleidoscope, cushions and patchwork quilts.", "id": 47957, "name": "Cooking Mama World - Hobbies & Fun"}, {"genres": [7], "summary": "The first music-driven puzzle game for the Nintendo DS, Honeycomb Beat features intuitive touch screen gameplay and more than 200 unique puzzles to energize your mind. Solve each puzzle by touching on a Honeycomb tile, which will change the colors of the tiles around it. Line up tiles of the same color to eliminate them or create different shapes and patterns. Solve mind-bending challenges of increasing complexity in Puzzle Mode, or play through Evolution Mode where the board advances upwards and you have to eliminate lines before it's too late.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/fvza7h1lmbkawkvsxds7.jpg", "width": 256, "cloudinary_id": "fvza7h1lmbkawkvsxds7", "height": 384}], "id": 20685, "name": "Honeycomb Beat"}, {"genres": [31], "name": "LEGO Chima: Laval's Journey", "videos": [{"video_id": "um3Ch7g4y5w", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/am3cepxorp7j6lt32veb.jpg", "width": 1514, "cloudinary_id": "am3cepxorp7j6lt32veb", "height": 1370}, "summary": "As with other Lego video games, the gameplay is platform based with characters having a unique set of skills to help them progress through the levels in different ways. While the game starts out with the player controlling Laval as the main player, more characters become playable as the game progresses. There are more than 60 playable characters in Lego Legends of Chima: Laval’s Journey, with fifteen levels to battle through. Any tribe of Chima may be played, including lions, eagles, gorillas, rhinoceri, crocodiles, bears, ravens, and nomads, such as Skinnet.", "id": 48046}, {"genres": [13], "name": "Cooking Guide Can't Decide to Eat?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zz4geccdo9iogt0gihrw.jpg", "width": 1500, "cloudinary_id": "zz4geccdo9iogt0gihrw", "height": 1332}, "summary": "Want to make yourself a quick dinner after a long day at work? Want to plan a week of meals for your family? Or do you want to make a Sunday roast for 10? Cooking Guide can help you solve all these and many other meal dilemmas. Choose from 250 recipes from all over the world. Cooking Guide takes you through every step from compiling a shopping list, preparation of ingredients and utensils through to a step-by-step guide of how to make your chosen meal. \n \nInteractive cooking aid that takes you through 250 recipes from scratch. \n \n- Takes the user through every stage of cooking - from purchasing ingredients in the supermarket through to each stage of cooking. \n \n- The recipes are enhanced with many demonstrational videos which go beyond the capabilities of printed cook books offering a blend between a traditional cookbook and a DVD but in a more convenient package. \n \n- Additional functionalities are included to facilitate the cooking and preparation process, including a shopping list application, the ability to add notes, timers and quantity calculators for all recipes. \n \n- The software guides the user through a recipe by enunciating the cooking instructions and can be voice controlled while cooking.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/iop5xgp20fjh2elidp3b.jpg", "width": 1500, "cloudinary_id": "iop5xgp20fjh2elidp3b", "height": 1333}], "id": 48047}, {"genres": [9], "summary": "Sokoban est un jeu de réflexion sur Nintendo DS. Ce titre remet sur le devant de la scène le vieux jeu de casse-tête : vous devez sortir plusieurs caisses des différents niveaux, parfois avec des mouvements limités. Le titre propose un tutoriel, un mode deux joueurs, trois niveaux de difficulté et 250 niveaux de jeu.", "id": 47946, "name": "Sokoban"}, {"summary": "Méthode Mathématique Du Professeur Kageyama sur DS vous fait réviser vos bases mathématiques afin que vous puissiez briller en société lors de la résolution d'une équation à inconnues multiples. Le titre s'appuie sur une méthode japonaise visant à apprendre l'arithmétique en faisant faire des opérations via un tableau rempli de chiffres qu'il faut compléter, à travers 20 niveaux de difficulté et 40 exercices proposés.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/lgutyk3qfszz3ji5gtyp.jpg", "width": 480, "cloudinary_id": "lgutyk3qfszz3ji5gtyp", "height": 336}], "id": 21507, "name": "Professor Kageyama's Maths Training"}, {"genres": [12], "summary": "Metal Fight Beyblade: Bakutan Cyber Pegasus is a Role-Playing game, developed by Amble and published by Hudson, which was released in Japan in 2009.", "id": 48033, "name": "Beyblade: Metal Fusion Cyber Pegasus"}, {"genres": [13], "summary": "Now you can become \"The Biggest Loser\" in the comforts of your own home! Shape and tone your body with our interactive fitness video game. Our amazing trainers Bob Harper and Jillian Michaels guide you along the way with their expert advice and their unique motivation styles. Choose a 4, 8 or 12 week program and The Biggest Loser fitness game builds a workout and nutrition plan for you so you can reach your fitness goals. Trust us: it's not just a workout for the thumbs, it's a workout for the entire body - and the entire family. With the Nintendo DSi and DS, you'll find a convenient way to stay focused on your regimen - even when you're on the go! Want to know how much that burger will cost you in calories, or what exercises you can do easily without equipment when you’re on vacation? All of that information and more is right in your hands", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ejqsjniuabwkxmyj7iux.jpg", "width": 1000, "cloudinary_id": "ejqsjniuabwkxmyj7iux", "height": 902}, "id": 48035, "name": "The Biggest Loser"}, {"genres": [13], "summary": "You'll never find a cuter, more attractive bundle. On Oct. 24, Nintendo started offering a limited-edition bundle featuring a specially colored Nintendo DS system and a \"Best Friends\" edition of the best-selling Nintendogs. The special bundle-only version of Nintendogs will let owners start with the six most popular breeds chosen from the three Nintendogs editions.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/k6e9hmenuvdoafgk092f.jpg", "width": 1532, "cloudinary_id": "k6e9hmenuvdoafgk092f", "height": 1370}, "id": 47727, "name": "Nintendogs: Best Friends"}, {"genres": [9], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w1egbcnimphgrx0spnk3.jpg", "width": 1544, "cloudinary_id": "w1egbcnimphgrx0spnk3", "height": 1370}, "id": 23822, "name": "Mechanic Master"}, {"genres": [31], "summary": "This action-adventure title is presented in a third person, pseudo-3D manner, meaning all the game-models are rendered in full 3D, but the world the player travels around in is pre-rendered. When played, the Nintendo DS is held sideways, as in Hotel Dusk: Room 215 and Brain Age: Train Your Brain in Minutes a Day!. The left screen shows the area map, while the right displays the main gameplay, when set for right-handed play, and reverse when set for left-handed play. \nSet six months after Ninja Gaiden, Ryu Hayabusa has rebuilt the Hayabusa Village. When fellow villager and kunoichi, Momiji, is kidnapped by the Black Spider Ninja Clan, he is forced to find her, while uncovering the secrets behind the mysterious Dark Dragonstones and their relation to the Dragon Lineage", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/wdclvndlk8lj19odqq7d.jpg", "width": 384, "cloudinary_id": "wdclvndlk8lj19odqq7d", "height": 256}], "id": 21466, "name": "Ninja Gaiden: Dragon Sword"}, {"genres": [13], "summary": "Nintendogs (Japanese: ニンテンドッグス Hepburn: Nintendoggusu?) is a realtime pet simulation video game developed and published by Nintendo for the Nintendo DS handheld video game console. It was first released in Japan, and was later released in North America, Australia, Europe, and other regions. It was originally released in three different versions: Dachshund & Friends, Lab & Friends (Shiba & Friends in Japan), and Chihuahua & Friends. It has been re-released twice since then, first as a bundled release with a special edition Nintendo DS with a new version called Nintendogs: Best Friends, and then later as Nintendogs: Dalmatian & Friends. \n \nNintendogs uses the DS's touchscreen and built-in microphone. The touch screen allows the player to pet a dog, as well as to use various items that can be found or purchased. These range from balls and frisbees, to toys, to grooming supplies to keep the dogs happy. The microphone is used to call to the player's dog by speaking the name given to the dog in the beginning of the game as well as to teach the dog tricks such as \"sit\" or \"roll over\". Players can bring their dogs on walks and to the park if they so choose. They may interact with other players in multi-player by using the DS's wireless linkup. It also uses the DS's internal clock and calendar to allow the dog to grow hungrier or dirtier based on the elapsed time. \n \nNintendogs received critical acclaim. It has an aggregate score of 85% at Game Rankings,[3] and has won many awards, including the 2006 Innovation Award from PC World and Best Handheld Game from the Associated Press. As of March 31, 2015, all versions of Nintendogs combined have sold 23.96 million copies worldwide, making it second on the Nintendo DS best-sellers list, behind only New Super Mario Bros.[4] Because of Nintendogs' success, Nintendo has made several related products, including Nintendogs toys[5] and a series of Nintendogs trading cards.[6] At E3 2010, it was announced a sequel, titled Nintendogs + Cats, would be released for the Nintendo 3DS.", "id": 47710, "name": "Nintendogs Dachshund & Friends"}, {"genres": [9], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wfcvef8u7uxyqbsles8w.jpg", "width": 1477, "cloudinary_id": "wfcvef8u7uxyqbsles8w", "height": 1477}, "id": 24365, "name": "Jewel Master: Cradle of Athena"}, {"id": 47791, "name": "Harvest Moon: Frantic Farming"}, {"genres": [9], "summary": "Think and react fast in this frantic puzzle game fit for everyone. Touch, aim, and drop the perfect shot to destroy the rising lava rocks. Match three or more of the same colored rocks and witness the intensity of the action as your dinosaur supporters aid you with mind-blowing attacks.", "id": 47778, "name": "Rock Blast"}, {"genres": [7], "summary": "A guitar-playing Nintendo DS game.The Nintendo DS touch screen represents a guitar's strings and the D-pad / buttons become the fingered chords. By \"strumming\" on the virtual strings you'll play the chord that you've selected on the D-pad. The tool recognizes both up and down strums at half and full velocities, and you'll hear the subtle changes to the chord in the different ways to play them.", "id": 47925, "name": "JAM sessions"}, {"summary": "Get ready for the total Build-A-Bear experience on Nintendo DS! Make your own Build-A-Bear, dress it up, play with it in lots of funny activities and mini games! The Bear will be like a virtual extension of yourself and a personal companion you can love like a best friend. You must make sure you satisfy its daily needs as physical affection, fun, food, learning, social life and trendyness are all necessary elements for the Bear to be balanced and happy. A highly interactive and trans-generational game in the true Build-A-Bear spirit!", "id": 47811, "name": "Build-A-Bear Workshop"}, {"genres": [13], "summary": "The My Secret Diary game for Nintendo DS allows you safely store all of your secrets in a fun and exciting new way. You can keep a journey that is protected by a password - so you won't have to worry about somebody finding your key. My Secret Diary also features numerous mini-games as well as personality tests, fortune cookies, and a crystal ball. This interactive Nintendo DS game even lets you send secret messages and event invitations to your My Secret Diary friends.", "id": 47799, "name": "My Secret Diary"}, {"genres": [15], "summary": "Yu-Gi-Oh! 5D's World Championship 2010: Reverse of Arcadia's story mode proceeds with a parallel story arch from the animated series involving the reprise of the Dark Signers and their quest for supremacy over New Domino City. After being banned to the Underworld, these Earthbound Immortals will stop at nothing to overthrow the rule of New Domino City and destroy Satellite. To defeat them, players will enlist the help of some of their favorite characters from the Yu-Gi-Oh! universe! Compete in story mode or free duel mode against Jack, Yusei or any of the 20 new characters to take on the Dark Signers in an epic battle to settle the score between light and dark!", "id": 47841, "name": "Yu-Gi-Oh! 5D's World Championship 2010: Reverse of Arcadia"}, {"genres": [15], "summary": "In Hotel Giant DS you play as an ambitious hotel director, who dreams of turning a simple motel into a luxurious hotel. But beware of competition and VIPs; they can push you to bankruptcy!", "id": 47934, "name": "Hotel Giant DS"}, {"summary": "Mobile Suit Gundam 00, is a 3D action video game for the Nintendo DS based on the anime, Mobile Suit Gundam 00. The game involves four main characters who control their mobile suits, performing interventions against various conflicts around the world. It was developed by BEC and produced by Namco Games.", "id": 47870, "name": "Mobile Suit Gundam 00"}, {"genres": [31], "id": 47873, "name": "Nanashi no Game: Me"}, {"genres": [13], "summary": "In I Love Beauty: Hollywood Makeover players style the stars as they select the most stunning outfits, accessories, and the perfect makeup for all of the glamorous events around Hollywood. With 36 different cosmetics to mix and match in more than 60 variations, I Love Beauty: Hollywood Makeover will test the \"fashion eye\" of even the most creative stylist and is just the thing for girls who like to have fun and look their best.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l9zd8tbiaqdachwx7tg6.jpg", "width": 1500, "cloudinary_id": "l9zd8tbiaqdachwx7tg6", "height": 1356}, "id": 47849, "name": "I Love Beauty: Hollywood Makeover"}, {"genres": [10], "summary": "Based on the popular animated series airing on ABC Family and Toon Disney, Dragon Booster is a fast paced 3rd person racing/action game set in a fantastical world where humans and dragons co-exist. When their peaceful way of life is disrupted, Beau, a legendary dragon, chooses Artha Penn, an ordinary 16-year old, to become a mythical hero known as the Dragon Booster. In this classic tale of good versus evil, Artha must use his new-found abilities to defeat his foes and unite humans and dragons once and for all.", "id": 47891, "name": "Dragon Booster"}, {"genres": [7], "summary": "Do you want to travel the world? Do you want millions of people to know your name and to sing your songs? Do you want to become a pop star? Make your dreams come true! \n \nYou are the leader of the hottest new band around. But, before you can make the charts you have to get creative. Compose your own music on 3 different instruments, learn to play famous songs and have tons of fun playing together with your friends. Make your wish come true – the stage is yours! \n \nFeatures: \n \n• Learn and play famous songs and styles \n• Play 3 different instruments and write your own songs (single or multi-player function) \n• Play solo mode, or join your friends for co-op or duel play", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zx8zrqfmdqvbfubkxlmu.jpg", "width": 1500, "cloudinary_id": "zx8zrqfmdqvbfubkxlmu", "height": 1347}, "id": 47915, "name": "Monster Band"}, {"genres": [5], "summary": "One Halloween evening, young piglet Cliffy Belmart and his rebellious friends decide to test their bravery by tee-peeing Barnyard Town's Ancient Castle ruled by Darkness. But as soon as the fun begins, horrendouse evil trees sweep them all into the castle. Instantly aware of his son's peril, Robert Belmart equips himself with a slew of weapons and a plan to get Cliffy back. But first, Robert must tackle six different spooky worlds - each with their own tough monsters and dangerous bosses. Is Robert a bad enough dude to rescue his son? In Barnyard Blast, you control Robert Belmart, the Swine of the Night. Through 6 levels you kill zombies, exterminate monsters, slash ghouls, and more! \n \nVintage shooting and platform gameplay with simple, intuitive controls \nHilarious characters and scenes combined with intense, state-of-the-art fighting \nSix long and unique levels: A Night Walk in the Graveyard, The Ancient Castle Ruled by Darkness, The Volcano BBQ, The Old Creepy Wooden Jail, The Forest in the Way, and The Castle of Intolerable Pain \nChallenging enemies and bosses including Pumpkin Zombies, Assassin Rats, Evil Trees, and Sinister Monkeys \nA collection of weapons (whip, shotgun, gun, dynamite), items and upgrades", "id": 47917, "name": "Barnyard Blast: Swine of the Night"}, {"genres": [12, 31], "summary": "While searching for the fabled Timeless Power gem to power his Airship, Cid and his partner Chocobo ended up being sucked into a vortex and end up in the quaint town of Lostime within the island of Memoria, which disappeared from the rest of the world fifty years ago. In the center of Lostime is a clock tower which rings the Bell of Oblivion that makes everyone lose their memories. Along with his new friend Shirma and a mysterious boy named Raffaello who is able to create a labyrinth of memories, Chocobo has to recover the lost memories of Lostime's residents. However, these actions reveal the mystery behind Raffaello and the calamity that began the trouble. The DS port features a new storyline centering on Cid, as well as new jobs for characters to learn.", "id": 47875, "name": "Cid and Chocobo's Mysterious Dungeon: Labyrinth of Forgotten Time DS+"}, {"summary": "Based on the popular TV show, The Backyardigans allows players to tap, blow, scribble, shout and drag their way through over 24 mini-games. Players can also sail the seas, navigate a spaceship and fight villains as super heroes.", "id": 47879, "name": "The Backyardigans"}, {"genres": [9], "summary": "GAME DETAILS \nWords, words, words! \n \nThey're the fundamentals of language. They comprise how we communicate and how effectively we can express opinions and succeed at fulfilling our dreams. One of the earliest brain teasers was the Spelling Bee. Recently, we've been experiencing an upsurge in popularity and fascination with word games. \n \nOn Broadway, people are flocking to the musical 25th Putnam County Spelling Bee. In the movies, the recent Akeelah and the Bee, and Spellbound became surprise hits with millions of fans. The primal challenge to see how many words you can spell correctly to win the game. It's the game that took over as brains rose in significance over brawn. Unlike Akeelah, who had to carry thousands of cards to practice for her Spelling Bee challenges, all you need is the Nintendo DS and Crave's Spelling Challenges and More. It's for Spellin Bee aspirants and for future literati (did I spell that correctly?). \n \nSpelling Challenges and More! is themed around a spelling game show \" where you compete for points and prizes but also is much more! Of course, there's only one winner. Will it be you? Designed for ages 6 and over ESRB is E for Everyone - Fun and educational word challenges for Everyone How many spelling errors can you find in this dscription? \n \nBe challenged from over 25,000 words to spell \nChoose from 100 difficulty levels \nCompete in 11 different games", "id": 47952, "name": "Spelling Challenges"}, {"genres": [9, 15], "summary": "Prepare for Battle! \n \nGogo’s Crazy Bones are small, colorful, figurines with endless gaming, collecting and learning possibilities. Developed by Magic Box International and PPI Worldwide Group and distributed in the US by JDNA, the collectable sensation has taken the toy market by storm, topping collectables sales charts around the world. Players will find Gogo’s Crazy Bones the game jam-packed with more than 70 puzzles and 30 favorite Gogo’s to collect, each one with a unique name, design, personality and special ability. Unlock five Gogo’s in every level as you take on popular Gogo’s games like Knock Out, Battle and Basket Attacks. Earn stars and unlock rewards as you explore interactive environments from the bus stop to the playground. Gogo’s Crazy Bones the game provides hours of fun and entertainment as you collect, trade and play with friends!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kkjnn73gv0ri3ud8pc8f.jpg", "width": 1539, "cloudinary_id": "kkjnn73gv0ri3ud8pc8f", "height": 1382}, "id": 47901, "name": "Gogo's Crazy Bones"}, {"genres": [13], "summary": "Experience life in an Aquatic Park on a paradise island \n \nLive the dream of training and caring for dolphins on an island paradise! In Petz Wild Animals Dolphinz for Nintendo DS™, you'll care for dolphins, killer whales, penguins, and more in an exciting aquatic park and marine sanctuary. \n \nRescue endangered animals and save their aquatic home. Keep your animals healthy, happy, and well trained, and more friends of nature will visit your park. The more visitors, the more resources you have to pamper your animals and transform your park into an all-star attraction. \n \nLearn to take care of the different animals (dolphins, killer whales, penguins, pink flamingos…) and also help to develop the sanctuary and make it larger so that it can welcome even more endangered animals. \nThe animals need a lot of attention: they need to be fed, taken care of, entertained and trained, in order to get them to amaze audiences with their special tricks. \n \nThanks to wireless connections, you will be able to invite your friends to your park to check out your animals.", "id": 47902, "name": "Petz Wild Animals: Dolphinz"}, {"summary": "Use the Nintendo DSi camera to take photos that’ll spawn monsters and bring them to battle! As you win and grow, you’ll collect better cameras to snap more photos and create more powerful monsters! Adventure through a universe of over 100 levels snapping photos using the Nintendo DSi camera. Advanced color recognition will take your photos and generate monsters which you can take and battle other monsters throughout the game. Build your monsters, upgrade their powers and provide increased weapons and fighting power to wreak havoc on your duelist partners! It's an adventure that encourages creative photography, where the photos you take have lasting effects on the total gameplay.", "id": 47903, "name": "Foto Showdown"}, {"genres": [13], "summary": "GAME DETAILS \nYour Horse, Your Friend, Your Champion! \n \nIt’s the ultimate dream, a horse to call your own. Learn what it takes to become a champion, keep your horse happy and fit by feeding, cleaning and riding him. Then get ready to compete. You’ll earn prestige, money to buy your horse treats, and unlock the ultimate dream horse! \n \nSelect the horse of your dreams from three breeds and give your new foal a name \nLearn the basics of riding, jumping and caring for your horse \nCompete in events like cross country, dressage, and jumping \nEarn money to spend at the store and purchase riding outfits, equipment or special treats for your horse \nEarn prestige awards to unlock in-game bonuses, including an additional horse breed", "id": 47948, "name": "Horse Life"}, {"genres": [14], "summary": "Become a World Champion! When you want to be the best you have to beat the best. This means taking on and defeating Earl \"the Pearl\" Strickland, Efren Reyes, Francisco Bustamante, Ronnie O’Sullivan and current World Champion Daryll Peach - and that's just what you can do in World Cup of Pool! \n \nFully licensed with over 60 of the best players from around the world \n \nThe top screen displays the whole table - use the touch screen for close action shots \n \nNumerous un-lockable extras include new cues, ball sets and table designs \n \nUnique Hall of Fame trophy room to track your career", "id": 47963, "name": "World Cup of Pool"}, {"genres": [9], "summary": "With thousands of Sudoku and Picture Logic puzzles, you can have fun and improve your mind! You can track how you are improving in the Challenge Me mode, or just pick up & play a quick sudoku puzzle. With hours of gameplay Challenge Me: Brain Puzzles will stimulate you for hours!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ir9tmcvhd3m7ctwpxzju.jpg", "width": 600, "cloudinary_id": "ir9tmcvhd3m7ctwpxzju", "height": 543}, "id": 21640, "name": "Challenge Me: Brain Puzzles"}, {"genres": [9], "summary": "Mario vs. Donkey Kong: Minis March Again! (マリオVSドンキーコング ミニミニ再行進!? Mario tai Donkī Kongu Mini Mini sai Kōshin!) is a puzzle video game for the Nintendo DSi. Announced at the Electronic Entertainment Expo 2009, it is the third game in the Mario vs. Donkey Kong series. It was released via the Nintendo DSiWare download service in North America on June 8, 2009, in Europe and Australia on August 21, 2009 and in Japan on October 7, 2009. It is the first DSiWare game to feature a level editor in which players can create custom-made levels and send them to players on other devices via a wireless Internet connection.", "id": 48032, "name": "Mario vs. Donkey Kong: Minis March Again!"}, {"genres": [12, 15], "summary": "The Story So Far... When a strange girl hands Ernesto, the young prince of Valencia, a mysterious sword and tells him to save his friends, he thinks nothing of using the magical blade to fight off an undead attack. Little does he know that such a small choice will spark a war that will rage across the continent of Yulamecca and beyond... \"Hero's Saga Laevatein Tactics really brings back the spirit of SRPGs of old,\" said Frank \"Bo\" deWindt II, Project Lead, Aksys Games. \"You can definitely see bits and pieces of many SRPGs, like Ogre Battle and Tactics Ogre, lending their influence to help inspire a stellar game.\"", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ee1t8kgsh0pemdaxcur6.jpg", "width": 256, "cloudinary_id": "ee1t8kgsh0pemdaxcur6", "height": 384}], "id": 21034, "name": "Hero's Saga Laevatein Tactics"}, {"genres": [9], "summary": "The challenging thinking game goes to the next level. Take a trip to exotic places around the world and find extraordinary treasures of human history. More than 300 demanding puzzles on 16 different maps await you. New gaming pieces such as snakes, switches and ice stones make \"Know How 2\" even trickier. With a freely rotatable playing area and the option of undoing your moves as often as you want, you will always have an overview of the current state of play.", "id": 47713, "name": "Treasure Chase"}, {"summary": "A new fun and crazy action/adventure game in which you control a team of unlikely heroes with suspicious biography to undertake the maddest quest ever. \n \nPlay a delirious trio: Glandalf, the cinema loving wizard, Luigi, the failed thief, and Extermino, the executioner who thinks with his axe rather than his head! Visit the huge dungeons scattered with countless traps, repel the onslaught of hundreds of wild creatures haunting the place and determined to stand in your way, and solve dozens of riddles and puzzles. From the Pirates caves to the heart of the Egyptian pyramids, through the corridors of the Dracula's castle, Dungeon Raiders will carry you into the world's craziest places through the most delirious quest.", "id": 47714, "name": "Dungeon Raiders"}, {"summary": "Nintendogs (Japanese: ニンテンドッグス Hepburn: Nintendoggusu?) is a realtime pet simulation video game developed and published by Nintendo for the Nintendo DS handheld video game console. It was first released in Japan, and was later released in North America, Australia, Europe, and other regions. It was originally released in three different versions: Dachshund & Friends, Lab & Friends (Shiba & Friends in Japan), and Chihuahua & Friends. It has been re-released twice since then, first as a bundled release with a special edition Nintendo DS with a new version called Nintendogs: Best Friends, and then later as Nintendogs: Dalmatian & Friends. \n \nNintendogs uses the DS's touchscreen and built-in microphone. The touch screen allows the player to pet a dog, as well as to use various items that can be found or purchased. These range from balls and frisbees, to toys, to grooming supplies to keep the dogs happy. The microphone is used to call to the player's dog by speaking the name given to the dog in the beginning of the game as well as to teach the dog tricks such as \"sit\" or \"roll over\". Players can bring their dogs on walks and to the park if they so choose. They may interact with other players in multi-player by using the DS's wireless linkup. It also uses the DS's internal clock and calendar to allow the dog to grow hungrier or dirtier based on the elapsed time. \n \nNintendogs received critical acclaim. It has an aggregate score of 85% at Game Rankings,[3] and has won many awards, including the 2006 Innovation Award from PC World and Best Handheld Game from the Associated Press. As of March 31, 2015, all versions of Nintendogs combined have sold 23.96 million copies worldwide, making it second on the Nintendo DS best-sellers list, behind only New Super Mario Bros.[4] Because of Nintendogs' success, Nintendo has made several related products, including Nintendogs toys[5] and a series of Nintendogs trading cards.[6] At E3 2010, it was announced a sequel, titled Nintendogs + Cats, would be released for the Nintendo 3DS.", "id": 47707, "name": "Nintendogs Chihuahua & Friends"}, {"genres": [31], "summary": "It’s “All for one and one for all” as Barbie and her friends star together in Barbie and the Three Musketeers, a classic story with a girl power twist! Join Barbie on the adventure of a lifetime! Play as Corinne, a girl from the French countryside who dreams of becoming a musketeer. Joined by three other musketeer hopefuls, together the girls will use their unique abilities to tackle obstacles and puzzles across a dozen locations from the movie. Ultimately, through the power of friendship and teamwork the girls uncover a plot against the prince and save the day, achieving their dreams and becoming true musketeers! \n \nPlay as Barbie's character Corinne or one of her Three Musketeers friends - Viveca, Renee, or Aramina \nEach character possesses different and unique abilities that help you complete missions ? specialties that include grapples, ribbon whips, Chinese fans, leaping and dancing \nExplore the environment ? from the French countryside to Paris \nSolve challenging puzzles and discover treasures on your journey to save the Prince", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vjxgs72g8fjdkxefwgtl.jpg", "width": 1500, "cloudinary_id": "vjxgs72g8fjdkxefwgtl", "height": 1500}, "id": 45176, "name": "Barbie and the Three Musketeers"}, {"genres": [9, 15], "name": "Amoebattle", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/v9ki9ulqxzk5aw6swsbl.jpg", "width": 432, "cloudinary_id": "v9ki9ulqxzk5aw6swsbl", "height": 636}, "summary": "Built from the ground up, Amoebattle delivers a portable twist to the real time strategy genre and brings the experience to the palm of your hand. Intuitively command your troops using the Touch Screen as you discover interesting types of amoebas, journey through fantastic environments, and lead your amoebas to victory in battle…Amoebattle!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/c4q2kked5j2zehrqmrem.jpg", "width": 433, "cloudinary_id": "c4q2kked5j2zehrqmrem", "height": 650}], "id": 21733}, {"genres": [9, 31], "summary": "Cookie & Cream is an action/platformer where players navigate their way through challenging terrain on the top screen while solving puzzles and disarming traps on the touch screen below. Played as either a single-player game where one person controls both characters, or a cooperative game where one player maneuvers Cookie on the top screen while the other is in charge of Cream on the touch screen, Cookie & Cream is a unique combination of gaming genres. Single player game lets you use directional button and touch pen to control two characters at once. Cooperative game lets you and a friend work together to advance through levels. Wireless compatible for co-op play and WiFi compatible for four-player battles. Download play mode allows two to play select stages off one Game Card. Eight diversely themed worlds to traverse, including Desert World, Music World, Trick World and Water World. Nine challenging minigames to explore. [Agetec, Inc.]", "id": 47704, "name": "Cookie & Cream"}, {"summary": "The stars have fallen from the sky! The only thing that can help the stars regain their power is the haloes that were scattered all over Kurupoto Island when they fell. As a star worshipper, it is up to you, the Kurupoto, to free these haloes from the puzzles they are stuck in and get your beloved stars shining in the sky once more.", "id": 47794, "name": "Kurupoto Cool Cool Stars"}, {"genres": [12, 31], "summary": "Introducing an epic new role playing saga from the minds of renowned RPG visionaries. When an entire village is “spirited away” by an unknown malevolence, only one hero remains to unravel the mystery and rebuild a torn community.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xp7wvxoh3dnanbu54ofm.jpg", "width": 245, "cloudinary_id": "xp7wvxoh3dnanbu54ofm", "height": 368}], "id": 21332, "name": "Away: Shuffle Dungeon"}, {"summary": "Shepherd's Crossing 2 DS is a full featured and in-depth farming simulation and strategy game. At its heart, the game is about the player living in a small town and communicating with the other villagers while raising livestock, harvesting crops, and building a farm. Aside from laying out fields and deciding where to herd the animals, players must also pay attention to the placement of their resources, arranging their life as they see fit. As a special feature unique to the DS, interaction with others is a major part of the game. One can even court, date and marry. It's just one goal in a game filled with things to do and people to meet. The game is beautifully animated in a Japanese anime style. The open-ended gameplay styles mean the player can choose what they want to do whether it be breed animals, farm their fields, build relationships with the people around town or any combination of these activities as well as many others. The DS allows for unique touch screen controls that are implemented into most of the in-game activities. With so many different activities and open-ended style simulation gameplay, there are hours and hours of entertainment available to players.", "id": 47797, "name": "Shepherd's Crossing 2"}, {"summary": "Deer Drive for the Nintendo DS is the first game to bring the thrill of arcade action hunting to a handheld platform. Deer Drive for the NDS is fast, fun, and easy to play but hard to master. With 125 power-ups and upgrades, 30 levels and a ton of animals there's plenty to see, do and shoot. But don't get too relaxed - Dangerous animals like mountain lion, boar and bear are just waiting to take you down.", "id": 47771, "name": "Deer Drive"}, {"genres": [9], "summary": "Includes both Sudoku and Kakuro games at multiple difficulty levels.", "id": 47779, "name": "Platinum Sudoku"}, {"summary": "Disney Stitch Jam will introduce players to the latest adventures set in the popular world of Stitch, a classic character from the Walt Disney Pictures’ 2002 film “Lilo & Stitch.” Stitch must embark on rhythm-based missions that take place in stunning locations, from tropical beaches to outer space, and defeat Dr. Hamsterviel in an epic galactic showdown to save his kidnapped girlfriend, Angel. Disney Stitch Jam is also equipped with two-player co-operative play via download, where players can share the game with friends and play as Stitch and Angel.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rhuysap9k1uownz4qyjs.jpg", "width": 1500, "cloudinary_id": "rhuysap9k1uownz4qyjs", "height": 1342}, "id": 47822, "name": "Stitch Jam"}, {"summary": "100 Classic Book Collection, known in North America as 100 Classic Books, is a computer program published by Nintendo and developed by Genius Sonority, which was released exclusively for the Nintendo DS. First released in Europe on December 26, 2008, it was later released in Australia on January 22, 2009 and in North America on June 14, 2010. The program includes one hundred public domain works of literature. \n \nGenius Sonority had previously released a similar collection of books in Japan under the title DS Bungaku Zenshuu (ＤＳ文学全集?) on October 17, 2007. A smaller version of the collection consisting of 20 books under the title Chotto DS Bungaku Zenshu: Sekai no Bungaku 20 (ちょっとDS文学全集 世界の文学20?) was released in Japan as a downloadable DSiWare application on February 25, 2009.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rp8zedoudghiuenhb7h5.jpg", "width": 600, "cloudinary_id": "rp8zedoudghiuenhb7h5", "height": 539}, "id": 47939, "name": "100 Classic Book Collection"}, {"genres": [7], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/brga1cxylxcm26qwlptn.jpg", "width": 1500, "cloudinary_id": "brga1cxylxcm26qwlptn", "height": 1341}, "id": 47940, "name": "Kids Learn Music A+ Edition"}, {"genres": [15], "summary": "The Price is Right video game is based on the longest running game show in television history. Like the contestants on the game show, players will be able to bid on products, play the famous pricing games, and spin the Big Wheel for the chance to win prizes in the Showcase Showdown. \n \nThis game features a single- and multiplayer mode for up to four players. Many of the classic pricing challenges that viewers have known and loved for generations, such as Plinko, Three Strikes, Hole in One, and Cliffhanger, will also be in the game. The Wii version will have specialized controls that allow players to spin the Big Wheel, putt through Hole In One, or take a swing at Punch-A-Bunch.", "id": 47943, "name": "The Price Is Right"}, {"genres": [5, 31], "summary": "Transformers: War for Cybertron features two distinct storylines: the AUTOBOT campaign tells a story of heroism to save their home planet against overwhelming odds, and the DECEPTICON campaign tells a story of an unquenchable thirst for power to control the universe.", "id": 47945, "name": "Transformers: War for Cybertron - Decepticons"}, {"genres": [9, 15], "summary": "Monopoly/Boggle/Yahtzee/Battleship is a collection of the hit board games that so many enjoyed as kids. Try your finance and negotiation skills in Monopoly, see how good you are with words in Boggle, roll the dice and hit the high numbers in Yahtzee and use your critical thinking to sink your friend's Battleship. State-of-the-art engine and physics create stunning visuals and effects Blood-curdling music and sound effects enhance the experience \n \n \n \n  Play four of your all-time favourites anytime, anywhere \n  Wireless multiplayer mode--challenge up to 4 friends \n  Touch-screen controls - play word games as fast as you can think! \n  \"Hot seat\" mode--share games with up to 4 people on a single DS", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iyy4sq1feabebafdw2lu.jpg", "width": 1533, "cloudinary_id": "iyy4sq1feabebafdw2lu", "height": 1369}, "id": 47803, "name": "Hasbro Compilation"}, {"genres": [8], "summary": "The Suite Life of Zack & Cody DS is an action platform game with light puzzles. In the game the player will independently control both twins Zack and Cody. As in the television series Zack and Cody manage to get themselves into outrageous situations which they then have to fix. In order to successfully complete the missions the player will have to jump crawl climb run race defeat enemies and interact using both the controls and the touch screen.", "id": 47804, "name": "The Suite Life Of Zack & Cody"}, {"genres": [13], "id": 47863, "name": "Tokimeki Memorial Girl's Side 3rd Story"}, {"genres": [9, 31], "summary": "Inspired by the Dickens tale re-imagined by Robert Zemeckis, Disney's A Christmas Carol is an innovative puzzle-adventure game celebrating the spirit of the holidays with a Scrooge twist. The game invites a new generation to connect with the illustrious story & characters like never before and is sure to become a tradition embraced by the whole family. This keepsake from the movie will provide hours of festive entertainment and is destined to be an instant classic.", "id": 47866, "name": "A Christmas Carol"}, {"summary": "The Sorcerer's Apprentice is an action-packed 3D arcade videogame that casts players in the role of Dave, the powerful sorcerer's apprentice, as he joins a mystical fight against the ultimate evil in a world filled with fantastical quests and magical combat. \n \nIn the game, evil sorcerers have escaped from their centuries old prison, the Grimhold, and taken over New York City. The legendary master sorcerer Balthazar is trapped in the magical realm, so it's up to Dave to save New York. Guided by Balthazar, he travels throughout New York and the magical realm using special portals in order to defeat the enemy. Dave must master the elements of sorcery using magical attacks and spells to defeat the six evil sorcerers and their army of minions in order to free Manhattan.", "id": 47868, "name": "The Sorcerer's Apprentice"}, {"genres": [31], "summary": "Put on make-up and become a pretty girl.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vw8p3jmxdwq7dcgs3s8j.jpg", "width": 1500, "cloudinary_id": "vw8p3jmxdwq7dcgs3s8j", "height": 1354}, "id": 47871, "name": "Cosmetic Paradise"}, {"genres": [13], "summary": "Style Boutique combines creativity and fashion with a collection of trendy clothes, chic accessories and stylish shoes. As the owner of a clothing boutique, you must purchase inventory, monitor the store's funds and try to please a constant stream of customers who look to you for the best fashions.", "id": 47850, "name": "Style Boutique"}, {"genres": [13], "summary": "Rescue, Rehabilitate, Release! Make a difference at your very own Paws & Claws Marine Rescue as you diagnose, treat and care for injured animals. Release the healthy animals back into the wild to swim and roam freely!", "id": 47851, "name": "Paws & Claws: Marine Rescue"}, {"summary": "Jake Hunter, known in Japan as Tantei Jingūji Saburō (Detective Saburō Jingūji) is a mystery adventure game series originally developed and published by Data East in 1987, and later developed by WorkJam and other companies. \n \nDespite its popularity in Japan, only one of its games have been released overseas: Tantei Jingūji Saburō DS: Inishie no Kioku was retitled and released in North America on June 11, 2008 by Aksys Games as Jake Hunter: Detective Chronicles. The game was re-released on May 26, 2009 as Jake Hunter Detective Story: Memories of the Past, which contains the original three cases with new translations to improve the original game content, plus three new cases, and a large number of unlockables including comics.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/akcqo2ndcngxykbheice.jpg", "width": 256, "cloudinary_id": "akcqo2ndcngxykbheice", "height": 384}], "id": 21049, "name": "Jake Hunter: Detective Chronicles"}, {"genres": [13], "summary": "Shrek and Fiona's energetic triplets appear along side Donkey and Dragon's playful offspring, the dronkeys, exclusively on the Nintendo DS. This game gives handheld gamers the chance to train, play and explore with their mischievous new friends on wild adventures throughout the hilarious world of Shrek.", "id": 47860, "name": "Shrek: Ogres and Dronkeys"}, {"genres": [13], "summary": "Players care for a variety of all-new baby animals ranging from puppies to polar bear cubs and even penguins! Take care of all your baby petz and help them grow. \nAs newborns, your baby petz will need to be fed a bottle, picked up and played with, and eventually taught to crawl. When night comes, help them fall asleep by rocking them or singing them a lullaby. Also, for the first time, take care of two animals at the same time, watch them play together, react to one another and even try to eat each other’s food! From newborns to babies, these cute animals will surprise players with their clumsy and funny personalities.", "id": 47894, "name": "Petz Nursery 2"}, {"name": "Megamind: The Blue Defender", "videos": [{"video_id": "5HAr98YTLwA", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kwa7a1stla9ew9aheoj7.jpg", "width": 1514, "cloudinary_id": "kwa7a1stla9ew9aheoj7", "height": 1370}, "summary": "Just as Megamind has become our new Mega Hero, a sudden crime wave hits the city. The Doom Syndicate & their Doom Goons have emerged and are looking to take over! Only Megamind and his arsenal of gadgets can stop them!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gi50mzheybxk0tppcx40.jpg", "width": 1920, "cloudinary_id": "gi50mzheybxk0tppcx40", "height": 1080}], "id": 47896}, {"genres": [14], "summary": "\"Run, swim, climb, and fight your way to victory! \n \nFight to the finish! \nCompete in races over a variety of dangerous terrain against 6 of the toughest schools in River City. Pummel your opponents with moves like the Human Bomb and Pizza Shot. \n \nTest your skills in challenge mode! \nComplete missions and develop your martial arts. Collect customization options for your team, such as hairstyles, hair colors, face models, and complexion in Edit Character Mode. \n \nRace against 4 players! \nPlay any of the races in this Free Battle mode! Play against the CPU or up to 4 players through Multi-Cart wireless play. Choose your favorite team, stage, and race order.\"", "id": 47973, "name": "River City Super Sports Challenge"}, {"genres": [13], "summary": "Pony Friends is a virtual pet game for the Nintendo DS where players get to emulate every cool aspect of owning their own pet pony. From grooming and accessorizing your pony with colorful custom gear to going on exciting trail rides where you encounter new wildlife friends, the world of Pony Friends offers a cool new interactive environment where kids learn how to care for their dream pony.", "id": 47974, "name": "Pony Friends"}, {"summary": "American Dragon: Jake Long – Attack of the Dark Dragon is a video game for the Nintendo DS based on the animated series American Dragon: Jake Long. Attack of the Dark Dragon for the Nintendo DS lets players take control of Jake, who must punch and kick his way through an onslaught of villains to save Rose from the Dark Dragon. American Dragon—Attack of the Dark Dragon boasts five distinct worlds with more than 20 levels. When Jake transforms into the American Dragon, players can release dragon fire, perform jump attacks, whip with a tail swipe and take flight in 3D with up to four friends in wireless mode.", "id": 47949, "name": "American Dragon Jake Long: Attack of the Dark Dragon"}, {"genres": [9], "summary": "* Auto-generating algorithm allows for an infinite number of puzzles! \n \n* Time saving Touch Screen control! \n \n* Unique 2 player versus mode! \n \n* Customizable difficulty allows you to adjust the game to your personal skill level! \n \n* Select from 5 different themes and switch between numbers or symbols! \n \n* Pick up where you left off with the puzzle saving feature!", "id": 47950, "name": "Sudoku Mania"}, {"summary": "LEGO Marvel Super Heroes offers an original storyline in which Nick Fury calls upon Iron Man, the Hulk, Thor, Spider-Man, Wolverine and other heroes spanning the Marvel Universe to save Earth from such threats as the vengeance of Loki and the hunger of Galactus, Devourer of the Worlds. LEGO and Marvel fans will enjoy classic LEGO video game adventure and humor, while playing as their favorite Marvel characters. Battle the forces of evil with a myriad of powers like super-strength, flight, and invisibility at your disposal 45 action-packed missions range across the breadth of the Marvel Universe Use fast-pace combat and activate Super Moves like Hulk's Thunder Clap and Iron Man's Arc Reactor Complete challenges and earn awesome rewards Get super powered assistance from tag team partners or take full control of them in Free Play Enjoy the game with Touchscreen functionality", "id": 47966, "name": "Lego Marvel Super Heroes: Universe in Peril"}, {"summary": "Rescue Wade and save the world! No big! Help Kim go undercover using your Kimmunicator. Collect and master cool gadgets and awesome new moves! Dodge enemies and traps using Kim's acrobatic skills to defeat enemies.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p23ca0hbt306bzgrrmtr.jpg", "width": 1535, "cloudinary_id": "p23ca0hbt306bzgrrmtr", "height": 1370}, "id": 47728, "name": "Disney's Kim Possible: Kimmunicator"}, {"summary": "This 3D adventure combines the classic arcade digging action with new baddies, environments, weapons, mini-games and strategies to deliver the most action-packed Dig Dug game to date. Whether tackling the underground alone or wirelessly with a friend, gamers discover 15 stages with more than 80 areas in Dig Dug Digging Strike. Players explore 3D environments on the top screen of the DS, then plunge underground on the bottom screen to dig and connect fault lines that will trap monsters. Only by sinking enemy bosses do players move to the next level - and they encounter some familiar faces along the way. The dreaded Pooka and Fygar are back to threaten Dig Dug, along with a host of never-before-seen bosses. Dig Dug is armed with a series of thrilling weapons to combat monsters as well as elements from the environment including rolling rocks, quicksand and flowing lava.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w5ul2xxp8hbsswjhpufi.jpg", "width": 1532, "cloudinary_id": "w5ul2xxp8hbsswjhpufi", "height": 1370}, "id": 47729, "name": "Dig Dug: Digging Strike"}, {"genres": [12, 13], "summary": "Harvest Moon: Tale of Two Towns is a Life Simulation Role-playing Game (RPG) for Nintendo DS. The game features classic Life Sim gameplay involving farming, the raising and care of animals and eventual marriage. Additional features include an all-new storyline involving the player in an ongoing rivalry between two towns, the ability to play as either a boy or a girl, an in-game quest bulletin board system, wireless functionality allowing you to visit friends in-game fields, new in-game activities and more.", "id": 47719, "name": "Harvest Moon: Tale of Two Towns"}, {"genres": [31], "name": "Transformers: Autobots and Decepticons", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ubp4topdxibuhzp93mho.jpg", "width": 1529, "cloudinary_id": "ubp4topdxibuhzp93mho", "height": 1370}, "summary": "Transformers Autobots is a video game based on fictional alien robots, Transformers. This version follows the plot of the 2007 live action film Transformers.[1] Most prominently, while the Autobots version has missions in the Arctic, the Decepticons version contain desert missions taking place in a Qatar military base.[2]", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/tlnfwbgshgbb87wulv6p.jpg", "width": 480, "cloudinary_id": "tlnfwbgshgbb87wulv6p", "height": 360}], "id": 21536}, {"genres": [13], "id": 47709, "name": "My Baby Boy"}, {"genres": [12], "summary": "Shiren and Koppa still have their primary objective of finding the Lair of the Golden Condor but an adventure is not complete without visiting new towns and going on exciting side quests! Check out some of side quests they go on and the towns these two warriors visit along the way!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ftc09t7aj3fmsvanwiih.jpg", "width": 1024, "cloudinary_id": "ftc09t7aj3fmsvanwiih", "height": 915}, "id": 47767, "name": "Shiren the Wanderer: Mysterious Dungeon"}, {"id": 47705, "name": "Hotel Transylvania"}, {"id": 47696, "name": "Guinness World Records the Videogame"}, {"genres": [9], "summary": "Once you enter the FUN HOUSE, there's no turning back! Only quick wit and nimble fingers can match the illusions and brain-teasing puzzles of the FUN HOUSE, where nothing is as it appears. Solve mystifying riddles, play multi-level games and access bonus rounds to make your escape. Test your brain power with three fast-paced games! Flex your muscles to toss objects from screen-to-screen using the stylus. Eighteen rhyming riddles set across six mind-bending fun house scenes!", "id": 47784, "name": "I Spy Fun House"}, {"genres": [9], "summary": "Find the clues... Solve the crime... Unravel the mystery! \n \nHidden object game with a good mix of puzzles and types of hidden object scenes. \n \nStoryline starts on a tropical island with a mystery involving a Mayan curse. It continues in Berlin, delving into long buried secrets.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nhltmqx6y5oooxnyew7f.jpg", "width": 1560, "cloudinary_id": "nhltmqx6y5oooxnyew7f", "height": 1385}, "id": 47787, "name": "Hidden Objects: Mystery Stories"}, {"genres": [31], "summary": "Disney Fairies: Tinker Bell and the Lost Treasure expands on the forthcoming movie in which the Disney Fairies prepare for the Autumn Revelry, where Tinker Bell has been selected to create the prestigious Fall Scepter that can rejuvenate the Pixie Dust tree. When good friend Terence offers to help, Tinker Bell's stubbornness and temper get the best of her, causing her to shatter her creation - the scepter's fragile moonstone and her friendship with Terence. To make things right, Tinker Bell must now embark on a perilous quest to north of Never Land and find the Mirror of Incanta, which will grant her one wish.", "id": 47790, "name": "Disney Fairies: Tinker Bell and the Lost Treasure"}, {"genres": [15], "summary": "The famous Flo is back but this time she's traded in her apron for a passport to paradise! With all the hustle and bustle ... will our hard-working waitress get a chance to relax? Help Flo seat customers, take orders, collect tips and dress her up in hundreds of vacation outfits in the all-new Flo's Closet. New thrills, spills, and a surprise restaurant await you in the third episode of the original smash hit.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w5swbtqqsbkeumydvndz.jpg", "width": 1477, "cloudinary_id": "w5swbtqqsbkeumydvndz", "height": 1477}, "id": 24336, "name": "Diner Dash: Flo on the Go"}, {"genres": [31], "summary": "Enter a fascinating gothic world as Kale, a mysterious, powerful man. Try to save your beloved's life and soul and get her out of an evil vampire's clutches. Explore dark woods and caves, huge castles and cathedrals under the full moon's light. Master and upgrade your sword and spear, and learn how to control your powers: use the Fire and the Ice, or transform into your enemies. Face and defeat werewolves, gargoyles, zombies, and more, with a customized hero thanks to the exclusive camera features. Good or evil - be the sole master of your destiny!", "id": 47798, "name": "Soul of Darkness"}, {"summary": "Pilot a fully customizable mech suit in this side scrolling action game. You can swap parts and add upgrades to make your mech suit unique to you! \n \nThis game features random level generation and a branching story that makes for tons of replay value! You'll never play through the same game twice! \n \nThere is also a multiplayer versus mode in which up to 4 players can connect wirelessly and battle it out using just one cartridge! \n \nThis game is a must own for any fans of the Mobile Suit Gundam series or any other mech related games or anime", "id": 47837, "name": "The Soukou Kihei Gun Ground"}, {"genres": [14], "summary": "ARCADE HOOPS BASKETBALL features your choice of 3 rockin’ soundtracks, state of the art 3D graphics, and thrilling, high speed game play, for the most fun humanly possible in under a minute. See how many baskets you can sink in a fast moving 45 seconds, using only your stylus and, of course, your lightning fast hand-eye coordination. Advanced hoopsters can move on to the progressive level, where a moving basket provides an additional challenge – and the chance to rack up even more points! And for the real PROS, try the 3 POINT CLASSIC MODE, where speed and accuracy are a must as you shoot 'threes' from downtown.", "id": 47848, "name": "Arcade Hoops Basketball"}, {"genres": [9], "summary": "Cut paper into various shapes and create as many boxes as possible within the time limit to earn rewards! \n \nClimb the corporate ladder in the world of BOXLIFE using your wits and… paper? Use the Nintendo DSi Stylus to cut and then manipulate the paper into a box shape. Be careful though: if you’re not efficient with your cuts, you’ll waste paper and be penalized. R&D mode teaches you new patterns and then challenges you to complete various ranks, while FACTORY mode gives you the chance to earn money by making as many boxes as possible from an endless sheet of paper. Success in each mode brings its own reward: clear ranks to be promoted and change your character’s appearance and use your earnings to acquire new items for your character’s miniature garden. With its stylish graphics and catchy sound, you may just find that thinking inside the box isn’t such a bad thing sometimes!Games in the Art Style series feature elegant design, polished graphics, and pick-up-and-play controls, creating an experience focused purely on fun and engaging game play.", "id": 47826, "name": "Art Style - Boxlife"}, {"genres": [4], "summary": "This game is based on the popular newer Anime series \"Dragon Ball Kai\" and was only released in Japan.", "id": 47834, "name": "Dragon Ball Kai: Ultimate Butouden"}, {"genres": [13], "summary": "Raise and care for a full family of pets! Adopt a kitten from a wide variety of breeds and customise his look with tons of outfits and accessories. Cross-breed and create your own looking baby pet, then watch your cat grow and adopt a unique personality.", "id": 47932, "name": "Petz: My Kitten Family"}, {"genres": [13], "summary": "In \"My Best Friends: Dogs & Cats,\" you have the unique opportunity to play with and cuddle Dalmatian, Husky, German Shepherd and Retriever puppies and Siamese, Maine Coon, British Blue and Domestic cats. \nTeach them lots of crazy tricks, and form a team that will win prizes both in the beauty contests and the obstacle course competitions. Train to perfection and become best friends!", "id": 47893, "name": "Paws & Claws: Dogs & Cats Best Friends"}, {"genres": [13], "id": 47922, "name": "Sim City DS"}, {"genres": [12], "summary": "Your Hero. Your Adventure. Help save Raposa Village from a shadow-like evil and rebuild it back to greatness by creating a Hero in Drawn to Life Collection, 2 games in one", "id": 47876, "name": "Drawn to Life Collection"}, {"genres": [13], "summary": "Your Littlest Pet Shop Pets Come to Life! Each game comes with 6 unique pets, collect them all! \n \nCollect and name 20 pets - including brand new Fanciest, Cuddliest, Sportiest, Chilliest and more! Dress up your pets with over 100 accessories to make them even cuter. Explore 4 unique pet-sized worlds! Compete in mini-games with your little pets to earn Kibble Coins! Play 16 fun and challenging games with your pets to unlock accessories, playsets, and new pets too!", "id": 47908, "name": "Littlest Pet Shop: Winter"}, {"genres": [14], "name": "Don King Boxing", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fky1fscmod0ckzhoq1y6.jpg", "width": 1000, "cloudinary_id": "fky1fscmod0ckzhoq1y6", "height": 899}, "summary": "Created exclusively for the Nintendo DS, gamers will use the stylus to jab, hook, uppercut, and even perform combos on the DS touch screen to help your boxer find his opponent’s sweet spot and deliver that KO punch.  \nThese unique control and feedback mechanisms in Don King Boxing not only make the player feel like they are truly boxing, ducking and dodging blows, but train the player to become an actual boxer. \nComplete Handheld Experience: With 1st person visceral boxing action, a deep story mode, licensed boxers and venues, numerous create-a-boxer options, and four engaging training games, gamers will be treated to a truly unprecedented boxing experience. \n \nTrain Like a Pro: Develop your skills through exercises and techniques employed by some of boxing’s best in unique mini-games. \nFight Classic Bouts: Face true legends of boxing in 10 fantasy match-ups. Do you have what it takes to send the likes of Rocky Marciano, Joe Louis, or Larry Holmes to the mat? \nWireless Head-to-Head Action: Go toe-to-toe with friends and foes using wireless connectivity.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/leuiknfifeuxd9jppuoy.jpg", "width": 480, "cloudinary_id": "leuiknfifeuxd9jppuoy", "height": 338}], "id": 21289}, {"genres": [9], "summary": "Peel back the curtains on one of the grandest buildings in the world to look for treasure and uncover its deepest secrets. Learn fun facts about several royal locations while you search for hidden objects and play ingenious mini-games. Discover romantic notes strewn across beautifully rendered scenes in this exciting mystery adventure and follow the trail of the palace’s long lost treasure!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dasdnihhwwaabuugisbv.jpg", "width": 800, "cloudinary_id": "dasdnihhwwaabuugisbv", "height": 1102}, "id": 10411, "name": "Hidden Mysteries: Buckingham Palace"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kzzkht0k8w138pxrpfcl.jpg", "width": 250, "cloudinary_id": "kzzkht0k8w138pxrpfcl", "height": 224}, "summary": "Grab your DS and start hunting! Treasure keys can be found by hunting for treasures at certain times or completing in-game achievements.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/mvoob8uk9856dep7ssex.jpg", "width": 256, "cloudinary_id": "mvoob8uk9856dep7ssex", "height": 384}], "id": 21125, "name": "Treasure World"}, {"genres": [9], "summary": "The Nintendo DS variation of the ancient ‘Chinese Moving Puzzle’ will captivate players of all ages! Solve 100 puzzles in 10 different themed levels and watch them roar to life on your screen! Improve perception skills, logical thinking, and hand-eye coordination in this hands-on adventure that is loaded with fun! \n \nTangrams help to develop positive attitudes towards geometry, promote an understanding of basic geometric shapes and interaction and further shape recognition and organization skills. Using the touch screen to test your perceptual proficiency, Hands On! Tangrams brings manipulative puzzle solving to your Nintendo DS!", "id": 48043, "name": "Hands On! Tangrams"}, {"genres": [9], "summary": "Whether you want to play a quick, challenging game or a white-knuckle adventure, hours of fun and entertainment await you. There’s something for everyone in this collection of classic games including Chess, Mahjongg, Sudoku, Backgammon, Texas Hold ‘Em Poker, Solitaire and more. \n \n- 50 Classic Games: Endless hours of puzzle, card and board game fun with classics including Mahjongg, Blackjack, Chess, Sudoku, Texas Hold ‘Em Poker, Klondike Solitaire, Free Cell, Chinese Checkers and many more. \n \n- Varying Degrees of Difficulty: Challenging AI opponents to match your age or skill level. Step-by-step instructions included for those who need to brush up on the rules! \n \n- Hot Seat Support: Compete against family and friends!", "id": 48034, "name": "50 Classic Games"}, {"genres": [12, 15], "summary": "Experience the world of Hoshigami like never before, with a brand new character, missions, music, character art, as well as a new localization. Select from three different difficulty levels and tailor the game to your skill. Immerse yourself in battle with an enhanced user interface, and issue strategic commands quickly and efficiently with a revised, streamlined interface and optional stylus control.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iw8hux3tx3azx7n8sppp.jpg", "width": 1072, "cloudinary_id": "iw8hux3tx3azx7n8sppp", "height": 985}, "id": 47717, "name": "Hoshigami: Ruining Blue Earth Remix"}, {"genres": [8, 9], "name": "Bubble Bobble Double Shot", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gpvntei09hzuveqcqbdm.jpg", "width": 800, "cloudinary_id": "gpvntei09hzuveqcqbdm", "height": 716}, "summary": "Bub and Bob are back! Bubble Bobble Double Shot is a respectful return to the series' roots, bringing Bubble Bobble to the DS with new additions to the classic formula. Based on the original Bubble Bobble arcade game first released in 1986, Bubble Bobble Double Shot stars the two Bubble Dragons, Bub and Bob who move over a system of platforms, busting and pushing bubbles, avoiding enemies and collecting a variety of power-ups. Bubble Bobble Double Shot for DS features a perfect re-creation of Bubble Bobble's frantic platforming gameplay, complete with all the secrets and fun gameplay that made the original such a rewarding game to master.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/i8uonkm5b2sgno3dpndc.jpg", "width": 284, "cloudinary_id": "i8uonkm5b2sgno3dpndc", "height": 384}], "id": 20672}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/d0f1gjcrapcpakjwe39r.jpg", "width": 1000, "cloudinary_id": "d0f1gjcrapcpakjwe39r", "height": 898}, "id": 47711, "name": "Mystery P.I. Portrait of a Thief"}, {"genres": [31], "summary": "Witch's Wish is an adventure game that tells the tale of Vicky, a young witch in training. Vicky wants more than anything to be a witch, but in her town, only rich girls can go to witch school. Her dream seems hopeless until she meets a mysterious girl who shows her how to unlock her remarkable magical powers. Vicky will use her magic to solve puzzles, help out her friends and neighbors, and uncover the mystery of the dark force which threatens to tear the town apart. Will her magic be enough to unite and save her troubled town?", "id": 47703, "name": "Witch's Wish"}, {"summary": "Raise, Train and Battle your monsters in Monster Rancher DS, the newest addition to the beloved breeding series. Filled with nostalgia from past games, fans of the series will recognize popular characters and monsters such as Mocchi and Suezo, in addition to new monsters to discover. Generate monsters by drawing pictures in the \"magic Field,\" or by speaking into the microphone in \"Incantation\" mode. Use your best strategy to raise, train, and battle your monsters. Can you become a legendary master breeder?", "id": 47795, "name": "Monster Rancher DS"}, {"genres": [31], "summary": "Tinker Bell and the Great Fairy Rescue on Nintendo DS invites players to create their own fairy and fly into Fairy Camp and adventure through the English countryside and explore all new locations to find and grow the rare Rainbow Lily. Players will interact with Lizzy and team up with fairy friends to bring each of the six rare lilies to Fairy Camp. Along the way, fans will complete quests and take part in a wide variety of mini-games that will use specific fairy talents for arts and crafts, baking and decorating cookies and more. Connect to all the fun in Pixiehollow.com with new online connectivity features!", "id": 47789, "name": "Disney Fairies: Tinker Bell and the Great Fairy Rescue"}, {"genres": [31], "summary": "When Queen Victoria's genealogical records are stolen, the Royal Family decides to put you in charge of the case and asks you to solve this strange mystery. \n \nAs always, followed by your wise and faithful friend, Doctor Watson, you will have to use your senses of logic and observation through dozens of riddles, puzzles and brain teasers of all sorts. You will travel through dozens of beautifully hand-drawn environments, looking for clues and new mysteries. You will also meet many charismatic characters who will help you solve this strange case and finally discover the truth!", "id": 47926, "name": "Sherlock Holmes and the Mystery of Osborne House"}, {"genres": [31], "summary": "Okaeri! Chibi-Robo! Happy Richie Oosouji is an Action Adventure game, developed by Skip Ltd. and published by Nintendo, which was released in Japan in 2009.", "id": 47773, "name": "Okaeri! Chibi-Robo! Happy Richie Oosouji"}, {"genres": [9], "id": 47806, "name": "English Training: Have Fun Improving Your Skills"}, {"genres": [13], "summary": "In Crafting Mama, players will create 40 different projects across a wide range of different crafts: make patchwork quilts, earrings, candles, xylophones, kaleidoscopes, birdhouses, flower decorations and even mini-Mama dolls! Using the stylus as a universal crafting tool, crafters will sew, mold, glue, cut and paint under Mama's masterful direction. Best of all, players can use each of their creations within the game itself: dress Mama up in a new apron you've sewn or even fly a freshly folded paper airplane. In addition, new materials, colors and patterns are available to customize each project, and multiplayer support lets players create with a friend. Crafting Mama is guaranteed to turn Mama fans into crafty creators in no time!", "id": 47810, "name": "Crafting Mama"}, {"genres": [8, 9, 15], "summary": "Super Monkey Ball Touch & Roll brings the Super Monkey Ball series to the DS. Featuring a similar selection of party games and 50 different characters, this newest entry builds on the previous versions of the game. Ten different worlds will challenge your monkey-controlling skills. Also, touch-screen controls and wireless play have been implemented to take advantage of the DS platform.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ptyczicxcgzv6nnuslf5.jpg", "width": 270, "cloudinary_id": "ptyczicxcgzv6nnuslf5", "height": 190}], "id": 20489, "name": "Super Monkey Ball Touch & Roll"}, {"genres": [31], "summary": "Every day is a snow day with Disney Frozen: Olaf's Quest, the new, puzzle platformer video game based on the animated movie of the same name from Walt Disney Animation Studios and Walt Disney Pictures! Following the events of the film this original adventure throws the focus to Olaf, the happy-go-lucky snowman, as he tries to hold himself together through all the perilous situations he stumbles into. \n \nAn Icy (and Dicey) Adventure - Players must guide Olaf across 60 imaginative levels inspired by the mythical kingdom of Arendelle, navigating stimulating but accessible challenges, icy hazards and encountering mischievous natives while discovering hidden collectibles and unlockable accessories along the way.", "id": 47844, "name": "Frozen: Olaf's Quest"}, {"genres": [8], "summary": "‘Chronos Twins’ plays on the concept of time travel in a reassuringly unique manner as it is interwoven as a main game play element. To successfully complete levels, players will maneuver through an area and work within the limitations of each time period in a side-scrolling environment. The goal is to control both the present-time hero while exploring the planet to defeat alien threats. Both time periods are fully visible through a split-screen engine that displays the past and present versions of the exact same location.", "id": 23362, "name": "Chronos Twins DX"}, {"summary": "Keep Tingle afloat as you collide with the enemies and pop their balloons. Once they've fallen to the ground, ram into them again to knock them out before they've inflated their balloon and taken back to the skies. \n \nThis game is a bonus item for platinum members in the Japanese Club Nintendo rewards program.", "id": 47828, "name": "Tingle's Balloon Fight DS"}, {"genres": [9], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fbik0cze2t4eawz4sbjg.jpg", "width": 1500, "cloudinary_id": "fbik0cze2t4eawz4sbjg", "height": 1384}, "id": 47831, "name": "James Patterson: Women's Murder Club: Games of Passion"}, {"genres": [13], "summary": "Hello Baby! gives you the opportunity to be a babysitter who must look after a seven-month-old bouncing baby until it's one year-old. From morning until evening, you must care for the charming youngster by feeding it, playing entertaining games and even changing nappies. \n \nCaring for your new baby friend couldn't be easier thanks to a range of different mini-games themed around typical babysitting activities. So, whether you're making sheep jump over a fence to send the tot to sleep or ensuring the milk bottle is the perfect temperature, you're guaranteed hours of brilliant baby fun. \n \nWhat's more, by successfully completing the various child challenges you can unlock a range of new outfits for your baby, including clothes, hats and accessories. In fact, there are 10,000 potential combinations of items to wear.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ksat9gsok6lfsenfbtj6.jpg", "width": 1428, "cloudinary_id": "ksat9gsok6lfsenfbtj6", "height": 794}], "id": 47898, "name": "Hello Baby!"}, {"genres": [5], "name": "Call of Duty: Modern Warfare Mobilized", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ziimyfpda6dhnf0i9nir.jpg", "width": 800, "cloudinary_id": "ziimyfpda6dhnf0i9nir", "height": 790}, "summary": "From Wikipedia: \n \nCall of Duty: Modern Warfare: Mobilized is a 2009 first person shooter video game in the Call of Duty franchise, developed specifically for the Nintendo DS. The game takes place in the same setting as Call of Duty: Modern Warfare 2 and features many elements of gameplay typical to the series, including the usage of iron sights, and vehicular missions. It was released by Activision alongside the console versions of the game on November 10, 2009.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xtfukfzw3mpge3pra6vk.jpg", "width": 256, "cloudinary_id": "xtfukfzw3mpge3pra6vk", "height": 384}], "id": 21198}, {"genres": [15], "summary": "Command and Destroy brings army-based Real Time Strategy game play to the Nintendo DS for the very first time. Set in the future on a colonial outpost in deep space, two different species are pitted against each other due to Alien invasion. Players get to decide whether to play the role of the humans, defiantly standing up to the alien onslaught, or whether you'd like to control the extra terrestrials hell-bent on the destruction of the human race.", "id": 47887, "name": "Command and Destroy"}, {"summary": "My Weight Loss Coach DS is a game for every adult, male and female who considers reaching and maintaining their target weight as a challenge. A program that fits your own objectives and respects your daily life constraints, My Weight Loss Coach supports you and tracks your progress and achievements by improving your energy balance. Developed in conjunction with a nutritionist, it helps you take control of your weight efficiently and feel better. Via an exclusive pedometer (included free with the game), you will be able to measure your real physical activity level and balance it following the advice of a fitness coach. Your motivation will increase with coaching sessions, daily challenges, mini-games and quizzes, play for only 10 to 15 minutes per day and you will feel the difference. \n \nPersonal Profiles: Create your personal profile and evaluate your improvement potential, then set up your objectives following the recommendations based on your personal profile \nInput Reward System: Log your progress on a daily or weekly basis, tracking your physical activity and nutrition habits \nThe Pedometer: A peripheral device that comes with the game and can be easily updated through your DS, it’s the best way to control your daily physical effort, challenge yourself and balance your food intake \nReal-Life Landmark Checkpoints: As a reward, all the physical activities you achieve and good nutrition habits you acquire are converted into measurable distances based on real examples", "id": 47900, "name": "My Weight Loss Coach"}, {"genres": [9, 31], "summary": "Be the first to discover the long forgotten secrets of the famed Knights Hospitaller order! \n \nSylvie, a young archaeologist, is about to begin the greatest adventure of her life. Having received an invitation to France from her uncle, a renowned historian, she arrives only to discover he’s missing. Apparently, his disappearance is connected to the recent discovery of a mysterious underground chapel from the Crusades, but how? And who is trying to stop Sylvie from unveiling the truth? Save your uncle and be the first to discover the long forgotten secrets of the famed Knights Hospitaller order! \n \nChronicles of Mystery combines features of classic point and click adventure, with hidden object games. Use all of your logical skills to solve various puzzles to unlock clues. Players keep the investigation going by interviewing the people you meet and using their help. But be careful...no one can be fully trusted. \n \nFeatures: \n \n• Intense and demanding puzzles that require analytical problem solving skills \n• An intriguing plot with unexpected twists and secrets \n• Beautiful fully rendered locations created specifically for the Nintendo DS \n• Over 50 fun and challenging mini-games included \n• A mix of contemporary investigative tactics and an ancient Legend \n• Learn the history of the Knights Hospitaller, one of the main orders of the crusades, which still exists!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ald7abjplupj4ipe2122.jpg", "width": 256, "cloudinary_id": "ald7abjplupj4ipe2122", "height": 384}], "id": 21096, "name": "Chronicles of Mystery: Curse of the Ancient Temple"}, {"genres": [10], "summary": "Get ready to race at blistering speeds through the most addictive hair-raising tracks, with the craziest chicken in town. Join Crazy Chicken and his friends as you race your way through exhilarating 3D worlds with explosive excitement around every corner. Collect weapons as you race around the tracks and strategically fire them to drive your opponents off the road. Once you have proven your new skills in the championships, you will be awarded a higher-powered racing kart for a faster and more furious race. 7 different drivers from the Crazy Chicken family to choose from Loads of extras \n \nFeatures: \n \n• Multiple exciting tracks \n• Multiple levels of difficulty \n• 4 racing modes \n• 2-player mode \n• Tons of Weapons", "id": 47909, "name": "Crazy Chicken: Star Karts"}, {"genres": [31], "summary": "Student by day. Pop star by night. \n \nThe latest game based on the hit Disney Channel series, Hannah Montana , Hannah Montana: Music Jam, transports you into the exciting and sometimes crazy world of Miley Stewart and her alter ego Hannah Montana. Adventure out as Hannah or Miley, and develop musical talents, coordinate high fashions, and live out the dream of becoming a pop star in Hannah’s greatest musical challenge yet. \n \nEnter the Music Jam Video competition and compete against Savannah Star — a rising new singer out to challenge Hannah — at the same time as a cool new transfer student, Josie Moore, seems to be stealing all of Miley’s friends. To help her win the competition, use the Nintendo DS Touch Screen to master the guitar and drums. In a mix of adventure and creative modes, control Hannah/Miley as she composes her Music Jam Video entries, keeps her friends happy, and in the end, learns a little something about what it means to be a real star. \n \nUse the DS stylus to “play” the guitar, bass guitar, and drums and jam with your friends \nLearn to play Hannah’s hits and create your own unique tunes \nProduce music videos, complete with backdrop shots from multiple angles \nCustomize Hannah’s outfit, including clothes, hair and glasses", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/futbardy84zjibwo4moo.jpg", "width": 256, "cloudinary_id": "futbardy84zjibwo4moo", "height": 384}], "id": 21514, "name": "Hannah Montana: Music Jam"}, {"summary": "They're mini, they’re mighty, and they’re built for math! Now YOU can join Team Umizoomi, and go on a mighty math adventure! Take a ride in the Umicar with Milli, Geo and Bot to help them rescue seahorses, build a submarine, or repair a rocket so it can blast off! With you on their team, Team Umizoomi can do anything!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mcamii2d0onqrvmqxg7h.jpg", "width": 1446, "cloudinary_id": "mcamii2d0onqrvmqxg7h", "height": 1380}, "id": 47958, "name": "Team Umizoomi"}, {"summary": "Your Favorite Shrek Characters - featuring cast favorites from all 3 movies \n \n28 Hilarious Mini-Games - including Gingy's Crazy Cookie Conveyor, Mudslide Madness, Three Wheeled Thrills, Rapunzel's Hair Climb and Wild Waterworks \n \nIntuitive controls designed to take full advantage of the Wii's motion sensing capabilities \n \nPlayers can work together as a team or take each other on in head-to-head or group challenges", "id": 47960, "name": "Shrek's Carnival Craze Party Games"}, {"genres": [9], "name": "Zendoku", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gekbj6e7dfauysadkmvv.jpg", "width": 800, "cloudinary_id": "gekbj6e7dfauysadkmvv", "height": 712}, "summary": "Set against a whimsical Far Eastern backdrop with a light-hearted martial arts theme, Zendoku is a puzzle game that combines action with Sudoku, and offers a variety of colorful characters and a comprehensive range of single-player and wireless multi-player game modes.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cyvbkoeuo1lpgkqhuzut.jpg", "width": 480, "cloudinary_id": "cyvbkoeuo1lpgkqhuzut", "height": 271}], "id": 21430}, {"genres": [12, 31], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jikq0dutw6nr8yiosv1d.jpg", "width": 435, "cloudinary_id": "jikq0dutw6nr8yiosv1d", "height": 399}, "id": 51459, "name": "Gintama: Silver Ball Quest - Gin Changed Jobs and Saved the World"}, {"genres": [14], "summary": "SBK: Snowboard Kids, released in Japan as Snowboard Kids Party (スノボキッズパーティー sunobo kizzu pātī?), is a snowboarding video game for the Nintendo DS released on November 22, 2005 in North America and two days later in Japan. It was also released in Europe on April 28, 2006. It is the fourth in the Snowboard Kids series following three previous games released on the Nintendo 64 and the PlayStation. Up to four people can play wirelessly with one game card. Though the name is the same as the other games, the characters are teenagers in this installment.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iqlqwsfog1xg6rzwqgts.jpg", "width": 1520, "cloudinary_id": "iqlqwsfog1xg6rzwqgts", "height": 1370}, "id": 47725, "name": "SBK: Snowboard Kids"}, {"genres": [9], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/etc7qjkdd50d8hou2itp.jpg", "width": 1526, "cloudinary_id": "etc7qjkdd50d8hou2itp", "height": 1370}, "id": 47726, "name": "Puzzler Collection"}, {"genres": [31], "name": "Chibi-Robo!: Park Patrol", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gjxqjb1i9b2571ujeeuv.jpg", "width": 720, "cloudinary_id": "gjxqjb1i9b2571ujeeuv", "height": 648}, "summary": "A pollution epidemic is killing off flowers and ravaging parks worldwide. To combat this threat, Citrusoft Robotics has developed an eco-friendly model of Chibi-Robo and sent it to parks everywhere. As Chibi-Robo, players restore their local park to its former glory by raising flowers and plants, building park equipment and defeating toxic enemies called Smoglings.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/dbwhul8dec6chcp0tfva.jpg", "width": 256, "cloudinary_id": "dbwhul8dec6chcp0tfva", "height": 384}], "id": 21307}, {"summary": "The plot of Soldiers of Misfortune is a major departure from the rest of the series. No reference is made to the regular Army Men characters, or to any of the events that occurred in past games. The player assumes the role of a young boy named Timmy, who imagines himself as a toy soldier and uses weapons such as a miniature dart.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xdm4of5v6tqmni6b7tlf.jpg", "width": 1477, "cloudinary_id": "xdm4of5v6tqmni6b7tlf", "height": 1477}, "id": 47721, "name": "Army Men: Soldiers of Misfortune"}, {"genres": [12], "summary": "Sora's journey in Kingdom Hearts II has drawn to a close, and now a new tale is set to begin.Jiminy Cricket is looking over the journal he used to document his first adventure with Sora when he discovers a mysterious message. He didn't write it - so how on earth did it get there? King Mickey is determined to find out, so he and his friends decide to digitize the journal and delve into its deepest secrets. Inside this \"datascape\" dwells a second Sora who is about to embark on a grand adventure of his very own.", "id": 45158, "name": "Kingdom Hearts: Re-Coded"}, {"summary": "Inuyasha: Secret of the Divine Jewel is an epic role player game released for the Nintendo DS platform. Inspired from Rumiko Takahashi's popular animated TV and comic series, Inuyasha: Secret of the Divine Jewel takes you to a new level of gaming with intriguing game play and brilliant graphics. This epic role player game starts off with the detailed and engrossing stories of Inuyasha, Kagome, Miroku, Sango and Shippo. With features like intuitive command-based control scheme and the new Cover Fellow System (CFS), you will get Inuyasha and his friends to work together on the Nintendo DS in a in a battle to save the world from Sara, Lord Gorai and many more demons. Get yourself the Inuyasha: Secret of the Divine Jewel and conjure up some magic!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vfj1347eofxmcihbfkat.jpg", "width": 256, "cloudinary_id": "vfj1347eofxmcihbfkat", "height": 384}], "id": 20653, "name": "Inuyasha: Secret of the Divine Jewel"}, {"genres": [9], "name": "Zenses: Rainforest", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/frcrq0pn65mrnhttfxpf.jpg", "width": 1000, "cloudinary_id": "frcrq0pn65mrnhttfxpf", "height": 886}, "summary": "Zenses Rainforest allows players to explore the Amazon while playing games infused with rain drops, exotic flowers, waterfalls and giant trees. This refreshing experience encourages players to recharge their batteries while playing puzzle games such as Sapphire Wheel, Mirror Maze, Stack Jack and Bumble Breaker (names are currently being reviewed and may change).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xngmyaylijvf7d3zxqnc.jpg", "width": 256, "cloudinary_id": "xngmyaylijvf7d3zxqnc", "height": 384}], "id": 21295}, {"genres": [13], "summary": "A pet simulation game that lets owners name, train and play with a realistic puppy. Players create and control a main character and choose one of 49 different dogs from 18 different breeds. As characters in the game, owners can take their puppies everywhere within the virtual environment, from through the house to around the neighborhood to visit friends. Gamers will earn their puppy-s love and loyalty by remembering to feed and groom it and reward it when it does things correctly. Owners can train the puppy to lie down, shake, fetch and perform many other tricks.", "id": 47777, "name": "Dogz"}, {"genres": [31], "summary": "Dream Day Wedding Destinations delivers a romantic adventure filled with hidden treasures, excitement and the inevitable wedding crisis! It is up to you to create a dream wedding for three happy brides. As the wedding planner you must find all the necessary hidden items as you visit the florist, bridal shop, bakery and more to make her big day a fairytale. Experience pure bliss with Dream Day Wedding Destinations!", "id": 47781, "name": "Dream Day: Wedding Destinations"}, {"id": 47782, "name": "Kung Zhu"}, {"genres": [9], "id": 47783, "name": "I Spy Universe"}, {"genres": [13], "summary": "Get ready to go for the gold! It's time to hit the arena for the LITTLEST PET SHOP Biggest Stars competition—and this time your pets are in the spotlight! Ten fun and challenging mini games are your pets' tickets to the big time. Practice makes perfect as you help your pets become the best gymnasts, models, ice skaters, dancers, flyers, fashion designers, and more. Then pack up their cute team uniforms and the dozens of super-fun accessories you've customized because it's time to hit the road! The Biggest Stars competition is the event of year, when the pet-triplet judges look for teams that are a triple threat; cute, peppy and totally talented! Good thing that with your help, all your LITTLEST PET SHOP pet's Biggest Stars dreams really can come true!", "id": 47800, "name": "Littlest Pet Shop 3: Biggest Stars"}, {"genres": [15], "summary": "Yu-Gi-Oh! 5D's World Championship 2011: Over The Nexus is based on the Yu-Gi-Oh! 5D's TV series and is also the official video game of the Yu-Gi-Oh! World Championship in 2011. \n \nYu-Gi-Oh! 5D's World Championship 2011: Over The Nexus features over 4200 cards for use in the game, and includes the new 'Storm of Ragnarok' booster and the 'Lost Sanctuary' structure deck. The game's one-player story mode uses characters and situations from the TV show, and the in-game presentation has been streamlined with all-new dual-screen presentation to offer more information at a glance, while a new Duel Puzzle Editor allows users to create dueling situations that can be shared with duelists all over the world via Wi-Fi.", "id": 47801, "name": "Yu-Gi-Oh 5D's World Championship 2011: Over the Nexus"}, {"genres": [9], "summary": "It was just an ordinary day in the life of Marker Man, the loveable stick figure, and his pal Doodle Dog. That all ended abruptly, however, when Doodle went missing without a trace. Guide Marker Man through hundreds of physics based puzzles using your stylus as a creative tool to safely bring Doodle Dog home!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ifalqzaawdzdgx8eliui.jpg", "width": 1142, "cloudinary_id": "ifalqzaawdzdgx8eliui", "height": 1024}, "id": 47843, "name": "Marker Man Adventures"}, {"summary": "\"Mind Your Language\" makes learning fun and takes the chore out of studying. Targeted for the ages of 8-15, it is the first language game made for younger audiences as well as other generations. \n \nBy using mini games to teach Vocabulary and Grammar, Players gain a knowledge of a foreign language without even realising they are learning.", "id": 47825, "name": "Mind Your Language: Learn English"}, {"summary": "This game is designed to be truly enjoyable, while at the same time aiming to stimulate and develop the brain through careful and thorough consideration of the problems posed. Players will enjoy the game while developing the powers of thinking, utilising their existing knowledge and experience. This game transforms basic curiosity into powerful thinking. \n \nMinDStorm, from developer ASK Co. Ltd., takes brain exercise software to a new level and offers a whole raft of exciting new games, features and challenges all designed specifically to stimulate and improve the player's brain functions and most importantly, be fun to play in their own right. \n \nTransform gaming curiosity into powerful thinking with MinDStorm. The game features ten distinct types of challenge for players, all of which are simple to pick up and play using the Nintendo DS stylus, touch screen and microphone. Each of MinDStorm's challenges is designed to focus on enhancing the player's reason, endurance, analysis, intuition or observation. Regardless of the type of game chosen, extended play results in improved overall brain function and enhanced memory. \n \nA first for the brain training genre, MinDStorm throws additional challenges and problems into the mix. Players are rewarded with ever more complex riddles to solve as they do well in the main training mode. General knowledge and geography-based challenges are also included to accompany the more abstract trials such as sliding picture puzzles, mazes to navigate with the stylus and spot the difference games. \n \nFurther innovation is found in the way the game will adapt the tasks it asks players to perform according to the local environment it is being played in. When playing on a bumpy car or train ride for instance, MinDStorm will omit the tasks that require precise stylus action. When playing in public the game will spare players the need to vocalize into the Nintendo DS microphone. With its many innovative and exciting challenges and features, MinDStorm offers arguably the most thorough workout yet seen in a brain training title.", "id": 47861, "name": "MinDStorm"}, {"genres": [13], "summary": "For the first time ever in the Petz series, create an entire family of dogs, cats, horses and monkeys. Crossbreed and create your own looks and personality for your pet. Raise your pet and create a strong relationship.", "id": 47854, "name": "Petz Monkeyz House"}, {"genres": [7], "summary": "Big Time Rush: Backstage Pass brings the music of your favorite band to life! Use your stylus to keep up with the beat of the music and get Big Time Scores. Tap and slide the marks on the screen to unlock more songs and locations. With all their top hits including Big Night, Windows Down, Boyfriend, and Elevate you won't be able to put down your Nintendo DS.", "id": 47874, "name": "Nickelodeon Big Time Rush Backstage Pass"}, {"genres": [31], "summary": "The Clue Bender Society, a group consisting of the world's greatest detectives, is looking for their newest member. Teen super-sleuth Nancy Drew is among three exceptional candidates that could make the cut if she can solve a series of pre-determined challenges before the others. But when a secret tome containing the solutions to history's greatest mysteries goes missing, the Clue Bender Society's test case becomes real; they turn to Nancy and the other applicants to help recover the book before it ends up in the wrong hands. With only 24 hours to solve the case and earn membership into the Society, Nancy Drew will have to be at the top of her game.", "id": 47907, "name": "Nancy Drew: The Mystery of the Clue Bender Society"}, {"genres": [31], "summary": "The Poptropica museum is in ruins and needs your help! \n \nExplore three amazing islands and find missing artifacts to help restore the museum to its former glory. Meet interesting characters, collect artifacts, solve puzzles and play mini games in the ultimate on-the-go Poptropica experience!! Looking to stand out in a crowd? Customize the look of your avatar with new clothes, hats, hair styles and more and show off your own unique Poptropica style! \n \nFeatures: \n \n• Run and jump through three amazing Poptropica islands \n• Collect items and rebuild the Poptropica museum! \n• Complete the quests and unlock a host of minigames \n• Customize your avatar with new clothes, hats, hair styles and more", "id": 47928, "name": "Poptropica Adventures"}, {"genres": [13], "summary": "Your Real Baby to Love and Care for! \n \nTaking care of a baby is not always easy: bathing, bottle-feeding, changing diapers... But what joy when you see your baby smile! My Baby allows you to discover a marvelous adventure filled with emotion.", "id": 47976, "name": "My Baby Girl"}, {"genres": [13], "summary": "Babysitting Mania is a simulation-style, time-management game developed by Gogii Games and iWin and available for OS X, Microsoft Windows and the Nintendo DS. The game allows the player to babysit many virtual children while cleaning the house and managing parties all under a certain time limit. The game is available for free as a download from iWin.com. \n \nThe player has a limited amount of time to keep the chaos meter down by clicking items with a red outline, washing clothes, or putting rubbish in the bin. If the player does not manage the chaos, the player will not be able to put the children to bed. If the player does not do it before the parents come home then the player will have to retry the level. To make it more difficult, there are different and larger houses in which the kids get more chaotic.", "id": 47979, "name": "Babysitting Mania"}, {"summary": "The second edition of the LITTLEST PET SHOP video game brings the party to you with a new cast of quirky pets and their best friends. Venture on quests, deliver invitations, serve up ice cream, and style your pets as you get ready for the biggest LITTLEST PET SHOP party of the year. Plus no party is complete without a few special surprises!", "id": 48021, "name": "Littlest Pet Shop: Country Friends"}, {"summary": "Experience the thrill of being a downright Despicable super villain. Based on Universal’s animated feature Despicable Me, Despicable Me: The Game lets players of all ages become the ¬lm’s criminal mastermind Gru as he plots and steals his way to greatness. Complete heists and missions in a unique blend of action and puzzle solving that combines the fun of commanding an army of minions and using an arsenal of despicable gadgets and weapons.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gxkhuwbtkrtoo2pvfois.jpg", "width": 1487, "cloudinary_id": "gxkhuwbtkrtoo2pvfois", "height": 1381}, "id": 21734, "name": "Despicable Me: Minion Mayhem"}, {"genres": [5, 13], "name": "Call of Duty 4: Modern Warfare", "videos": [{"video_id": "LhuIjNSg7Gg", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/okxplofk1uomxyrnlf2u.jpg", "width": 1062, "cloudinary_id": "okxplofk1uomxyrnlf2u", "height": 1500}, "summary": "Call of Duty 4: Modern Warfare differs from previous installments of the Call of Duty series. Previous Call of Duty games have a distinct three country-specific campaign style, while Call of Duty 4 has a more film-like plot with interlaced story lines from the perspectives of Sgt. Paul Jackson of the Marines 1st Force Recon and Sgt. 'Soap' MacTavish of the British 22nd SAS Regiment.", "storyline": "In Call of Duty 4, the player assumes the role of two characters in the fictional war that takes place in the game. Sgt. John \"Soap\" MacTavish, a member of the British S.A.S. and Sgt. Paul Jackson, a member of the United States Marine Corps. Though missions for both characters take place in different locations they are both fighting toward the same goal; to stop the terrorist forces of Khaled Al-Asad and Imran Zakhaev from using a nuclear weapon they have obtained.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/k8vtofhy4wxx1128z4rq.jpg", "width": 800, "cloudinary_id": "k8vtofhy4wxx1128z4rq", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r7mefu40043mgglor3jc.jpg", "width": 800, "cloudinary_id": "r7mefu40043mgglor3jc", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q5pt64ftgqf8f2wmb9rd.jpg", "width": 800, "cloudinary_id": "q5pt64ftgqf8f2wmb9rd", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zar9cnupwhjh8qfypxbe.jpg", "width": 800, "cloudinary_id": "zar9cnupwhjh8qfypxbe", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lt8wq0h2xqkjxwmt8djk.jpg", "width": 800, "cloudinary_id": "lt8wq0h2xqkjxwmt8djk", "height": 450}], "id": 623}, {"genres": [5], "name": "Star Fox Command", "videos": [{"video_id": "VfGPpQmWO6U", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jvcqyuhjeag2ftajlx5m.jpg", "width": 800, "cloudinary_id": "jvcqyuhjeag2ftajlx5m", "height": 717}, "summary": "Star Fox Command lets you hop into your fight through a unique branching storyline of missions, all rendered in gorgeous 3-D. This game brings a whole new strategic element to the series, with a commander's view of the mission. Using the touch screen, players can draw the routes they and their teammates will take. Battle the enemies they encounter as they take over bases and strategically advance across the map. Players can also blow their friends out of the sky, as they dogfight 8 players over a local wireless connection -- or take on 4 players from around the world on Nintendo Wi-Fi Connection.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/qpubrq3br8a6fgx6euzc.jpg", "width": 272, "cloudinary_id": "qpubrq3br8a6fgx6euzc", "height": 408}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ggko3ixxlr8t6q3enisr.jpg", "width": 272, "cloudinary_id": "ggko3ixxlr8t6q3enisr", "height": 408}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bfkpurxlimo5czf1xen3.jpg", "width": 272, "cloudinary_id": "bfkpurxlimo5czf1xen3", "height": 408}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lnxwbrxfuj2a5mtvaah6.jpg", "width": 272, "cloudinary_id": "lnxwbrxfuj2a5mtvaah6", "height": 408}], "id": 20556}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/awcsmulnpzn6gq5zv3w4.jpg", "width": 1535, "cloudinary_id": "awcsmulnpzn6gq5zv3w4", "height": 1370}, "summary": "Elements of Destruction is a video game developed by Frozen Codebase for the PC and Nintendo DS and was released on Xbox Live Arcade on June 18, 2008.[1]", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ib7gdo8jfyzzo0ldm5au.jpg", "width": 450, "cloudinary_id": "ib7gdo8jfyzzo0ldm5au", "height": 338}], "id": 21517, "name": "Elements of Destruction"}, {"id": 47772, "name": "Jake Hunter: Detective Story - Memories of the Past"}, {"genres": [9], "summary": "The award-winning PC edutainment series, Math Blaster in the Prime Adventure, is blasting its way on to the Nintendo DS with an all-new adventure. Put your math skills to the ultimate test in this action-packed adventure that adds up to total fun!", "id": 47927, "name": "Math Blaster in the Prime Adventure"}, {"genres": [15], "summary": "Yu-Gi-Oh! GX Card Almanac is a card database video game released for the Nintendo DS in Japanese, English, French, German , Italian and Spanish. Its first English release was in Australia on the 30th November 2007. It is not actually a game, but a detailed catalog of all cards released in the TCG or OCG up until Strike of Neos. It also includes tools to aide in real-life gameplay (Life Point calculator, virtual dice roll and virtual coin flip).", "id": 47839, "name": "Yu-Gi-Oh! GX Card Almanac"}, {"genres": [12, 14], "summary": "Endou Mamoru (Mark Evans in the European version), is a very talented goalkeeper. He plays for his high school's Soccer team called Raimon Junior High School which has just won the Football Frontier. One day, the aliens from Aliea Academy, a mysterious school that trains its students into making soccer a tool to destroy other schools, approach and wreck Raimon Junior High, sending Raimon Eleven into a journey to stop the aliens, the soccer team named Gemini Storm, with Raimon Eleven's last gift, the van called Inazuma Caravan. The heroes have to travel around Japan, recruit new players, seek the secret behind the Aliea Academy, and save Japan from being destroyed.", "id": 47716, "name": "Inazuma Eleven 2: Blizzard"}, {"genres": [31], "summary": "GAME OVER, MAN! The Xenomorph, the ultimate killing machine, returns. Only the Universe's toughest, the Colonial Marines, can exterminate the galaxy's most feared species. Can you fight off the terror of the alien infestation? \n \n-Choose you squad and watch the dynamic story system adapt \n-Pick up where the Aliens crew left off and fight through the U.S.S. Sulaco, planet LV-426, and more! \n-Load up with iconic weapons from the film, including pulse rifles, smart guns, and flamethrowers.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bfbwgouuyetnnxldga3u.jpg", "width": 640, "cloudinary_id": "bfbwgouuyetnnxldga3u", "height": 480}], "id": 20606, "name": "Aliens: Infestation"}, {"genres": [9], "summary": "Color Cross is a challenging puzzle game where the goal is to uncover the hidden picture by applying the right color to the appropriate square. Utilizing the familiar \"paint by numbers\" picture logic puzzle mechanic, completing a grid will reveal a portion of a larger hidden image as well as unlocking increasingly difficult challenges. With over 150 individual grids to unlock, Color Cross provides hours of brain-teasing gameplay that is colorful in more ways than one.", "id": 47769, "name": "Color Cross"}, {"genres": [9], "summary": "Mechanic Master 2 offers an exciting new gameplay feature for this crazy puzzler: disassemble objects to create hybrid gadgets. Players are challenged by 110 new levels, and must use dozens of new objects (60+ in total) to make things work out. New drawable shapes in Drawing Mode include the magnet, ball and black hole. There's also a built-in level editor, and you can share your levels with friends via a local wireless connection.", "id": 47802, "name": "Mechanic Master 2"}, {"genres": [15], "summary": "This is a board game that feels pretty much like Mario Party, but based on the Anime series of the same name. It was released only in Japan.", "id": 47833, "name": "Demashita! Powerpuff Girls Z"}, {"genres": [31], "summary": "NANCY'S ON THE CASE! Family heirlooms are disappearing all over Twin Elms. The residents are counting on Nancy Drew to solve the mystery before it's too late! \n \nInterview people and gather clues using the stylus to uncover the location of the hidden staircase. \nExplore the large and mysterious Twin Elms house and examine anything that is out of place. \nEarn the top rank of Master Detective and find the stolen items.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vvadmmjux9fnxfkaws3e.jpg", "width": 1000, "cloudinary_id": "vvadmmjux9fnxfkaws3e", "height": 896}, "id": 47916, "name": "Nancy Drew: The Hidden Staircase"}, {"genres": [13], "summary": "Play as a young vet, who has just opened their first animal clinic. Take care of your neighbors’ domesticated pets, as well as the local exotic baby animals. Diagnose, cure, observe and heal the animals to gain your clients’ confidence and respect. Uncover the mystery behind the animals’ illnesses. Investigate to find out if the local factory could be polluting the rivers and thus be causing the animals’ diseases. Face real challenges on the journey to becoming a great veterinarian, and possibly join one of the world’s most prestigious NGOs. \n \nFeatures: \n \n• More than 30 missions: travel around the world, heal endangered exotic animals, or directly treat the animals in the clinic \n• Take care of your own baby tiger: feed it with a baby bottle, clean it, play ball and other games with it, and pay special attention to it so that it doesn’t get sick \n• Multiplayer mode for two players \n• Rescue animals in competitive mini-games: \n• Saw a tree trunk in a limited amount of time to get to the injured animals inside \n• Heal a turtle by replacing the turtle’s shell as quickly as possible \n• Balance on a wood log to get to the other side of a river", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kg0flkvnywk4qnz3jw46.jpg", "width": 1000, "cloudinary_id": "kg0flkvnywk4qnz3jw46", "height": 897}, "id": 47918, "name": "Petz Rescue: Wildlife Vet"}, {"genres": [12], "name": "Witches & Vampires The Secrets Of Ashburry", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nhmowzmqg6c0pbu7oocg.jpg", "width": 1500, "cloudinary_id": "nhmowzmqg6c0pbu7oocg", "height": 1351}, "summary": "Witches & Vampires is an adventure game that tells the story of three magical half siblings and their struggle against evil.Three supernatural siblings work together to fight demons and vampires in this role-playing game from Conspiracy Entertainment. Play as witch Aluna, vampire Dariel, and half-blood Ruby as they search the village of Ashburry for the six mystical amulets needed to stop the evil creatures. Players can interact with townsfolk to receive quests and venture into dungeons to hunt for treasure and clues to the missing amulets. The touch-screen interface is used to perform actions such as casting spells, digging for treasure, and more. Also included are various mini-games, such as flying on a broomstick through a series of floating rings.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/tebn0qvbykknirlmwgbg.jpg", "width": 1600, "cloudinary_id": "tebn0qvbykknirlmwgbg", "height": 1200}], "id": 47813}, {"genres": [9], "summary": "Inspired by Disney's classic animated film, \"The Little Mermaid,\" The Little Mermaid: Ariel's Undersea Adventure sends our favorite mermaid on an aquatic adventure to uncover a fun mystery. Ariel, Flounder, Sebastian, Eric, King Triton, Ursula, Flotsom and Jetsom and new friends are all in the game, which touches on key moments of the film. Thirteen different levels of interactive gameplay include playing music wirelessly with other friends, singing into the DS microphone to unlock clues and using the DS stylus to dig up an polish treasure. Swim through 16 different levels of game play! Sing into the Nintendo DS microphone to unlock treasure chests. Use the DS stylus to uncover, clean and polish sunken treasures. 1-5 player wireless gameplay -- play music with others in the Barnacle Band. Rub the crystal ball to view film clips from the beloved feature film.", "id": 47814, "name": "The Little Mermaid Ariel's Undersea Adventure"}, {"genres": [8], "summary": "As the young but determined hero Mister Slime, players set off on an exhilarating adventure, trying to protect Slime Village from its evil enemies, the Axons. Using the touch screen and stylus, players must navigate the levels by dragging and stretching Mister Slime's arms to grab hold of small anchor points scattered throughout the game. Mister Slime features inventive uses of characteristics specific to Nintendo DS, including sound and shape recognition.", "id": 47774, "name": "Mr. Slime Jr."}, {"genres": [13, 15], "summary": "Cruise Line Tycoon is a Strategy game, developed and published by Foreign Media, which was released in Europe in 2010.", "id": 47938, "name": "Cruise Line Tycoon"}, {"genres": [4], "summary": "Naruto Shippuden: Shinobi Retsuden 3 is an Action game, developed and published by Takara Tomy, which was released in Japan in 2009.", "id": 47824, "name": "Naruto Shippuden: Ninja Destiny 3"}, {"genres": [31], "summary": "Disney Friends for Nintendo DS is a new virtual life simulator and adventure game featuring some of the most beloved characters from popular Disney films including The Lion King, Winnie the Pooh, Lilo and Stitch and Finding Nemo. Allowing players to befriend and interact with Stitch, Dory, Simba, and Winnie the Pooh, Disney Friends uses voice and touch to control the actions and emotional behaviours of the game's characters. Disney Friends also features adventure elements, offering players the opportunity to bond with the characters while exploring memorable film environments and moments.", "id": 47859, "name": "Disney Friends"}, {"genres": [8], "name": "Super Princess Peach", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yrxs6t3o2jtklxtkdnvq.jpg", "width": 1000, "cloudinary_id": "yrxs6t3o2jtklxtkdnvq", "height": 895}, "summary": "Princess Power! \nBowser's up to no good again...but this time, it's Princess Peach to the rescue! When Mario, Luigi, and the Mushroom Castle Toads get kidnapped it's up to Peach and her magical umbrella to save them. \n* Feel the vibes! Use the Touch Screen on the DS to channel Peach's emotional vibes into special abilities. Float when she's happy, burn through walls when she's mad, or make vegetation grow with her tears! \n* Save Mario! Join the princess as she runs, jumps, floats, and fights her way through eight worlds, from Fury Volcano to Spooky Shriek Mansion. \n* Keep your eyes peeled! Every area hides secrets, including Touch-Screen Minigames, cool puzzles, and and plenty of power ups for both Peach and her umbrella!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/aq5yiznluyqdie5e2has.jpg", "width": 270, "cloudinary_id": "aq5yiznluyqdie5e2has", "height": 190}], "id": 20497}, {"genres": [31], "id": 47765, "name": "Emily the Strange: Strangerous"}, {"genres": [31], "summary": "Seek and solve a Mayan adventure thats riddled with hidden-object fun! Search 18 exotic locales on your quest to discover a lost Mayan temple. Find over 1600 cleverly concealed objects, collect bonus items like glyphs and Jade masks, and be first to find the Forgotten Ruins. Plus, you can unlock two unlimited game modes and play five types of mini-games!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rwylghw2479pw7opfats.jpg", "width": 937, "cloudinary_id": "rwylghw2479pw7opfats", "height": 845}, "id": 47700, "name": "Amazing Adventures: The Forgotten Ruins"}, {"genres": [8], "name": "Wario: Master of Disguise", "videos": [{"video_id": "OfQ7hJVWhuQ", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ltmqyjockvnpag3s8ffl.jpg", "width": 1000, "cloudinary_id": "ltmqyjockvnpag3s8ffl", "height": 896}, "summary": "The world's most low-down and ornery garlic-lover never lets a get-rich quick scheme pass him by. Wario: Master of Disguise opens with our money-mad hero taking a break from being a shady software impresario to watch a TV show about a master thief. Working himself up into a lather of jealousy, Wario leaps through the screen and embarks on his own glamorous globe-trotting career as a thief. \nWith the helpful advice of a mustachioed magic wand named Goodstyle, you'll soon learn how to use your DS stylus to draw specific designs on Wario to give him new costumes. Break into exotic locations, from a luxury liner & watery ruins to an Egyptian pyramid, all in the hopes of grabbing as much treasure and loot as Wario can carry.", "id": 1701}, {"genres": [12], "name": "Fossil Fighters", "videos": [{"video_id": "54pIRHcmzPM", "name": "Trailer"}, {"video_id": "Zi8nX8j0YrE", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zd85zztuj7kw8pphar3a.jpg", "width": 1537, "cloudinary_id": "zd85zztuj7kw8pphar3a", "height": 1382}, "summary": "Fossil Fighters, known in Japan as Bokura wa Kasekihoridā (ぼくらはカセキホリダー lit. \"We Are Fossil Diggers\"[2]?), is a 2008 video game developed by Nintendo SPD, Red Entertainment, M2, and Artdink and published by Nintendo. It was first released in Japan on April 17, 2008 and was later released in North America on August 10, 2009,[1] and in Australia on September 17, 2009.[3] \n \nOn September 10, 2010, a sequel titled Super Kasekihoridā was announced,[4] and it was released in Japan on November 18, 2010.[5] Near the end of Nintendo's E3 2011 conference, it was announced that it would be released outside of Japan originally titled as Super Fossil Fighters, but later changed to Fossil Fighters: Champions. It was released in North America on November 14, 2011. At E3 2014, Nintendo casually announced the first entry on the Nintendo 3DS, Fossil Fighters: Frontier, released in North America in 2015,[6] the game has been available in Japan since February 2014.[7]", "id": 20978}, {"genres": [2, 9, 33], "summary": "Wario makes his debut on the Nintendo DS with hundreds of all-new minigames. Now you must complete your goals by using the touch screen and a stylus. Tap, scratch, and rub your stylus on the touch screen to play minigames that have you do everything from milking a cow and drawing a mustache to hurling stars at evil ninjas. You can even play some minigames by blowing into the DS's built-in microphone. The more minigames you clear, the more characters and items you unlock.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/o3sb3qroyxs3mno4wje4.jpg", "width": 1500, "cloudinary_id": "o3sb3qroyxs3mno4wje4", "height": 1358}, "id": 1705, "name": "WarioWare: Touched!"}, {"genres": [12], "summary": "Witches & Vampires is an adventure game that tells the story of three magical half siblings and their struggle against evil. A mysterious villain wants to steal a magic amulet from their mother to achieve infinite power.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/f5q77ku9dj8i8paugeln.jpg", "width": 1020, "cloudinary_id": "f5q77ku9dj8i8paugeln", "height": 765}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tl61jlvflzizw5vsk1lj.jpg", "width": 1600, "cloudinary_id": "tl61jlvflzizw5vsk1lj", "height": 1204}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ux1npvt2hqzeucb9bgco.jpg", "width": 1024, "cloudinary_id": "ux1npvt2hqzeucb9bgco", "height": 768}], "id": 47812, "name": "Witches & Vampires Ghost Pirates Of Ashburry"}, {"genres": [13], "summary": "Teach your Baby to Walk, Talk, and Play! \n \nYour baby has grown so fast! Can you believe that a year has already gone by? Take care of your baby from their 1st birthday until they're 3 years old. Your baby will discover its entire environment and learn from it, they'll walk, babble and speak, try to catch every object they can, and put everything in their mouth... Your baby will be the apple of your eye!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tpuzqwpemt6abfw4sb8x.jpg", "width": 1500, "cloudinary_id": "tpuzqwpemt6abfw4sb8x", "height": 1344}, "id": 47910, "name": "My Baby First Steps"}, {"summary": "FEEL BETTER WITH â€œQUICK YOGA TRAININGâ€\u009d \n \nEvaluates your physical age & adapts the lessons to your level \nEveryone can play â€“ lessons covers all yoga levels, from beginners to advanced \n  \nMAKES UNIQUE USE OF DS FUNCTIONS \n \nVoice recognition and DS microphone enable hands-free exercise \nBreathing pace is measured via DS touch screen \nLEARN ABOUT YOGA \n \nGet daily feed-back on improvement \nYoga glossary helps players become yoga experts", "id": 47877, "name": "Quick Yoga Training"}, {"genres": [13], "summary": "With more than 240 recipes created by a culinary school and in collaboration with a renowned nutritionist, My Cooking Coach offers you tips and tricks to create healthy and delicious meals that will delight friends and family.", "id": 47702, "name": "My Healthy Cooking Coach"}, {"summary": "Fasten your seat belts for the exciting new action racing game, M&M's Kart Racing! M&M'S Kart Racing breathes new life into the arcade racing by combining the adventure elements (collecting items on the race track) and high speed racing with the funny and exciting style of candy competition.", "id": 47923, "name": "M&Ms Kart Racing"}, {"genres": [4], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/w1i09s8tbimuyyak5hyi.jpg", "width": 1280, "cloudinary_id": "w1i09s8tbimuyyak5hyi", "height": 720}], "id": 47827, "name": "Fairy Tail Gekitou! Madoushi Kessen"}, {"summary": "B-17 FORTRESS IN THE SKY places the player in the heart of the air war over Germany and the occupied territories in the autumn of 1944. Defend the \"Lucky 25\" through 25 heart-pounding missions over France, the Netherlands, and deep into the heart of Germany. Man each gunner position, avoid deadly flak encounters, and make sure to drop those bombs right in the o'le \"pickle barrel\".", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/homex5nynieauwjaedj5.jpg", "width": 1280, "cloudinary_id": "homex5nynieauwjaedj5", "height": 1158}, "id": 47933, "name": "B-17 Fortress in the Sky"}, {"genres": [31], "name": "Dementium II", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mplabui6kkdwf2nd2xsx.jpg", "width": 1534, "cloudinary_id": "mplabui6kkdwf2nd2xsx", "height": 1401}, "summary": "Dementium II continues to push the horror experience by melding FPS action and puzzles with a story and ambience that will have players on the edge of their seats. New wrinkles to gameplay, all new weapons, dual wielding items, improved interface and save system, and mind-boggling environments promise to engage gamers and spawn fear the likes of which some never thought possible.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bifwf5jcaq28yqdx8hkd.jpg", "width": 256, "cloudinary_id": "bifwf5jcaq28yqdx8hkd", "height": 192}], "id": 20665}, {"genres": [8], "id": 47788, "name": "Phineas and Ferb"}, {"genres": [8], "summary": "This is an updated version of Rainbow Islands, the sequel to Bubble Bobble, taking the form of a platform game where the player must ascend through vertical levels that are slowly sinking into the ocean. The objective of the source material is to reach the top of each level, taking out any enemies in the way by firing magical rainbows that can trap or eliminate foes as well as providing bridges for the player to walk on. Rainbows remain onscreen for a short amount of time but can be ?broken? by the player if they jump on them. Once broken, the rainbow will fall off the screen, taking out the first enemy it touches. The game also features a pleasing bonus item system where dispatched enemies leave behind items of food that have varying point values and power-ups that have a range of helpful effects. The major feature of this re-interpretation is shifting the entire game away from traditional controls by implementing a global touchscreen control system which radically alters the way in which the game plays. The game is also displayed across both screens of the DS. Rather than being fired by a button press, rainbows are now drawn directly onto the gameplay area using the stylus and movement is executed by dragging the player?s character around the levels. The objective is still to reach the top of the level, but the time limit has been extended to account for the player being unable to move and use rainbows simultaneously. Rainbows are now broken by pressing the stylus onto them.", "id": 22598, "name": "Rainbow Islands Revolution"}, {"genres": [31], "summary": "After receiving a distressing correspondence from a former classmate requesting his presence, high school detective Hajime Kindaichi travels to Twilight Island to investigate the anguish behind the letter. \n \nMeanwhile, as fate would have it, Conan Edogawa has been introduced to a modern folktale by Professor Agasa, on an island in the south that serves as a premiere tourist resort, inhabitants have been mysteriously disappearing for extended periods of time before suddenly returning without explanation. What's more: When they disappear, they are transported to an alternate version of that very same island. Intrigued, Conan consents to investigate the case while his companions go on a vacation at the tourist trap known as Twilight Island. \n \nAs the mystery deepens and it becomes clear their two cases are more related than it first seemed, a grand case unfolds that requires the unmatched reasoning powers of both young detectives.", "id": 47858, "name": "Detective Conan & Kindaichi Case Files: Chance Meeting of Two Great Detectives"}, {"genres": [14], "summary": "Rafa Nadal Tennis will give players the chance to develop an illustrious tennis career. The game’s single player Career Mode enables gamers to rise through the ranks of professional tennis, competing in 20 tournaments at 17 international locations. Within each player's profile are five key performance abilities: Serve, Forehand, Backhand, Smash and Speed. Credits won from match prizes can be invested into any of the abilities to raise the player’s overall performance level. A match win may also bring in prize money, which can be used to purchase new equipment or even hire a partner for a game of doubles. Beyond the single player Career Mode, doubles matches can be played in the game’s multiplayer modes, which enable up to four players to compete wirelessly. The Single-Card wireless multiplayer mode lets up to four players join a match from a single copy of the game. If all players have a copy of the game, a more extensive Multi-Card multiplayer mode offers additional choice over court types and players.", "id": 23104, "name": "Rafa Nadal Tennis"}, {"genres": [12], "summary": "Dinosaur King is a video game for the Nintendo DS game based on the Dinosaur King TV series. It was released in the US on September 23, 2008. \nThe game's story is about Max, Rex, and Zoe, the members of the D-Team (of whom only Max and Rex are available as player characters). One day, they find mysterious stones that allow them to summon dinosaurs, after creating special cards from fossils, using a special device called a Dinoshot. However, an evil group called the Alpha Gang steals a Dinoshot in order to create a dinosaur empire. It is the D-Team's job to stop the Alpha Gang.", "id": 48042, "name": "Dinosaur King"}, {"genres": [12], "summary": "Join the Di-Gata Defenders in their battle against the evil Order of Infinis. \n \nWith the help of powerful Guardians these young heroes fight to control the destiny of the four pure stones. They are the last line of protection between the good people of Rados and the villains who seek to rule them. Lord Nazmul has found a new way to release the Megalith trapped by the four pure stones. He plans to build a gigantic machine to concentrate pure cosmic energy in order to destroy the pure stones. You must help the hard-hitting heroes prevent the execution of this evil plan by creating your own character and exploring the world of Rados! For the fans, the game is an extension of their favourite show. For the expert, this game allows them to test their strategic abilities. \n \nPlay and interact with the characters from the show Seth, Melosa, Erik, Kara, Adam, Lord Nazmul, Brackus, Flinch and Malco. The Di-Gata game for Nintendo DS takes players on a fantasy quest that challenges them and calls on their skills, speed and strategic abilities. Take part in this action-packed adventure and get ready to CAST THE POWER! \n \nFeatures: \n \n• Create your very own Di-Gata Defender and improve your skills and HP \n• Unlock new abilities with powerful stones and build your own strategies and kits \n• Explore 3 provinces of Rados World and visit villages, towns, caves, towers and much more \n• Talk, battle and trade with the characters you encounter along the way \n• Unlock numerous side quests by talking with the characters you meet in the villages and buy or sell cards and stones to help you advance in the game \n• Participate in challenging multiplayer battles with your friends", "id": 47956, "name": "Di-Gata Defenders"}, {"genres": [13], "summary": "In My Amusement Park, kids step into the driver’s seat to run their own amusement park. In Digging for Dinosaurs, kids will separate fact from myth to learn the true tales about 21 different dinosaurs. With these smart games, parents can rest assured that kids build skills while they play. \n \nBuild the Park: Choose from four different theme park plans then build rides, food venues and special attractions to \n \nopen your theme park! \n \nFix the Rides: Customers don’t like broken rides! Use your logic skills to repair the rides and keep the customers happy. \n \nKeep It Going: Running an amusement park isn’t all about rides and games. Use matching clues to fulfill food orders, keep the park clean and more! \n \nEarn Money: Play eight different memory and puzzle games to earn money to build a bigger, better park with larger and more expensive rides and attractions! \n \nMake It Your Own: Control the look of the park—from its theme to the design of the rides to the landscaping and decorations.", "id": 47929, "name": "My Amusement Park"}, {"genres": [9], "summary": "All of the fun and thrills of your favorite amusement parks and carnivals have gone portable! In Wonder World Amusement Park for DS, the complete day-at-the-park experience is in your hands with 6 themed zones full of mini games and an exhilarating ride in each. Play through a huge variety of mini-games as you win outfits and prizes for your unique character. Step right up and test your skills in a fun filled experience for the whole family!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zhhtxkhcr8i051viuexp.jpg", "width": 1117, "cloudinary_id": "zhhtxkhcr8i051viuexp", "height": 1037}, "id": 47968, "name": "Wonderworld Amusement Park"}, {"genres": [12], "name": "Fossil Fighters: Champions", "videos": [{"video_id": "DtPQ69zULJA", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sbm7n7adxjbqcdg7uihr.jpg", "width": 800, "cloudinary_id": "sbm7n7adxjbqcdg7uihr", "height": 719}, "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ysdeajyuywnv4zarvdqi.jpg", "width": 433, "cloudinary_id": "ysdeajyuywnv4zarvdqi", "height": 650}], "id": 20979}, {"genres": [15], "summary": "The beloved childhood pastime of lazy Sundays spent with a magnifying glass and an ant farm finally arrives on the DS in this challenging and addictive strategy simulation that trains your ant minions - as well as your brain - through the use of the stylus. \n \nYou must zap, tap, and manipulate your ants to make them tough enough to survive a variety of harsh environments and strong enough to defend the planet against evil alien robot insect invaders! It’s up to you to build the best Ant Nation!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xdzfvtwnppapm7holp3r.jpg", "width": 1488, "cloudinary_id": "xdzfvtwnppapm7holp3r", "height": 1387}, "id": 21197, "name": "Ant Nation"}, {"genres": [9], "summary": "Spot the difference in lands of mystery and enchantment in Photo Phantasy. Adventure into three dream-inspired stories as you discover differences and conquer each visually stunning level. Embark upon the stories of Dreams, Goldilocks and Robin Hood, and spot the differences before time runs out!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nghmywgd6d2qwle4llmy.jpg", "width": 1500, "cloudinary_id": "nghmywgd6d2qwle4llmy", "height": 1345}, "id": 47959, "name": "Photo Phantasy"}, {"genres": [13], "summary": "Discover and hatch 40 different magical Petz – Discover and take care of 20 unique creatures with different habits and personalities in both the Sunshine Magic and Moonlight Magic games. Collect all 40! \n \nCare for your magical Petz to help them grow – Feed them, clean them, play fun games and learn their preferences to help them grow. Discover your Petz’ favorite food; one will like cotton candy, another – Tabasco sauce. \n \nDress them up in fun costumes and accessories – Unlock tons of accessories and up to 20 different costumes. Does your pet love food? Maybe a chef costume is more suitable for their personality. How about a Princess, Pirate or Rockstar? \n \nTeach them magical powers in fun mini-games – Fantasy Petz come from a world with 4 types of powers: Flight, Ice, Fire or Speed. Play fun mini-games to guide them to shoot fire balls or ice bombs, and race through magic tunnels or fly through a magical sky \n \nKeep them secret from your parents – Teach your fantasy Petz to morph into household objects, like toaster ovens or lamps, to keep them secret from your parents.", "id": 47962, "name": "Petz Fantasy: Sunshine Magic"}, {"genres": [13], "summary": "My Little Flufties is a 3D life simulator similar to Tamagotchi published on Nintendo DS and Windows by Lexicon Entertainment. The game is distributed by JoWood Productions in Europe and Dreamcatcher in North America. The game title is AniMates in North America. \n \nAimed at children aged 5–9, gamers can choose between 5 imaginary creatures. You must nourish, wash, educate and amuse the creatures to keep the game going. \n \nThe fairy-like 3D world contains several attractions like swings and slides. Next to that, there are also 5 mini-games available in the game: \n \nMole-o-matic: jump on the head of the moles to stun them. \nShoot the balloons: shoot with a peashooter to pop coloured balloons. \nFish-o-matic: catch fish with a fishing net. \nHopscotch: jump on the good squares to advance. \nFind the Tweet-Tweet: find 4 birds hidden in the game's world. \nThe game uses a full 3D engine but with a traditional drawing style.", "id": 48036, "name": "My Little Flufties"}, {"genres": [13], "summary": "Welcome to the Ranch! \n \nExplore the amazing world of Greenhill Ranch, home to championship horses. Discover 20 fun mini-games that let your teach, train and groom your horse. With the right training, you and your horse will take the crown at the big tournament. Life at the ranch has never been this much fun. \n20 Amazing Adventures: Train, play with and care for your horses in 20 fun mini-games! Dash across raging rapids, play hide and seek, and even sing along with the Greenhill horse choir! \nTouch and Train: Interact with your horses through simple DS stylus controls! \nCapture the Memories: Photograph your horses and view the pictures in your photo album. \nFun & Games: Navigate the obstacle course, tackle agility challenges and learn to do fantastic tricks as you develop a bond with your horse that can never broken.", "id": 47975, "name": "I Love Horses"}, {"genres": [13], "summary": "Get ready for an adventure at your very own Paws & Claws Pet Vet clinic down under! It’s your job to nurture and love all of the wild animals down under and bring them back to health. \n \nFeatures \n \n• Work as a doctor and care for 6 fun loving animals such as koala bears, wombats, dingoes and kangaroos! \n• Be an entrepreneur! Use the profits from your Pet Vet clinic to expand your business and increase your clinic’s capabilities. \n• Hop in your very own vehicle and use your map to locate all the sick animals in the eucalyptus forest, the vast plains or the mountains.", "id": 47977, "name": "Paws & Claws Pet Vet: Australian Adventures"}, {"genres": [14], "name": "Mario & Sonic at the Olympic Games", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mxzfryaaedlcjm5emniz.jpg", "width": 250, "cloudinary_id": "mxzfryaaedlcjm5emniz", "height": 352}, "summary": "Mario & Sonic on the Wii is a collection of twenty-four events based on the Olympic Games. Players can assume the role of a Nintendo or Sega character while competing against the others in these events. Players use the Wii Remote to mimic actions performed in real life sports, such as swinging a paddle.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cu3dh8zcwklosqms8hbg.jpg", "width": 480, "cloudinary_id": "cu3dh8zcwklosqms8hbg", "height": 336}], "id": 2706}, {"genres": [14], "name": "Mario & Sonic at the Olympic Winter Games", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zpumgtz6k75iw1z7ocab.jpg", "width": 256, "cloudinary_id": "zpumgtz6k75iw1z7ocab", "height": 361}, "summary": "Mario & Sonic at the Olympic Winter Games controlling an on-screen character through authentic Olympic events with the specific tailored controls for the Wii", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rr1docugw7yogookb7sm.jpg", "width": 480, "cloudinary_id": "rr1docugw7yogookb7sm", "height": 270}], "id": 2707}, {"genres": [8, 12], "summary": "The game initially focuses on the events surrounding the kidnapping of Knuckles and the disappearance of the Chaos Emeralds after the defeat of Doctor Eggman, before moving on to follow the cast of characters across two dimensions as they encounter a new ally, Shade the Echidna, and seek to stop the invasion of their world by Ix, the leader of Shade's tribe, the Nocturnus.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wg4cztcdaezqfugmsajz.jpg", "width": 600, "cloudinary_id": "wg4cztcdaezqfugmsajz", "height": 555}, "id": 217, "name": "Sonic Chronicles: The Dark Brotherhood"}, {"genres": [14], "summary": "Sega Superstars Tennis is a tennis video game developed by Sumo Digital, crossing over numerous Sega franchises, including Sonic the Hedgehog, Alex Kidd, Space Channel 5 and 12 more.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wzlvp6f6rxyq7e7wf3ky.jpg", "width": 1530, "cloudinary_id": "wzlvp6f6rxyq7e7wf3ky", "height": 2148}, "id": 47367, "name": "Sega Superstars Tennis"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fzg67wllehl2medzxalv.jpg", "width": 1536, "cloudinary_id": "fzg67wllehl2medzxalv", "height": 1370}, "genres": [14], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/buzu0gi0ec5ylwt0o1p5.jpg", "width": 256, "cloudinary_id": "buzu0gi0ec5ylwt0o1p5", "height": 392}], "id": 21329, "name": "Tecmo Bowl: Kickoff"}, {"genres": [31], "name": "Tenchu: Dark Secret", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hjjjucfsqqmwi72c6rko.jpg", "width": 256, "cloudinary_id": "hjjjucfsqqmwi72c6rko", "height": 230}, "summary": "Tenchu: Dark Secret places you in the shoes of ninja assassins charged with protecting the life of a princess. Stalk your enemies with sword in hand, plant explosive traps in the underbrush, or strike with an assortment of realistic ninja weaponry - the choice is yours. Features over 40 single-player missions and the ability to construct your own weapons and items. Prove your mettle with the metal by challenging friends to a local wireless multiplayer match. \n \nTenchu: Dark Secret boasts three unique modes and a whole host of options to keep each match fresh and fun. Whether you're creeping through a bamboo forest to plunge a dagger into your friend's back or setting a trap to steal his precious dumplings, you're going to need a towel to wipe the sweat from your hands. Need a new bamboo trap? Short on shurikins? Just hop online. Tenchu: Dark Secret allows players to buy, sell, and trade items via Nintendo Wi-Fi Connection. You can choose to transact with either friends or strangers.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pfg5jau1yr6xobvnory8.jpg", "width": 272, "cloudinary_id": "pfg5jau1yr6xobvnory8", "height": 408}], "id": 20557}, {"genres": [14], "name": "Mario & Sonic at the London 2012 Olympic Games", "videos": [{"video_id": "RQu3T5Xy8TI", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kfnyvbromhdcxrsu8jv6.jpg", "width": 250, "cloudinary_id": "kfnyvbromhdcxrsu8jv6", "height": 352}, "summary": "Mario & Sonic at the London 2012 Olympic Games is a collection of numerous events based on the Olympic Games. Mario & Sonic brings together the two titular characters and eighteen more from both franchises to participate in environments based on the official venues of the 2012 Summer Olympics in London. The characters are divided into four categories: all-around, speed, power, and skill.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/dx4dflftnh4nstlchxi6.jpg", "width": 480, "cloudinary_id": "dx4dflftnh4nstlchxi6", "height": 270}], "id": 2708}, {"genres": [12, 16], "name": "ASH: Archaic Sealed Heat", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gwoci7gq6flxaaykynxe.jpg", "width": 640, "cloudinary_id": "gwoci7gq6flxaaykynxe", "height": 577}, "summary": "The game was only released in Japan. \nAn ESRB rating was revealed but that version was canceled before release.", "storyline": "\"This RPG takes place in a medieval European-like country named Milinia. On her seventeenth birthday, the princess Aisya will be crowned queen. Her subjects are gathered around the palace while her uncle, the regent who has been looking after both the princess and the country in place of the king watches on with great pride. \n \nHowever, this is not to last. For the moment the bracelet of Milinia touches Aisya's wrist a giant flaming serpent descended from the skies and set fire to the whole country. The green, prosperous Milinia and its majestic palace is no more, everything has fallen apart around Aisya when she finally came to her senses. \nWhile the casualties are great, miraculously, some warriors survived the flame, this include the regent. Although they are no longer human, they are alive as ash soldiers. Accompanied by these survivors, Aisya sets off to find out the truth behind the flaming serpent and ways to revive her country.\"", "id": 44072}]