[{"genres": [4], "name": "Fatal Fury Special", "videos": [{"video_id": "AlZ1q2Gddsc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cwc6ncgkxaftroc2rb1w.jpg", "width": 250, "cloudinary_id": "cwc6ncgkxaftroc2rb1w", "height": 335}, "summary": "The GRANDMOTHER of all battles! 15 of the FATAL FURY series' top stars gather in the match of the millenium! Use the resurrected Geese Howard and Wolfgang Krauser in a dazzling arena! All you have ever wanted in a fighting game is here in FATAL FURY SPECIAL!", "id": 5385}, {"genres": [14, 33], "name": "Windjammers", "videos": [{"video_id": "-tYWIOI0SQI", "name": "Trailer"}, {"video_id": "I5OSsVUyhe0", "name": "Gameplay video"}, {"video_id": "u0pAuIwMmM4", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f8z0picpbymabhzsrpsz.jpg", "width": 250, "cloudinary_id": "f8z0picpbymabhzsrpsz", "height": 322}, "summary": "Windjammers (also known as Flying Power Disc in Japan) is a fast paced sports arcade game released by Data East on the Neo Geo arcade system in 1994 and later on the Wii Virtual Console in Japan on June 22, 2010. Following the bankruptcy of Data East, the intellectual rights for this game were acquired by Paon.[1] It was delisted in Japanese Virtual Console for the Wii on December 24, 2013, making it the only delisted Neo-Geo game for the Wii Virtual Console. \n \nThe game mechanics are essentially the same as Pong or air hockey, where players continuously shoot the disc at the goal zone of the opponent attempting to score. The game can be played against the computer or in a 2 player versus.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xnmpzka2wnm4mje5iqod.jpg", "width": 1920, "cloudinary_id": "xnmpzka2wnm4mje5iqod", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zaow7ce2lcpah89gdk0c.jpg", "width": 1920, "cloudinary_id": "zaow7ce2lcpah89gdk0c", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q979yo7ntwj91rf7vhi3.jpg", "width": 1920, "cloudinary_id": "q979yo7ntwj91rf7vhi3", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eb5twchyop3foums44ty.jpg", "width": 1920, "cloudinary_id": "eb5twchyop3foums44ty", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kgh22gwsnlycfac3wmgl.jpg", "width": 1920, "cloudinary_id": "kgh22gwsnlycfac3wmgl", "height": 1080}], "id": 11222}, {"genres": [4, 33], "name": "The King of Fighters '95", "videos": [{"video_id": "greALx7jn4U", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bzwd3mjw7ghoptfjdpkl.jpg", "width": 1130, "cloudinary_id": "bzwd3mjw7ghoptfjdpkl", "height": 1000}, "summary": "The King of Fighters '95 is a 1995 fighting game produced by SNK for the Neo Geo arcade and home console. It is the sequel to The King of Fighters '94 and the second game in The King of Fighters series. It is also the first game in the series to be ported to other home consoles besides the Neo Geo AES and Neo-Geo CD, with versions released for the PlayStation, Sega Saturn and Game Boy. It was also rereleased in The King of Fighters Collection: The Orochi Saga in 2008 for the PlayStation 2, PlayStation Portable and Wii.", "storyline": "The King of Fighters '95 marks the beginning of a story arc that later became known as the \"Orochi Saga\". However, the only elements from the Orochi Saga known in this game is the introduction of Kyo's rival, Iori Yagami, and Rugal's use of the Orochi power. \n \nRugal Bernstein, thought to have perished in an explosion in the previous game, had in fact survived and sent out invitations to the teams from the previous game signed simply ‘R'. Only one of the previous teams failed to attend the new tournament: the American Sports Team, now replaced by the \"Rival Team\" consisting of Iori Yagami, Billy Kane (from Fatal Fury: King of Fighters), and Eiji Kisaragi (from Art of Fighting 2). Saisyu Kusanagi, Kyo's father, appears as a fighter for the first time (having made a non-playable cameo in KOF '94) as a computer-controlled sub-boss character. After defeating Saisyu in the arcade mode, it is revealed that Saisyu was being brainwashed and that Rugal will fight once again as a boss character, but as an enhanced version named \"Omega Rugal\".", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/r2qsukspiwjkoa2gaxic.jpg", "width": 320, "cloudinary_id": "r2qsukspiwjkoa2gaxic", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qebbs3nzux0ezlctt2qc.jpg", "width": 304, "cloudinary_id": "qebbs3nzux0ezlctt2qc", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xloi3a5nmxsb4c2hveqc.jpg", "width": 304, "cloudinary_id": "xloi3a5nmxsb4c2hveqc", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ky7jy6roi6xidjg4somv.jpg", "width": 640, "cloudinary_id": "ky7jy6roi6xidjg4somv", "height": 480}], "id": 15427}, {"genres": [5, 33], "name": "Last Resort", "videos": [{"video_id": "aybhwlEV0EM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aw2ulsmplys3uy7lsjvk.jpg", "width": 802, "cloudinary_id": "aw2ulsmplys3uy7lsjvk", "height": 1024}, "summary": "Last Resort is an arcade shoot 'em up video game by SNK released in 1992.", "id": 36750}, {"genres": [4], "name": "The King of Fighters '94", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gk6amb6lggh7fedcvzsq.jpg", "width": 574, "cloudinary_id": "gk6amb6lggh7fedcvzsq", "height": 744}, "summary": "Rugal Bernstein is an incredibly rich and notorious arms and drug trafficker, as well as an incredibly skilled and ruthless fighter. Having become bored with the lack of competition, Rugal decides to host a new King of Fighters tournament. Rugal has his secretary travel to eight destinations around the world and invite fighters to his new tournament. Unlike the previous KOF tournaments depicted in the Fatal Fury series, the new King of Fighters is a team tournament, with eight teams of three, each representing a different nationality, participating this time. Most characters come from other SNK games, such as Team Italy, which is composed of three heroes from the original Fatal Fury: Terry Bogard, Andy Bogard and Joe Higashi. The two heroes from Art of Fighting (Ryo Sakazaki and Robert Garcia) are featured along with their mentor and Ryo's father (Takuma Sakazaki) make up Team Mexico. Team Korea features Kim Kaphwan from Fatal Fury 2 as the leader of two convicts he's trying to reform Chang Koehan and Choi Bounge, while Team England is a mix of female fighters from Fatal Fury 2 (Mai Shiranui) and the Art of Fighting series (Yuri Sakazaki, King). The two heroes from Psycho Soldier (Athena Asamiya and Sie Kensou) form Team China along with their mentor, Chin Gentsai. Similarly, Team Brazil features the heroes from Ikari Warriors (Ralf and Clark) along with their commanding officer Heidern. Additionally, the game features two teams composed entirely of original characters: Team Japan featuring Kyo Kusanagi, Benimaru Nikaido and Goro Daimon, and Team USA composed of Heavy D!, Lucky Glauber and Brian Battler.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/scvugzx5jvcryrymk5oj.jpg", "width": 1280, "cloudinary_id": "scvugzx5jvcryrymk5oj", "height": 720}], "id": 15426}, {"genres": [12], "summary": "So the story begins ...... \nIt's Eighteen century in Japan, it's a peaceful region. \nThe word \"peaceful\" are only applied to the social status, not the heart of the human. \nThe greed, like the diseases, is spreading through the human heart. \nThe devil within had awaken. And worse, \nthe devil below is risen......", "id": 47587, "name": "Shinsetsu Samurai Spirits: Bushidou Retsuden"}, {"genres": [8, 12], "summary": "Crossed Swords is a hack & slash action RPG arcade game developed by Alpha Denshi and published by SNK for the Neo Geo arcade system in 1990 and Neo Geo console in 1991. Its gameplay was similar to SNK's earlier 1990 first-person shooter and beat 'em up game, The Super Spy, but with role-playing game elements and hack & slash combat instead of shooting and fist-fighting. \n \nThe game allowed cooperative gameplay with up to two players on the same screen.[1] As only the player characters' silhouettes are visible on screen as wire-frame models, much like Punch-Out!!,[2] the game's perspective may be considered either first-person or third-person.[citation needed] The game was later cited as an inspiration for the 2010 first-person fighting game Rage of the Gladiator. A sequel of the game entitled Crossed Swords 2 was released in Japan on May 2, 1995 for the Neo-Geo CD, and was one of the few games designed specifically for the Neo-Geo CD, rather than being an arcade port. \n \nCrossed Swords requires correct timing and movement to progress. The basic rule for the game is to defend first before striking. The player wields both a weapon and shield and can strafe, as well as guard the upper or middle part of the body. Two different weapon strikes are available, a regular attack and a thrusting attack. Weapon-based magic can also be used. Multiple paths through the game are available and the player has an option to skip the first and second chapters freely. \n \nIn the enchanted land of Belkana all was well until plagues of creatures started rampaging through. But it didn't stop there, from deep within the mountains of Graisia, the Demon Warlord Nausizz arose and led the attacks wiping out settlement after settlement. However a brave warrior called \"The Knight of the Journey\" came a long way on a quest to stop these monstrosities. After aiding the Poor Village of Dio from the Caterdragon, the knight heads to the Castle Pulista, but as he is briefed by the king of the problems they face, an elite dark knight appears and kidnaps the princess. The knight fights his way through the enemy lands in the Matius Tower, the Gauda Fortress, the Land Battleship and finally passes the Entrance to the Devil World. Along his way, he is helped by loyalties of the kingdom. The knight battles through the Castle Graisia and comes face to face with Nausizz. As a demon with honour, Nausizz is so impressed with the knight's progress, that he has sent the princess back to Pulista. As the knight defeats Nausizz, he transforms into a fiendish demon dragon. The knight slays him and escapes the collapsing castle. Back in Castle Pulista the knight is offered to come and live with the king. Peace can proceed once more in Belkana.", "id": 47588, "name": "Crossed Swords II"}, {"id": 47590, "name": "Mahjong Kyōretsuden"}, {"genres": [4, 14], "summary": "The flames of battle dance in the ring! Choose from 10 wrestlers. Can you survive the ultimate battle?", "id": 47589, "name": "Fire Suplex"}, {"genres": [26], "name": "Quiz King of Fighters", "videos": [{"video_id": "vPKfiT0mIOg", "name": "Attract Mode / Demo"}, {"video_id": "KNnHSKwTv_c", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ri3lxreqinc7me8n0eqx.jpg", "width": 680, "cloudinary_id": "ri3lxreqinc7me8n0eqx", "height": 680}, "summary": "A quiz game released for arcades running NeoGeo MVS hardware (and later ported to the NeoGeo AES and NeoGeo CD) exclusively in Japan. \n \nThe spiritual successor to SNK's Quiz Daisousasen series, Quiz King of Fighters uses the series' engine and structure (including a variety of new mini-games) while incorporating many characters from the Art of Fighting, Fatal Fury, and Samurai Shodown series (often lifting the assets from the games themselves). \n \nThe truth is sleeping in the battle ...", "storyline": "\"Quiz City is dangerous!\" Yuri Sakazaki screams before she is kidnapped. Who is Yuri's kidnapper? And what is \"Quiz City\"? Called by the city's challenge, six heroes brace themselves and prepare to test their mettle in the streets!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/itufmgmhsnb4cwet86c6.jpg", "width": 320, "cloudinary_id": "itufmgmhsnb4cwet86c6", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xghaxytoz6msjc6yc0xz.jpg", "width": 320, "cloudinary_id": "xghaxytoz6msjc6yc0xz", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kv15isixv45r2fd5gwpv.jpg", "width": 320, "cloudinary_id": "kv15isixv45r2fd5gwpv", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xspjvktnpmcfwiovw69i.jpg", "width": 304, "cloudinary_id": "xspjvktnpmcfwiovw69i", "height": 224}], "id": 51692}]