[{"genres": [10], "summary": "The first game released for the Hyper Neo Geo 64 arcade machine.", "id": 28135, "name": "Road's Edge"}, {"genres": [4, 33], "summary": "\"This title appeared in 1997 on the HYPER NEOGEO 64 console as the first 3D polygon version of SAMURAI SHODOWN, the game synonymous with 2D fighting games. Its system resembles SAMURAI SHODOWN IV's and also boasts a number of improvements in its transformation to 3D. The story concerning the new villain Yuga was also a major hit with old and new fans alike.\"", "storyline": "\"It all began over two decades ago...and took several years to carry out. \n\"Yuga the Destroyer\" seized unborn children throughout the land, provided them with various mysterious skills, and then returned them to their mothers. \nThe babies were later brought into the world as if nothing had happened. \nThese infants displayed unique abilities from infancy and were called child gods by some, child demons by others. Over the subsequent decades, they grew to become extremely gifted children, ending up as the true movers and shakers of their generation. \nThen one day \"Yuga the Destroyer\" suddenly appeared before them. \nHe came to show these individuals who remembered nothing of him...a puppet show. \nAnd those who saw this performance remembered: \nthe missions they were given before they came into this world...\" \n \nThen one day \"Yuga the Destroyer\" suddenly appeared before them. \n \nHe came to show these individuals who remembered nothing of him...a puppet show. \n \nAnd those who saw this performance remembered: the missions they were given before they came into this world...\"", "id": 19990, "name": "Samurai Shodown 64"}, {"genres": [4], "summary": "\"This sequel to SAMURAI SHODOWN drew a wild variety of favorable responses upon its release. This second 3-D Samurai title included additions and alterations throughout the game system bringing it closer to SAMURAI SHODOWN 4 than the original \"SAMURAI SHODOWN.\" As far as characters go, the distinction between Chivalry and Treachery is now clearer than ever.\"", "storyline": "\"In an unknown land an eerie disturbance disrupts the sky, leading a dark mass to the land. \nIt is the ultimate evil-it is the reincarnation of Yuga the Destroyer. \nThe objective of this being who once more alights to earth is the unification of this world and the Netherworld using the hermaphrodite male and female-that is, the construction of a utopia to become the foundation for the resurrection of the Dark God. \nAs he resumes his search for the hermaphrodites, those turned into puppets by Yuga's magic unleash their carnage to gather the sacrifices necessary for the ritual of utopian construction. \nThese puppets then employ various means to increase the dead and provide sacrifices. Some, for example, become leaders of the Shogunate to carry out ruthless policies, some became common murderers, and still others deliberately incite revolt against the government. \nThrough the influence of the devilish reincarnation, outbreaks of famine and plagues further increase the dead, providing the evil with yet more strength and delight. \nThe mountain of dead gathered by these means is subsequently heaped up on the altar of the Netherworld and fashioned into two pillars in which the hermaphroditic male and female are to be subsequently imprisoned. \nAt this time one man returns to the Netherworld. The name of this warrior who stands directly before these literal pillars of the dead in the darkness is Asura. Master of magic, he is the dark swordsman appearing in this realm to wreak his revenge on Yuga. \nRegardless, his enemy steadily proceeds with the construction of his utopia. \nThe curtain now rises on this drama of revenge that will engulf both our world and the land of the dead.\"", "id": 19991, "name": "Samurai Shodown 64: Warriors Rage"}, {"genres": [10], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nbmzhypzr4eoigu0hh5e.jpg", "width": 850, "cloudinary_id": "nbmzhypzr4eoigu0hh5e", "height": 1206}, "id": 28136, "name": "Xtreme Rally"}, {"genres": [5], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/k1tp9xwwzeeqbbae542e.jpg", "width": 850, "cloudinary_id": "k1tp9xwwzeeqbbae542e", "height": 1126}, "id": 28137, "name": "Beast Busters: Second Nightmare"}, {"genres": [4], "summary": "The only Hyper Neo Geo 64 game to be ported to another system.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x47puvymylkv3ipuzwg0.jpg", "width": 316, "cloudinary_id": "x47puvymylkv3ipuzwg0", "height": 316}, "id": 28138, "name": "Fatal Fury: Wild Ambition"}, {"genres": [4], "id": 28139, "name": "Buriki One"}]