[{"genres": [5, 32], "name": "Pulstar", "videos": [{"video_id": "QySpbjOi8Q0", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xypb23ayxxhfpypx3jjv.jpg", "width": 727, "cloudinary_id": "xypb23ayxxhfpypx3jjv", "height": 971}, "summary": "The basic gameplay is simple: progress through the levels in the spacecraft, collecting powerups and protecting the spacecraft from destruction. The game has very obvious similarities in design and gameplay to R-Type. It is actually believed that some ex-Irem employees left the company to join Aicom, which used to be a subcontractor for various coin-op manufacturers like Jaleco or SNK.\n\nDespite the familiarities, Pulstar is not without innovations. There is the option of using the weapon power bar, which consists of two halves. The right-hand side of the bar turns blue when the fire button is depressed. When fully charged the ship delivers a devastating emission of energy. The left-hand side turns red when it is continually pressed, shooting out a barrage of smaller, rapid blasts.\n\nThe in-game visuals are mostly pre-rendered 3D graphics, which gives the interactive elements a far more realistic appearance. Great care was taken to really place the player into the world of the game, with cinematic style cut scenes and pre-rendered movies.\n\nThere is a hefty reliance on strategy and not just blasting everything in sight. Using the charged weapon is key, and requires careful precision. Also, once a power up is obtained, a small orb appears at the posterior end of the ship. This can be used as an advantage by deflecting/absorbing oncoming enemy fire and taking out small enemies that run into it.", "storyline": "In the year 2248, the first recorded sign of extraterrestrial life was discovered coming from Mars. The signal emanated from the planet and from it an object travelled through space at light speed out of the Solar System. Earth scientists read the signal, but not knowing the nature of it, warned the world's defenses in case aliens traced the signal and followed it to Earth with the intent to destroy.\n\nEight years later, aliens followed the signal to the Solar System and began attacking the human space craft awaiting them along Neptune’s orbit. The battle between the humans and aliens spread throughout the Solar System; within two years of combat Neptune was disintegrated, Jupiter was turned into a star and more than half of Earth's continents sank from rising ocean levels and the planet's changing axis as a result. Kaoru Yamazaki, lone fighter pilot of the Dino246, is one of the few survivors left of the Pulstar attack force founded to save the Solar System from the alien invaders; it is through her that mankind may have a chance to survive the alien menace.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/feqhuubd8clc9drkglqs.jpg", "width": 1908, "cloudinary_id": "feqhuubd8clc9drkglqs", "height": 1052}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/icslvj82vjrk8lfexk7m.jpg", "width": 1908, "cloudinary_id": "icslvj82vjrk8lfexk7m", "height": 1052}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zqggyvllnpynhh9s8yhw.jpg", "width": 1908, "cloudinary_id": "zqggyvllnpynhh9s8yhw", "height": 1052}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/el74heezh3uqn9mgzdsw.jpg", "width": 1908, "cloudinary_id": "el74heezh3uqn9mgzdsw", "height": 1052}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vbzppjudlnkc1m3pbdox.jpg", "width": 1908, "cloudinary_id": "vbzppjudlnkc1m3pbdox", "height": 1052}], "id": 7255}, {"genres": [5], "name": "Aero Fighters 2", "videos": [{"video_id": "tYRq6hLG-VQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gtujgqkkxslz6ylyagg9.jpg", "width": 2560, "cloudinary_id": "gtujgqkkxslz6ylyagg9", "height": 1440}, "summary": "The game is played with two buttons, with the A button firing projectiles from the plane and the B button launching a special bomb attack which uses a bomb from a limited stock of bombs. Power projectiles can be obtained by destroying buildings and armored enemy planes. There are two types of Power projectiles: \"P\" Power projectiles, that increases the plane's firepower by one level, and \"F\" Power projectiles, that increases the plane's firepower to the maximum level instantly. The maximum level only lasts for a limited amount of shots. \n \nWhen certain ground enemies and buildings are destroyed, money bonuses appear which give a random amount of points each. When the player reaches the end of the stage, the player has to face a boss ship.", "id": 6773}, {"genres": [5], "name": "Sonic Wings 3", "videos": [{"video_id": "xRIugd5FFHQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uh9ntdyigjx7b43yvaqw.jpg", "width": 2560, "cloudinary_id": "uh9ntdyigjx7b43yvaqw", "height": 1440}, "summary": "Ten different planes are available for selection by default, some of whom return from previous Aero Fighters games. An additional two secret characters from previous Video System games can be accessed by entering a code. Various characters can carry different numbers of power-ups (P) and bombs (B) before reaching full stock; picking either of these up while fully stocked grants the player 2,000 points, while a full-power (F) grants 10,000.\n\nDestroying large enemies on the ground, as well as buildings and other prominent bits of scenery, will frequently reveal any of the above powerups as well as currency icons, which change depending upon the nationality of the player's character. Currency icons are worth anywhere between 10,000 and 200 points each; picking the icons up at the very top of the screen nets the maximum, picking them up more than halfway down nets the minimum.\n\nThe game contains a total of 18 stages, of which eight will be played in each of the game's two loops using a branching system. After defeating the bosses of certain stages, a plane will appear with two destructible wings; whichever wing is destroyed first determines the next stage that is played. Stages 3 and 6 are always bonus stages; these have no boss, and will either contain enemies which release lots of power-ups which can be collected for 2,000 points each, or a large number of non-firing ground enemies which release currency.\n\nThe game also contains a number of secrets; both of the last bosses will very rarely be replaced by hidden bosses, who also grant hidden endings. Some smaller enemies will sometimes exhibit unusual behaviour; for example, the gun turrets in the USA stage will occasionally turn into a bust of Villiam from Aero Fighters.\n\nIn two-player mode, players must use any two planes which are on the same row as each other on the character select screen. During gameplay, if both players' sprites sit exactly on top of each other, a powerful combined shot will be fired as long as neither player uses a bomb.", "storyline": "After their presumed defeat, the evil alien forces launch a surprise attack against the Aero Fighters' base, effectively destroying their aircraft. Unable to counter the attack, they must use old WWII-era warplanes with strange modifications, in a desperate scramble for victory.", "id": 6775}, {"genres": [14], "summary": "NCAA Football 2003, released for the PlayStation 2, Nintendo GameCube, and Xbox, featured University of Oregon quarterback Joey Harrington on the cover. \n \nNew features in this version included over 200 licensed fight songs, 3D cheerleaders and 144 different schools. \n \nDynasty mode was enhanced with the ability to redshirt a player and schedule non-conference games before each season. Trophies and awards, modeled after real-life college football awards, was another feature new to this version. Players could win trophies by playing games and could add them to a personal collection which is shown off in a trophy room. These awards include the Heisman, Coach of the Year and Bowl-specific trophies. The game featured 23 different rivalry trophies that were created to represent their real-life counterparts. \n \nCreate-A-School mode returned in this edition of the game after being absent from the previous year. The game also featured a customizable interface for the first time. A player could choose his or her favorite team and the game interface would be based around that team's fight song, mascot, logos and school colors.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kkmcslrevflhoiibbl3p.jpg", "width": 188, "cloudinary_id": "kkmcslrevflhoiibbl3p", "height": 268}, "id": 5955, "name": "NCAA Football 2003"}, {"genres": [5, 8, 31], "name": "Metal Slug X", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/k2ya3bz6lrqulucv5riu.jpg", "width": 300, "cloudinary_id": "k2ya3bz6lrqulucv5riu", "height": 295}, "summary": "An upgraded version of Metal Slug 2 (Metal Slug 2: Super Vehicle-001/I), titled Metal Slug X, was released in March 1999 for the Neo Geo MVS. It fixed slowdown problems from the original game, and increased the difficulty. Metal Slug X also introduced some new elements to the game system.\n\nMetal Slug X was ported to the Neo Geo AES in May 1999 and the PlayStation in January 2001.[10] The PlayStation version was released in North America and PAL regions by Agetec and features the same \"Combat School\" mode featured in the Neo Geo CD versions of the first two games.\n\nThe game solved 80% of all the bugs, glitches and slowdown that Metal Slug 2 had, and even changed the daytime of most of the levels. Bosses were also placed into more suitable positions and even more enemies were added to the final mission making it even more difficult than before", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yfs8vzgyldjj5ds9j1tv.jpg", "width": 832, "cloudinary_id": "yfs8vzgyldjj5ds9j1tv", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/okkbj7vwffybu52xxxdh.jpg", "width": 832, "cloudinary_id": "okkbj7vwffybu52xxxdh", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lcevxdhrrpsqwuvpmbdm.jpg", "width": 1440, "cloudinary_id": "lcevxdhrrpsqwuvpmbdm", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/umg2kkpxwsiurkwuqukf.jpg", "width": 832, "cloudinary_id": "umg2kkpxwsiurkwuqukf", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rrmumpymxbbao1xiy1hk.jpg", "width": 1440, "cloudinary_id": "rrmumpymxbbao1xiy1hk", "height": 1080}], "id": 18840}, {"genres": [4], "name": "SNK vs. Capcom: SVC Chaos", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kcob0mx49bprsczavqqg.jpg", "width": 225, "cloudinary_id": "kcob0mx49bprsczavqqg", "height": 333}, "summary": "SNK vs. Capcom: SVC Chaos primarily utilizes the command system of The King of Fighters series, incorporating light/strong kicks, punches, cancels and charging attacks. Unlike its predecessor, Capcom vs. SNK 2, this game lacks both air guards and a \"groove system\", instead focusing on quicker gameplay. Characters are provided with a basic 3-level bar system for executing super-special attacks with basic filling options attributed to strikes and damage. Additionally, the sprites from the various series received new models and some special effects were changed in the command lists (for example, the player cannot increase the damage of the Zujou Sashi used by Choi Bounge by tapping the buttons anymore).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/qolvbuf6zzm8fsrclwoz.jpg", "width": 1440, "cloudinary_id": "qolvbuf6zzm8fsrclwoz", "height": 1008}], "id": 6184}, {"genres": [4], "name": "Fatal Fury Special", "videos": [{"video_id": "AlZ1q2Gddsc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cwc6ncgkxaftroc2rb1w.jpg", "width": 250, "cloudinary_id": "cwc6ncgkxaftroc2rb1w", "height": 335}, "summary": "The GRANDMOTHER of all battles! 15 of the FATAL FURY series' top stars gather in the match of the millenium! Use the resurrected Geese Howard and Wolfgang Krauser in a dazzling arena! All you have ever wanted in a fighting game is here in FATAL FURY SPECIAL!", "id": 5385}, {"genres": [4], "summary": "The plot of Fatal Fury centers around a martial arts tournament known as the \"King of Fighters\" tournament, held in the fictional American city of South Town and sponsored by local crime boss Geese Howard. Ten years prior to the events of the game, Geese murdered a rival martial artist named Jeff Bogard who was on his trail. Now, Jeff's sons, Terry and Andy, along with their friend Joe Higashi, enter the tournament to get their revenge on Geese.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/okqzjl7mb2pt8ayccy16.jpg", "width": 220, "cloudinary_id": "okqzjl7mb2pt8ayccy16", "height": 278}, "id": 5386, "name": "Fatal Fury: King of Fighters"}, {"genres": [4], "summary": "After Geese Howard's death in the original Fatal Fury, a mysterious nobleman becomes the sponsor of the new \"King of Fighters\" tournament. This time, the tournament is held worldwide with fighters around the globe competing. As the single player mode progresses, the mysterious challenger begins defeating the participants from the previous Fatal Fury game, searching for the man responsible for defeating Geese.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iudxvmedr6u16twdzfvc.jpg", "width": 255, "cloudinary_id": "iudxvmedr6u16twdzfvc", "height": 327}, "id": 4435, "name": "Fatal Fury 2"}, {"genres": [4], "summary": "In early Japan, a man named Shiro Tokisada Amakusa preaches a heretic religion. Little does anyone know that Amakusa is really a servant of the evil Ambrosia, who took over Amakusa's body. Ambrosia wishes to shroud the world in darkness. Now, choose between 12 warriors (and 3 bonus characters) to fight for the honor of destroying Amakusa, and fulfilling a mission.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dyeld0ai8x2hskftzdtk.jpg", "width": 1612, "cloudinary_id": "dyeld0ai8x2hskftzdtk", "height": 3083}, "id": 4260, "name": "Samurai Shodown"}, {"genres": [4, 12, 13, 15, 25], "name": "Sengoku", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wptw6deizpes0gxh70xg.jpg", "width": 230, "cloudinary_id": "wptw6deizpes0gxh70xg", "height": 293}, "summary": "Use your power as a Feudal Lord to unite the land of the Rising Sun under your iron fist.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/g2ukftw81cw6f6sjm9wo.jpg", "width": 1920, "cloudinary_id": "g2ukftw81cw6f6sjm9wo", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jxi5nc5fph8aru5wc2tn.jpg", "width": 1920, "cloudinary_id": "jxi5nc5fph8aru5wc2tn", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qmyhaoqqkjsrvfvlebtp.jpg", "width": 1920, "cloudinary_id": "qmyhaoqqkjsrvfvlebtp", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wkd8ntzfwf60ij8s8nlm.jpg", "width": 1920, "cloudinary_id": "wkd8ntzfwf60ij8s8nlm", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w8i1qcb6aemuodat0yai.jpg", "width": 1920, "cloudinary_id": "w8i1qcb6aemuodat0yai", "height": 1080}], "id": 5433}, {"genres": [5, 8, 31, 33], "name": "Metal Slug 2", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w77bw6wbwr6qprutaxlv.jpg", "width": 864, "cloudinary_id": "w77bw6wbwr6qprutaxlv", "height": 1203}, "summary": "“METAL SLUG 2”, the 2nd entry in SNK’s emblematic 2D run & gun action shooting game returns to the battlefield on the Steam gaming platform!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ftfbv8gax3iznaezpoxd.jpg", "width": 800, "cloudinary_id": "ftfbv8gax3iznaezpoxd", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ytbqd8fugj7jclz0qjkp.jpg", "width": 800, "cloudinary_id": "ytbqd8fugj7jclz0qjkp", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qbl0kitfowkfjmanfess.jpg", "width": 800, "cloudinary_id": "qbl0kitfowkfjmanfess", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/emn900imbibjrqbxgvy6.jpg", "width": 800, "cloudinary_id": "emn900imbibjrqbxgvy6", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ux49v0arkvk5hpahslg0.jpg", "width": 800, "cloudinary_id": "ux49v0arkvk5hpahslg0", "height": 600}], "id": 1407}, {"genres": [5, 8], "name": "Metal Slug", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xuhoelv47blqvm1ouzf9.jpg", "width": 886, "cloudinary_id": "xuhoelv47blqvm1ouzf9", "height": 991}, "summary": "“METAL SLUG ”, the very first title in SNK’s legendary 2D run & gun action shooting game series where all began, returns to the missions on the Steam gaming platform!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/oz5kmecrirjvycobbi1s.jpg", "width": 1280, "cloudinary_id": "oz5kmecrirjvycobbi1s", "height": 720}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qptrjpesvldzpxx7x8t9.jpg", "width": 1280, "cloudinary_id": "qptrjpesvldzpxx7x8t9", "height": 720}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/stjez9zyonlugya3whub.jpg", "width": 1280, "cloudinary_id": "stjez9zyonlugya3whub", "height": 720}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pkgy0vh3uww0vbdavoi1.jpg", "width": 1280, "cloudinary_id": "pkgy0vh3uww0vbdavoi1", "height": 720}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xwupa65o4su4fklevqwn.jpg", "width": 1280, "cloudinary_id": "xwupa65o4su4fklevqwn", "height": 720}], "id": 1404}, {"genres": [8, 33], "name": "Magician Lord", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z6l8w4trlpvx3gbaldlj.jpg", "width": 600, "cloudinary_id": "z6l8w4trlpvx3gbaldlj", "height": 780}, "summary": "Magician Lord (マジシャンロード Majishan Roodo?), is a side-scrolling platform game developed by ADK that was released on April 26, 1990. It was a launch title for both the Neo-Geo MVS (arcade) and AES (home) systems, and was one of the pack-in games for the Neo-Geo AES. The game was re-released through the Virtual Console download service in Europe and Australia on October 26, 2007, and in North America on October 29, 2007. It was later released for the PlayStation 3 and PlayStation Portable through the PlayStation Store. It was previously included in SNK Arcade Classics Vol. 1, released for the Wii, PlayStation 2 and PlayStation Portable in North America on May 1, 2008.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vtlmx3wlvqkt5rpphz3j.jpg", "width": 1280, "cloudinary_id": "vtlmx3wlvqkt5rpphz3j", "height": 720}], "id": 19109}, {"genres": [14], "name": "Neo Turf Masters", "videos": [{"video_id": "QvHO5Go79QQ", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qjuh9jxvi85o6wounkgc.jpg", "width": 1024, "cloudinary_id": "qjuh9jxvi85o6wounkgc", "height": 1024}, "summary": "Neo Turf Masters is a golf video game by Nazca for the Neo Geo, released in 1996. This is also one of the first two titles by Nazca, the other being the popular Metal Slug before & between being acquired by SNK.\n\nThe game is a fast paced, arcade-style golf game. Players choose from two game modes, stroke play for one or two players, and match play for two players only.\n\nCompeting on one of four fictional golf courses located in the United States, Japan, Australia and Germany, players choose from one of six players with different attributes:\n\n \"Young Hero\" (George Spinner, USA)\n \"Technician\" (Thomas Stewart, United Kingdom)\n \"Veteran\" (Frank Adams, Australia)\n \"Shot Maker\" (Robert Landolt, Germany)\n \"Power Golfer\" (Fernando Almeida, Brazil)\n \"Putt Master\" (Toyoshige Takeno, Japan)\n\nUnlike many golf games of the era which used a two-click swing system to determine the hook or slice of the ball, Neo Turf Masters uses a single click for the power of the shot, and a second for the height of the shot; hook and slice are selected with buttons B and C before making the shot. This makes the game much easier to pick up and play well than its contemporaries, but it compensates for this reduced difficulty with fiendish (if somewhat unrealistic) course layouts and highly variable wind.", "storyline": "NEO TURF MASTERS is an arcade classic that touched an entire generation.\n\nCompeting as one of six international golfers on different courses worldwide, players choose their club, analyze the wind direction, and find the best path to finishing each hole in as few shots as possible.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/phjb9k81qmh7dbvoq70n.jpg", "width": 1280, "cloudinary_id": "phjb9k81qmh7dbvoq70n", "height": 960}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kkrl1qq9xqm8iixjmodk.jpg", "width": 1280, "cloudinary_id": "kkrl1qq9xqm8iixjmodk", "height": 960}], "id": 20323}, {"genres": [4, 33], "summary": "Waku Waku 7 (わくわく7) is a SNK fighting game originally released for the Neo Geo MVS arcade system and published by SUNSOFT in 1996.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hehqu3xstikfghc9k5ii.jpg", "width": 363, "cloudinary_id": "hehqu3xstikfghc9k5ii", "height": 515}, "id": 27593, "name": "Waku Waku 7"}, {"genres": [9], "summary": "The Irritating Maze quite literally lives up to its name. It's a maze, of sorts, and it's one hell of an irritating game. In fact, it is one of the most irritating games that most will ever come across. But it does have its charms, namely its offbeat gameplay. \n \nThe graphics are bright and colorful, with a lot of eye candy everywhere. Depending on your point of view, this may or may not be a good thing, as all that coloring and eye candy has been designed specifically to distract you from beating the level. All that glitter is isolated to the areas immediately surrounding the track, and if you look off the beaten path you'll notice that the graphics there are quite sparse and simplistic. \n \nThe sound and music are passable, though not particularly good. The Irritating Maze's songs sound like generic puzzle game music and are generally pretty forgettable, but they do fit the game's mood. You'll hear an announcer's voice at certain points of the game telling you that you've passed a checkpoint or something like that. \n \nThe announcer sounds reasonably excited, though if you listen you can hear a little bit of electronic fuzz distorting the voice clips. One sound clip stands out above the rest though, and that's the electric zap effect that plays when you lose. When this clip is combined with the associated graphics, the effect is literally shocking. \n \nOne of the biggest reasons why the game is so irritating is that you have to control your character's conducting rod with a trackball. For most people, the trackball is not an ideal input device for precise control, especially when put under the stress of time limits. A digital joystick or D-pad would actually allow you to have more precise control, but then having to deal with unfamiliar controls is part of the \"fun.\" \n \nAt first you'll find the innovative gameplay to be a lot of fun, much like Marble Madness. But unlike Marble Madness, The Irritating Maze's gameplay gets old relatively quickly, and you'll find yourself not caring enough to give the level another go. The Irritating Maze is different enough to be entertaining for a couple of minutes but not quite polished enough to be a lot of fun for the long haul. Give it a quarter or two and see how you do.", "id": 47599, "name": "The Irritating Maze"}, {"genres": [15], "summary": "Shogi no Tatsujin is a Japanese style chess game.", "id": 47600, "name": "Shogi no Tatsujin"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eknfury6jcbo2gszyh6f.jpg", "width": 850, "cloudinary_id": "eknfury6jcbo2gszyh6f", "height": 1200}, "id": 47595, "name": "Jyanshin Densetsu - Quest of Jongmaster"}, {"genres": [4], "summary": "Clean up the Space Pirates! Time: The age of space colonialism. The dreaded Klaptons are on the loose, turning peaceful settlements into ghost towns. Searching for the price on the Klapton's heads come the cosmic bounty hunters RODDY and CATHY. Do these two have what it takes to save the universe? Can they work together without competing for the rewards themselves? Their fate, and the fate of the free universe is IN YOUR HANDS - the legendary team known as TOP HUNTER!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/m42mspjtlr9zbyp9osgw.jpg", "width": 596, "cloudinary_id": "m42mspjtlr9zbyp9osgw", "height": 750}, "id": 47578, "name": "Top Hunter: Roddy & Cathy"}, {"genres": [4, 14], "summary": "Legend of Success Joe puts players in the role of Joe, a young boxer aspiring to make it up the ranks of the boxing world. But all is not well in Joe's world, and between boxing matches he may have to contend with street thugs out for his blood. \n \nThe game is viewed from a side 2D view, and Joe can move up and down within the backgrounds as well as forwards and backwards. Fighting consists of using the four basic boxing punches, the straight, the hook, the body blow, and the uppercut, to take opponents down. During boxing matches each boxer has three health bars on screen, with the second smaller than the first and the third smaller than the second. When a boxer's health bar is drained he gets knocked down, but can get back up. When the third health bar is drained that boxer is knocked out and loses the match.", "id": 47580, "name": "Legend of Success Joe"}, {"id": 47573, "name": "Minnasan no Okagesama Desu! Dai Sugoroku Taikai"}, {"genres": [8, 9], "summary": "Zupapa! is a Puzzle game, developed and published by SNK, which was released in 2001", "id": 47577, "name": "Zupapa!"}, {"genres": [14], "summary": "Street Hoop is a 3-on-3 street basketball game. One or two players can choose among 10 teams: France, Spain, U.S.A., Italy, Germany, Taiwan, United Kingdom, China, Japan and South Korea (in the European and Japanese versions. The U.S.A. version features local cities). The teams are rated in 1 to 9 points on four attributes (dunk, 3 point, speed and defense). Each game lasts two halves of 2 minutes each. The game ends if the player loses the first half, needing to spend a continue to play the second half.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/voqg8mi1m8q7bsxfnmwi.jpg", "width": 1540, "cloudinary_id": "voqg8mi1m8q7bsxfnmwi", "height": 2156}, "id": 47582, "name": "Street Slam"}, {"id": 47574, "name": "Chibi Maruko-chan Deluxe Quiz"}, {"id": 47591, "name": "Treasure of the Caribbean"}, {"id": 47575, "name": "Bakatonosama Mahjong Manyuki"}, {"genres": [4], "summary": "Fighter's History was probably the most blatant rip-off of Street Fighter 2 in history (hence the title). Lo and behold, Data East had the audacity to make a sequel a year after the release of the original, even after Capcom tried to sue them for ripping off SF2. \n \nFighter's History Dynamite (also known as Karnov's Revenge) is at least an improvement over the original. The sequel adds playable bosses (Clown and Karnov) and two new characters: Zazie & Yungmie. Besides a better selection of playable characters and some new backgrounds, the game itself really hasn't changed very much in terms of looks or gameplay. \n \nWhile playing Karnov's Revenge, there's just no way to shake the feeling that this game is trying to be Street Fighter 2 with a different cast of characters. For the second time around, it doesn't offer any true innovation to the fighting game genre. Although, you could unlock a special fight against a bull if you beat the game without losing a single round, but who the hell would want to play this game for that long?", "id": 47576, "name": "Karnov's Revenge"}, {"genres": [9], "id": 47594, "name": "Minnasanno Okagesamadesu! Daisugorokutaikai"}, {"genres": [10, 14], "summary": "This game was released around 2001 and is basically a horse race betting game. Bets are placed just prior to the start of the race, different horses have different odds, and then the race begins. Some rather impressive Motion Capture graphics were used for the animation of the horses. After the race is over the winning horse is declared in a slow motion photo finish and the winning bets are paid. Again, the game can be set to \"pay out\" to either an installed coin hopper, or through a \"credit\" re-imbursement system set-up by the location or the operator. The Jockey Grandprix cartridge came complete with a harness cable and settings explanation sheet for just that purpose.", "id": 47597, "name": "Jockey Grand Prix"}, {"genres": [5], "summary": "Shock Troopers is a 1-2 player game where players select one of eight characters to play as. Each character has their own attack. Players also have to choose one of three routes to take. The object of the game is to go toward the end of the level and defeat the end-of-level boss, which is usually a huge vehicle. Crates that are scattered throughout the levels can be broken into to reveal new weapons and power-ups. \n \nThere is a team mode where players have to select three characters. The characters can be switched on-the-fly during gameplay, which is useful if one of them is badly injured. Players can use the other teammates until life-ups can be found.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yi6wjynhyp2secm7juxt.jpg", "width": 1376, "cloudinary_id": "yi6wjynhyp2secm7juxt", "height": 2068}, "id": 47598, "name": "Shock Troopers: 1st Squad"}, {"genres": [9, 33], "name": "Money Puzzle Exchanger", "videos": [{"video_id": "3cmxFE69uyk", "name": "Game intro"}, {"video_id": "5YP1bWatwxs", "name": "Gameplay video"}, {"video_id": "9YZhLRRH4c8", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/utxsrcoh4yk32qgdotw4.jpg", "width": 575, "cloudinary_id": "utxsrcoh4yk32qgdotw4", "height": 820}, "summary": "A puzzle game created in 1997 by Japanese game for the Neo Geo MVS arcade system and ported to the Game Boy and the PlayStation that same year.", "storyline": "In the single player mode, one of two characters can be selected who attempt to beat up to seven idiosyncratically named characters with names like Debtmiser, Mightdealer, Eldylabor, and Cherrybeiter. In the two player mode, both players fight each other until victory. The quicker and more efficiently each player clears out their screen, the quicker the other player's screen will fill up. Since filled screens offer the most opportunity for chaining together large combos, the tide can turn very quickly. \n \nThere is also another single player mode called Solo Mode. Any character can be played in this mode. The aim in Solo Mode is to continually clear the screen from coins and try to keep the game going for as long as possible.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/p3ropzj5gjio9rf6fdi1.jpg", "width": 1000, "cloudinary_id": "p3ropzj5gjio9rf6fdi1", "height": 737}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gj4n8dggxbiewi5fgyk2.jpg", "width": 304, "cloudinary_id": "gj4n8dggxbiewi5fgyk2", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kdb18kczpzzubzmz3mil.jpg", "width": 640, "cloudinary_id": "kdb18kczpzzubzmz3mil", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tz5gz67gh56kax7zj6id.jpg", "width": 304, "cloudinary_id": "tz5gz67gh56kax7zj6id", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/osd8jjujkc2z31nkh1io.jpg", "width": 304, "cloudinary_id": "osd8jjujkc2z31nkh1io", "height": 224}], "id": 37280}, {"genres": [12], "id": 47596, "name": "Shinsetsu Samurai Spirits: Bushido Retsuden"}, {"genres": [9], "id": 47579, "name": "Puzzle de Pon! R"}, {"genres": [26], "name": "Quiz King of Fighters", "videos": [{"video_id": "vPKfiT0mIOg", "name": "Attract Mode / Demo"}, {"video_id": "KNnHSKwTv_c", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ri3lxreqinc7me8n0eqx.jpg", "width": 680, "cloudinary_id": "ri3lxreqinc7me8n0eqx", "height": 680}, "summary": "A quiz game released for arcades running NeoGeo MVS hardware (and later ported to the NeoGeo AES and NeoGeo CD) exclusively in Japan. \n \nThe spiritual successor to SNK's Quiz Daisousasen series, Quiz King of Fighters uses the series' engine and structure (including a variety of new mini-games) while incorporating many characters from the Art of Fighting, Fatal Fury, and Samurai Shodown series (often lifting the assets from the games themselves). \n \nThe truth is sleeping in the battle ...", "storyline": "\"Quiz City is dangerous!\" Yuri Sakazaki screams before she is kidnapped. Who is Yuri's kidnapper? And what is \"Quiz City\"? Called by the city's challenge, six heroes brace themselves and prepare to test their mettle in the streets!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/itufmgmhsnb4cwet86c6.jpg", "width": 320, "cloudinary_id": "itufmgmhsnb4cwet86c6", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xghaxytoz6msjc6yc0xz.jpg", "width": 320, "cloudinary_id": "xghaxytoz6msjc6yc0xz", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kv15isixv45r2fd5gwpv.jpg", "width": 320, "cloudinary_id": "kv15isixv45r2fd5gwpv", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xspjvktnpmcfwiovw69i.jpg", "width": 304, "cloudinary_id": "xspjvktnpmcfwiovw69i", "height": 224}], "id": 51692}]