[{"genres": [13], "summary": "Pacific Warriors II: Dogfight! puts you in the seat of a classic fighter plane during the action-filled Pacific conflict between the Americans and the Japanese during World War II. The focus is on action, not true-to-life flight simulation, but an adrenaline rush as you roar through the skies to take out your next target. Choose your side – American or Japanese, and follow a historically based time flow through 25 missions in each campaign. Pacific Warriors II: Dogfight! for PlayStation 2 is based on the PC version developed by InterActive Vision Games in 2003/2004.", "id": 43538, "name": "Pacif Warriors 2"}, {"genres": [31], "summary": "Garfield: Lasagna World Tour for the PlayStation 2 challenges players to jump into the world of the comic cat in a quest to win the Lasagna World Tour - dressing up Garfield in a variety of humorous costumes (each granting him special powers) while playing a variety of mini-games that everyone in the family can enjoy in single- and multiplayer modes.", "id": 43545, "name": "Garfield: Lasagna World Tour"}, {"genres": [7], "summary": "SingStar game featuring one of Sweden's biggest pop bands, Kent.", "id": 43486, "name": "Singstar Kent"}, {"genres": [10, 14], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nyjsfpwzdckhzjuef6e3.jpg", "width": 970, "cloudinary_id": "nyjsfpwzdckhzjuef6e3", "height": 1382}, "id": 43449, "name": "Le Tour de France: Centenary Edition"}, {"genres": [5], "summary": "In the distant future, a plague of parasitic monsters is sweeping across the known universe; devouring all the resources in its path -- including the distant outposts humanity calls home. The only chance for mankind's survival is a top-secret starship class known as Silpheed and the hyper-skilled pilots at the controls. And so begins the premise of Silpheed: The Lost Planet, a co-development shooting project between Game Arts and Treasure that remakes the early '90s PC shooter of the same name. Features include a large variety of enemy types, multiple weapon upgrades, and polygonal graphics. As an added bonus, Working Designs has removed the slowdown and added analog control for the American version of the game.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qzvgaqrgx3dqpzbp6kmt.jpg", "width": 1524, "cloudinary_id": "qzvgaqrgx3dqpzbp6kmt", "height": 2156}, "id": 22009, "name": "Silpheed: The Lost Planet"}, {"genres": [15], "summary": "SD Gundam G Generation Spirits is a Strategy game, developed by Tom Create and published by Bandai, which was released in Japan in 2007.", "id": 43400, "name": "SD Gundam G Generation Spirits"}, {"genres": [5], "summary": "First offered as a freebie in the United States with purchase of a PlayStation 2 Network Adapter for its initial release (and later included again for free as part of the Greatest Hits package for Twisted Metal: Black,) this online version of the hit car combat game features all of the cars and carnage of the original game across all 18 stages (including all full stages and mini-stages from the full game) of TM:B. The violent cinemas and story mode were excluded in this network-only version (partially to tone the ESRB rating down to a T), but the multiplayer modes for online play still include all four modes -- deathmatch, last man standing, collector, and manhunt -- and options for power relic modifiers can be turned on to twist this evil game out even more. \n \nOnline play originally was limited to only 4 players (2 over 56k), and chat functionality was not included. However, via server fixes, the player count was upped to 8 online via broadband, and a chat function via USB keyboard/on-screen input was also made unlockable when a secret code is entered on the lobby screen.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lns2rtwpdtt0iyvudecz.jpg", "width": 1521, "cloudinary_id": "lns2rtwpdtt0iyvudecz", "height": 2165}, "id": 22240, "name": "Twisted Metal: Black Online"}, {"genres": [5], "summary": "Set in the near future during a period of planetary colonization, Killzone drops you in the middle of a war between the ISA Command and a militaristic separatist faction, the Helghast. As one of four ISA members, your initial objective is to escort a high-ranking official to an evacuation point. You can experience several gameplay modes, including single-player, multiplayer (team-based and competitive), and online play for up to 12 players. Players can equip themselves with an armory of more than 27 different weapons based on modern technology.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/l0xx2vy0eklf1baw3bti.jpg", "width": 1024, "cloudinary_id": "l0xx2vy0eklf1baw3bti", "height": 576}], "id": 43261, "name": "Killzone - Limited Edition"}, {"summary": "Theme Park Roller Coaster aims to deliver a complete amusement park experience. Players can build the coaster of their dreams, and then ride it from a first-person perspective. From that same perspective, you can explore eight environments across four different themes (Lost World, Halloween World, SpaceZone, and Wonder Land), and uncover several hidden mini-games to accompany Theme Park's new physics system and realistic weather effects. As an added bonus, visitors to your creation have brand new features as well: including original skeletal animations and facial expressions that convey their moods. There's even a redesigned interface that was specifically developed for the Dual Shock 2 controller, and an interactive help system to get you well on your way towards building the park you always wanted.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uagmkbzfbtkbl7cmmcrb.jpg", "width": 844, "cloudinary_id": "uagmkbzfbtkbl7cmmcrb", "height": 1221}, "id": 43273, "name": "Theme Park Roller Coaster"}, {"genres": [31], "name": "Fahrenheit: Special Edition", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eq7jeiwumhialdkazayp.jpg", "width": 1500, "cloudinary_id": "eq7jeiwumhialdkazayp", "height": 2150}, "summary": "An extremely rare, card cover, special edition of Fahrenheit. Play both hunter and hunted in this psycho thriller. Set in New York, Indigo Prophecy gives you the chance to speak, explore, interact, fight, and confront unknown dark forces. In the story, you can play as Lucas Kane, one of the many ordinary people that suddenly begin killing total strangers. Constantly burdened by strange visions, you must keep one step ahead of the police as you try to find out what's happening to you. Fahrenheit lets you control one of four characters and lets you make decisions that affect the storyline.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nof6k0cadtli1zv1rntu.jpg", "width": 1273, "cloudinary_id": "nof6k0cadtli1zv1rntu", "height": 758}], "id": 43281}, {"genres": [4], "summary": "Namco Classic Fighter Collection is an exclusive box set collection of three of the best fighting games. TEKKEN TAG is a critical chapter in the premier fighting game of all time. Tekken TAG features a cast of unforgettable favorites, teaming-up for the first time, and unleashing hundreds upon hundreds of moves. SOUL CALIBUR II is one of the most critically-acclaimed, highest-rated titles of all time. A retrospective journey of unparalleled depth, Soul Calibur II features an all-star cast of warriors, ground-breaking weaponry, and an artistic back story that transcends time. TEKKEN 4 is a reprise of the legendary Iron Fist Tournament. It features jaw-dropping graphics, enhanced game play mechanics and fearsome fighting. With eager newcomers pitted against familiar favorites, Tekken 4's multi-level, interactive arena features amazing bone-snapping strategies and challenging game modes.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ngbmemykoogxchbql9k7.jpg", "width": 1846, "cloudinary_id": "ngbmemykoogxchbql9k7", "height": 399}], "id": 43282, "name": "Namco Classic Fighter Collection"}, {"genres": [13], "summary": "The threat from international terrorism has never been greater. When an intelligence report highlights the disturbing prospect that a radical militia group may have access to nuclear weapons the very fabric of our society is under threat. A war is imminent, fortunately at the forefront of your arsenal is an all-new attack helicopter and when the call comes to wage war against the enemy there is only one pilot for the job. \n \nOperation Air Assault is a fast-paced 3D attack helicopter game and your mission is to seek and destroy the radical militia using the most technologically devastating weaponry at your disposal. The war on terror is a reality. Fight the war in Operation Air Assault.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bodsj411woikolradvxx.jpg", "width": 1024, "cloudinary_id": "bodsj411woikolradvxx", "height": 768}], "id": 25507, "name": "Operation Air Assault 2"}, {"summary": "Final Armada is an Action game, developed by I-Imagine and published by Virgin Play, which was released in Europe in 2007.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zxo9o7mjmzs3pjnc9yrp.jpg", "width": 1280, "cloudinary_id": "zxo9o7mjmzs3pjnc9yrp", "height": 720}], "id": 43297, "name": "Final Armada"}, {"summary": "Mobile Suit Gundam: The One Year War is an Action game, developed by Namco and published by Bandai, which was released in Japan in 2005.", "id": 43240, "name": "Mobile Suit Gundam: The One Year War"}, {"genres": [5], "summary": "Originally picked up by Infogrames but later published by Encore, Fugitive Hunter is a realistic first-person shooter from the same team responsible for X-Files: Resist of Serve and Black Dawn. \n \nSet in modern day, War on Terror allows players to travel to locales such as Afghanistan, Utah, Paris, and Miami, as they follow a criminal trail that leads all the way to the Al-Kaeda madman Osama Bin Laden. Features include an extensive behind-the-scenes library of videos, a third-person hand-to-hand mini-game, and 11 different terrorist leaders to hunt down including Bin Laden himself. Available exclusively for the PlayStation 2.", "id": 43383, "name": "Fugitive Hunter: War on Terror"}, {"id": 43502, "name": "Countryside Bears"}, {"genres": [14], "summary": "EyeToy: Kinetic Combat is the sequel to EyeToy: Kinetic. It was released in Europe in November of 2006, but was never released in North America. It is a fitness game for the PlayStation 2 focused around the martial art of Hung Gar kung fu. The game requires an EyeToy camera with a special 'Full Vision Lens' that attaches on the front of the device. \n \nThe main mode of the game is the Personal Trainer mode which is a 16-week program of training involving learning the basic kung fu movements, increasing endurance and strength, developing agility and balance, and tai chi-style relaxation. During the program, a series of exercises is assigned to particular days of the week, with the duration, difficulty and frequency of the activities increasing during the program.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uwla13yxkxcgbq9achtw.jpg", "width": 1528, "cloudinary_id": "uwla13yxkxcgbq9achtw", "height": 2159}, "id": 23119, "name": "EyeToy: Kinetic Combat"}, {"genres": [13], "summary": "Pacific Warriors II: Dogfight! puts you in the seat of a classic fighter plane during the action-filled Pacific conflict between the Americans and the Japanese during World War II. \n \nThe focus is on action, not true-to-life flight simulation, but an adrenaline rush as you roar through the skies to take out your next target. Choose your side – American or Japanese, and follow a historically based time flow through 25 missions in each campaign. Pacific Warriors II: Dogfight! for PlayStation 2 is based on the PC version developed by InterActive Vision Games in 2003/2004.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nmaay1xln9sd3jgmxu2v.jpg", "width": 780, "cloudinary_id": "nmaay1xln9sd3jgmxu2v", "height": 585}], "id": 43448, "name": "Pacific Warriors II: Dogfight!"}, {"summary": "This game allows the user to take control of one of four different dinosaur characters and play against the other three Buzz controllers. It includes 35 multi-player games including go-cart racing, riding a tyrannosaurus rex, and dunking cavemen, which are all played to win dino eggs. The person with the most dino eggs at the end of the game is declared the King of the Dinos.", "id": 43507, "name": "Buzz! Junior: Dino Den"}, {"genres": [13], "summary": "Harvest Moon: A Wonderful Life will span a lifetime on the farm and follow the drama that goes with it. Not only must you build and successfully run a farm, but you must also build a successful life with family and friends! This new Harvest Moon experience will take the best qualities of the series and add more...more animals, more vegetables and more drama! What sort of life will you live?", "id": 20482, "name": "Harvest Moon: A Wonderful Life Special Edition"}, {"genres": [9], "summary": "This is the third game in the Buzz! series and was developed by Kuju Entertainment. Players answer questions asked by the Quizmaster (Buzz) using their Buzz! buzzers. The format is very similar to an actual gameshow, fit with a Quizmaster, his 'delicious' sidekick (Rose), buzzers, a theme song and an audience which claps and laughs. In every type of game, players must choose from easy mode or hard mode.", "id": 43520, "name": "Buzz! The Sports Quiz"}, {"summary": "Sengoku Anthology is a collection of the three games from SNK's Sengoku arcade franchise including Sengoku (1991), Sengoku 2 (1993), and Sengoku 3 (2001). In addition to being able to play the classic arcade games on the PC and PS2, players can unlock artwork by completing each of the games in the collection. \n \nThe Sengoku titles are classic scrolling beat'em up action games. Up to two players can play simultaneously. One of the features of these games is the ability to pick up power-ups to obtain new weapons or transform your character into special characters. In Sengoku 3, players choose different characters with unique weapons and special attacks at the beginning of each level.", "id": 43460, "name": "Sengoku Anthology"}, {"genres": [5], "summary": "A space shooter with vertically scrolling stages. Based on the arcade version.", "id": 43340, "name": "XII Stag"}, {"summary": "An action game with arcade-style submarine combat and exploration. Collect and choose from a selection of weaponry before setting out to destroy the enemy. This is the spiritual sequel to Irem's submarine shooter classic, In the Hunt (Kaitei Daisensou).", "id": 43329, "name": "Sub Rebellion"}, {"summary": "Can you keep a secret this big? When young Angus MacMarrow finds a mysterious, glittering egg on the shores of Loch Ness little does he realise the excitement to come, especially when it hatches into a legendary sea monster! Join Angus and his incredible friend Crusoe the Water Horse on the adventure of a lifetime as they attempt to outwit the soldiers set on destroying the famous Loch Ness monster and help Crusoe escape to the open sea.", "id": 43258, "name": "The Waterhorse: Legend of the Deep"}, {"genres": [4], "summary": "Side scrolling beatem-up action featuring two humanoid girls taking on a robot army. Battle over 10 main stages and then try to complete the hidden 100 Death Road! Defeat enemies and collect their energy cells to improve your combo attacks.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/lo0ft1778ccxockqg07a.jpg", "width": 1024, "cloudinary_id": "lo0ft1778ccxockqg07a", "height": 768}], "id": 43265, "name": "Dragon Sisters"}, {"genres": [10], "summary": "Experience first hand the acceleration, speed and sheer untamed power of over 40 of the world's super bikes from the Honda CBR1000 to the Ducati 999R. Race on circuits such as the new Assen and Laguna Sega; through cities including London and Berlin; Or blast through lusciously recreated country runs from Corsica to the Scottish Highlands. Unlock the world most popular machines from manufacturers like Ducati, Honda and Yamaha in the career and trophy mode, or hone your skills to perfection in the free ride and challenge modes. Separate control for the bike and rider position delivers the ultimate precision motorcycle racing experience. Individually modeled, manufacturer approved bikes featuring the same acceleration, weight, balance and cornering ability as in real life.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hm4biauqvxceabhwfpob.jpg", "width": 947, "cloudinary_id": "hm4biauqvxceabhwfpob", "height": 653}], "id": 43310, "name": "Super-Bikes: Riding Challenge"}, {"genres": [4, 5, 10, 13, 14, 15, 31], "summary": "Produced by Sony Computer Entertainment's internal promotional network and fanbase club, the PlayStation Underground, this sampler disc is available in stores and contains gameplay demos and video teasers of a number of PlayStation 2 games. \n \nThis Jampack (RP-M) version includes games of any content rating up to M, and contains games designed for older gamers only. For those looking for games designed for those of all ages, the Jampack (RP-T) version excludes all M rated adult content. \n \nPLAYABLE :: God of War; MLB 2006; EyeToy Antigrav; Stolen; Delta Force: Black Hawk Down; Juiced; LEGO Star Wars; Fight Night Round 2; Cold Winter", "id": 43316, "name": "Jampack: Volume 12"}, {"genres": [14, 15], "summary": "Do you remember the very first time you went fishing? The fresh air...the soothing sounds of nature around you...the tranquility of the water. Reel Fishing III is a return to nature fishing! Whether you a seasoned veteran or have yet to cast your first line, Reel Fishing III will make it possible to experience fishing as it was meant to be...as it should be...in mother nature. Experience a magnificent 3-Dimensional fishing adventure with beautiful environments, lifelike fish and soothing environmental sounds!", "id": 43390, "name": "Reel Fishing III"}, {"genres": [14], "summary": "The all-new Sensible Soccer comes complete with lightning fast football action, mesmerising dribbling, physics defying sliding tackles and, most famously, a huge amount of unbelievable goals, that can go curling into the top corner, thanks to the outrageous levels of after-touch. Sensible Soccer 2006 returns with a modern take on its trademark zoomed out camera and truly intuitive control system, which delivers total 360-degree control over your players' kicks and movement. Visually, the game has a distinctive new graphical style, which includes cel-shaded players with the classic enlarged heads, designed to appeal both to fans of the series and appeal to a new generation of gamers. The trademark top-down view allows you to see the build up play better than you can in any current football game. This gives the player a huge degree of tactical awareness and control that has never been bettered.", "id": 20535, "name": "Sensible Soccer 2006"}, {"genres": [14], "summary": "A NEW GAME FOR THE NEW SEASON ...The best selling management game on console is back! \n \nALL STATS UPDATED FOR THE 2004/05 SEASON \nNEW IMPROVED FEATURES \n \nImproved 3D Match Engine \nExciting new improvements to match play and fluidity. New goal celebrations. All new player models. \n \nNOW BIGGER New playable leagues - Holland, Portugal and the English Conference League, plus new trophies to play and win \n \nEven Greater Authenticity \nMore realistic look and feel. Official English Football League license and club badges. \n \nExtra Content With XBOX Live \nDownload new Scenario Challenges and Fantasy Teams. Keep your game up to date, download all January '05 transfers. Make your performance official with online High Score tables \n \nPLUS \nOver 20,000 players 850 clubs and 31 countries \nFantasy team mode \nIn-depth player info \nExpert mode \nUnique interface for fast and easy game play \n \nImproved commentary by Barry Davies and presented by Alan Hansen and Gary Lineker", "id": 22299, "name": "LMA Manager 2005"}, {"genres": [14], "summary": "Volleyball Challenge is a Sports game, published by D3Publisher, which was released in Japan in 2003.", "id": 43244, "name": "Volleyball Challenge"}, {"genres": [10], "summary": "Suzuki TT Superbikes features more than 50 vehicles from all over the world, and includes the world famous 37.73 mile Isle of Mann racetrack. For the highest level of realism possible, the course itself has been mapped using data supplied by the government and data captured by the development team. In addition to the traditional racing, the game also features a \"Mad Sunday\" mode that brings riders from all over the world to test their chops on the mountain. Supplementary modes, such as two-player split-screen and sidecar multiplayer are also included, as are bikes from all classes -- from 125cc all the way to the F1 1000ccs!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/h9wmdsgvstmlnimizsyl.jpg", "width": 455, "cloudinary_id": "h9wmdsgvstmlnimizsyl", "height": 640}, "id": 20211, "name": "Suzuki TT Superbikes: Real Road Racing"}, {"genres": [14], "summary": "Spiritual successor to World Series Baseball, ESPN MLB raises the bar with Power Pitching, Online Gameplay and ESPN presentation featuring Jon Miller and Karl Ravech. Take complete control of the mound with new pitches, pitch speeds, pitch interface, pitch animations, pitcher momentum and exclusive ESPN K-Zone pitch analysis. Experience seamless online gameplay for PlayStation 2. Hundreds of new, break-through animations including broken bats, mound conferences, on-deck batters, curtain calls, and player reactions. The developers also added a new General Manager Mode -- now you'll have to answer to the owners if you can't keep your club running on all cylinders. If you don't make wise decisions, you can get fired by your team or, if successful, be lured away by other teams.", "id": 43249, "name": "ESPN Baseball 2K4"}, {"genres": [10], "summary": "Riding Spirits II adds more bikes, tracks and gameplay modes to deliver the PlayStation 2's most comprehensive road bike racer. Gamers can now take to the road with faithfully reproduced motorcycles from famous European manufacturers such as Ducati, Aprilla, Triumph and BMW in addition to top models from Honda, Kawasaki, Yamaha and Suzuki plus Japan's most famous tune shops Yoshimura and Moriwaki. And with engine sizes from 250cc to over 1000cc available Riding Spirits II boasts an impressive 330 bikes, that can be raced in 40 categories around 15 courses from across the globe, including Suzuka and Twin Link Motegi.", "id": 43371, "name": "Riding Spirits II"}, {"summary": "Yetisports Arctic Adventure is a Miscellaneous game, developed by Pirate Games and published by JoWooD Entertainment AG, which was released in Europe in 2005.", "id": 43239, "name": "Yetisports Arctic Adventure"}, {"genres": [12], "summary": "After arriving in Salburg, the game's main protagonist Lilie hopes to build an alchemy academy in the Kingdom. Alchemy is severely under developed in comparison to the Kingdom of El Baldor, which is home to many talented alchemists. \n \nBecause Salburg has never seen the likes of alchemy, Lilie must prove to King Schigsal that the Kingdom would benefit from alchemy. Working through a small workshop in town, Lilie will enlist the help of two bright alchemy students from El Bador, Hermina and Ingrid, to help her work. \n \nLilie's main goal is to gather any aide that she can so that the academy can be built.", "id": 43516, "name": "Atelier Lilie Plus"}, {"genres": [4], "summary": "The King of Fighters: Maximum Impact 2 was released in North America as The King of Fighters 2006, and is a sequel to The King of Fighters: Maximum Impact. MI2 brings you back to the team fighting universe of the KOF with the added spin of using a polygonal engine. \n \nAll of the characters from the original MI return, and are joined by 4 newcomers and 14 secret guest stars, totaling a whopping 38 characters, each with a unique story mode and dozens of possible costumes. \n \nThe story this time deals with the appearance of the evil Jivatma in South Town, where all the heroes converge for their own personal reasons. Gameplay changes include the ability to sidestep and super cancel several moves; additional backgrounds and bonus features can be unlocked after beating the story mode, as well as completing the mission mode and time attack challenges", "id": 43349, "name": "The King of Fighters: Maximum Impact 2"}, {"genres": [14], "summary": "The preparations for the most exciting happening of the year are well on there way. The biggest football match of all times is going to start. \nFC Wild Dogs has been challenged by SV Lion Rocks. The coaches of both teams are still thinking about the final line-up. Today is the day, the match is going to start.... who will win?", "id": 43355, "name": "Animal Soccer World"}, {"genres": [31], "summary": "Time-slip into 1929 to solve the mystery of the Cinema Mansion Serial Murder. But hurry, the death toll is rising and the future could be damaged irrecoverably... \nDynamic pacing, innovative clue and free-speech systems make Glass Rose an adventure game like no other. \n \nWith a supernatural twist and multiple endings, there are many questions, but only one truth...", "id": 43441, "name": "The Glass Rose"}, {"genres": [15], "summary": "After a thousand years of Warfare, the conflict between Sheep and Wolves has entered a new and delirious age : secret and terrifying weapons may soon change the course of the war! \n \nThis full-3D action-RTS is filled with humor and high explosives, as sheep and wolves go at it for the survival and status of their species. Gameplay includes a full tutorial mode to learn the principles of strategy, an ongoing set of story sequences that set up each increasingly-challenging battle, and 2-player co-op multiplayer for console gamers to send the fur and wool flying", "id": 43462, "name": "Furry Tales"}, {"genres": [8], "summary": "Rayman 10th Anniversary Compilation Pack (Rayman 3 + Rayman M + Rayman Revolution): Triple pack contains: Rayman 3 Rayman M Rayman Revolution Rayman M: Rayman’s world kicks into multiplayer overdrive in this total competition crash course with the cast of Rayman 2. Smoke the competition on mind-bending racecourses, or spark up a lum-flinging firefight in the battle arena.", "id": 43339, "name": "Rayman: 10th Anniversary Collection"}, {"genres": [14, 15], "summary": "Take the reins and become the professional team manager of one of the real-life football clubs from LMA Manager 2004's playable English, Scottish, French, German, Italian and Spanish leagues. The game has all the 2003/2004 season stats, with updated statistics for every player and all the transfers after the summer break. The 2004 version is a true advancement for the series that's renowned as the most emotive and entertaining football management game designed exclusively for console players. Complete with a whole new look, more flexible management options, and even more player stats, LMA Manager 2004 also introduces an engrossing new Fantasy Team game mode and, for seasoned managers, a challenging Expert setting in the full game.", "id": 22545, "name": "LMA Manager 2004"}, {"genres": [4], "summary": "Go 12 rounds against the toughest fighters with Boxing Champions. Now you can hook, jab and uppercut with the very best in this great new 3D slugfest! Choose one of nine characters across three fighting weights, take on the fearsome Tournament mode, or try to knockdown all-comers in the Survival mode.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/z86gj4m25ic9z5cemipm.jpg", "width": 792, "cloudinary_id": "z86gj4m25ic9z5cemipm", "height": 592}], "id": 43425, "name": "Boxing Champions"}, {"genres": [5, 7, 8, 9, 12, 14, 15, 31], "summary": "This version of JAMPACK VOLUME 14 includes games rated M and is generally for older gamers, although it does includes games rated E and T. JAMPACK VOLUME 14-M includes demo versions of SHADOW OF THE COLOSSUS, RATCHET: Deadlocked, EYETOY: Operation Spy, OKAMI, HITMAN: Bloodmoney, MLB ?06: The Show, LARA CROFT TOMB RAIDER: Legend, BLACK, DRAKENGARD 2, and DRIVER: Parallel Lines. These games cover several genres, including action, racing, sports, and mission-based adventure. Many of the games included in JAMPACK VOLUME 14-M are from series that gamers probably already know about. RATCHET, TOMB RAIDER, DRIVER, and the EYETOY lines are already very popular, and players can get a sneak peak at the newest games in the series on this volume. For players who want to try out games before the buy them, JAMPACK VOLUME 14-M provides the perfect way to check out a game before spending money on it.", "id": 43314, "name": "Jampack: Volume 14"}, {"genres": [14], "summary": "Sunny Garcia Surfing was released in October 2001 to mediocre reviews. It was developed using an updated version of the Championship Surfer engine. Critics complained that in updating the engine developers did not update the graphics enough, leaving the game looking dated from its launch. Other aspects which received negative attention include a limited trick system and poor camera angles.", "id": 43386, "name": "Sunny Garcia Surfing"}, {"genres": [4, 5, 10, 15, 31], "summary": "Demos: Shadow of the Colossus, Burnout Revenge, Sly 3: Honor Among Thieves, Soulcalibur III, Jak X: Combat Racing, Ratchet Deadlocked, The Chronicles of Narnia: The Lion, the Which and the Wardrobe, Castlevania: Curse of Darkness, Brothers in Arms: Earned in Blood, Genji: Dawn of the Samurai", "id": 43315, "name": "Jampack: Volume 13"}, {"genres": [13], "summary": "Fire up your engine and take your biplane to the skies for some intense dog fighting action. As a true flying ace you must take the battle to the enemy and help bring victory in the war to end all wars! Using your biplane's machine guns, bombs and aerial acrobatics you are charged with keeping enemy forces at bay, giving your ground troops time to make the big push.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ikxvau6v92sx52eari7o.jpg", "width": 400, "cloudinary_id": "ikxvau6v92sx52eari7o", "height": 563}, "id": 9392, "name": "WWI: Aces of the Sky"}, {"genres": [10], "summary": "The mountains of Japan are calling - and so are your racing rivals. With the mysterious disappearance of the reigning champion, the tournament crown is suddenly up for grabs. Many will vie, only one can win. Do you have what it takes to race, grind and drift your way to the ultimate racing prize? Race in the dangerous mountains of Japan - Hakone, Niko, Haruna and Akagi - all faithfully recreated using the most advanced laser techniques to maintain every tight twist and turn.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/g087btdirog3m9ztrmus.jpg", "width": 1510, "cloudinary_id": "g087btdirog3m9ztrmus", "height": 2125}, "id": 21441, "name": "Tokyo Xtreme Racer Drift 2"}, {"summary": "Experience all the excitement and danger of fighting fires in Firefighter F.D. 18. As a firefighter, you'll break down doors with axes, use high-powered fire hoses to smother flames, and avoid collapsing floors while looking for trapped civilians. In addition to blazing fires, you must overcome obstacles such as smoke, gas, explosive chemicals, and environmental dangers that lurk throughout the city. Firefighter F.D.18 puts you in the heat of the action as you unravel the mystery of random eruptions of fire throughout a sprawling metropolis.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/sl8ljj57dv2rhiqhtudn.jpg", "width": 1920, "cloudinary_id": "sl8ljj57dv2rhiqhtudn", "height": 1080}], "id": 22282, "name": "Firefighter F.D.18"}, {"genres": [9, 15], "summary": "Goosebumps Horrorland is a Goosebumps game released on October 28, 2008 for the Wii, Nintendo DS, and PlayStation 2. This game was a tie-in to the Goosebumps Horrorland book series released a few months prior to the game. A child receives a ticket to HorrorLand in the mail, not knowing why it was sent to him. His friend Nate then appears and states that he too received a ticket through the mail. But he is not too worried about it and is very happy to get to go to Horrorland. The child asks his mother if they could go and they get dropped off at HorrorLand. As they arrive, they find a monster at the Front Entrance. Nate questions it to be someone as a swamp monster. The guy in the costume says that he is a \"Horror\" as in \"Horrorland\". The child says he has a great costume and the Horror lets them in, and then he laughs suspiciously. \n \nAt the Theme Park, they both go to Vampire Village where they have made the Fright Restriction, where the rides are more \"fun\". The child feels nervous and suggests that they should go back to the ride Calamity Canyon. Then Nate runs to a fake coffin and starts to act strangely. He acts as a vampire, lays onto the coffin, & it closes on him. The child struggled to open the coffin, until it opened and Nate disappeared. \n \nMeanwhile, after the child goes on the Roller Ghoster to save a girl named Gigi, he tells her what is going on with Horrorland, until a police Horror (Monster Police) tells him to hand over the girl, they both run to get away until the Horror trips over and they both hide near Roller Ghoster, fooling the Horror. Gigi tells him a hiding place in Vampire Village where he can find her. \n \nAt Mad Labs, the child gets a Horror mask from a Horror mask shop. It was the shop owner's last one. The child says it feels like skin, until he puts it on. It then gets stuck on his head and he starts to feel funny, until he turns into a Horror. \n \nMeanwhile in the Secret Tunnels, the child gets caught by Horrifico. He knows that the child is imposter & changes him back into his human form The child says that he is getting out of Horrorland with all the pieces of the ticket. Then, Horrifico then mocks him until the child squirts him with Evil Dust and runs off.", "id": 43301, "name": "Goosebumps: HorrorLand"}, {"genres": [12], "summary": "Spectral Force: Radical Elements is a Role-Playing game, developed by Neverland and published by Idea Factory, which was released in Japan in 2004.", "id": 43413, "name": "Spectral Force: Radical Elements"}, {"summary": "This collection includes all three of the famous action-adventure game Prince of Persia: Prince of Persia: The Sands of Time, Prince of Persia: Warrior Within, Prince of Persia: The Two Thrones. If you want to get acquainted with all the exciting adventures of a nameless prince of Babylon to the Island of Time, this trilogy is for you!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zmklafymo1pocf99tkcy.jpg", "width": 1024, "cloudinary_id": "zmklafymo1pocf99tkcy", "height": 768}], "id": 43430, "name": "Prince of Persia Trilogy Limited Edition"}, {"genres": [12], "summary": "Marvel: Ultimate Alliance is an action role-playing video game developed for PlayStation 2, PlayStation 3, Xbox and Xbox 360 by Raven Software and published by Activision.", "id": 43370, "name": "Marvel: Ultimate Alliance Special Edition"}, {"genres": [4], "summary": "Street Boyz is an Action game, developed by Tamsoft and published by D3Publisher, which was released in Japan in 2004.", "id": 43237, "name": "Street Boyz"}, {"genres": [12], "summary": "Frontiers is the second PlayStation 2 edition of the popular online RPG EverQuest Online Adventures series. Venture through a living breathing online world complete with huge cities, dungeons and underground lairs. Continually added content and new events will expand the gameplay and make the range of things to do virtually limitless. Create custom characters from a vast list of ten races and fifteen different classes--including the newly added Alchemist--each with specific abilities. Immerse yourself in the bustling online community filled with thousands of players; interact with others by chatting, fighting along side, and helping one another.", "id": 43374, "name": "EverQuest Online Adventures: Frontiers"}, {"genres": [7], "summary": "Karaoke Revolution Presents American Idol combines the highly acclaimed Karaoke Revolution game engine with America’s most popular television show to deliver an authentic Idol experience for the PlayStation 2. Sing along to 40 new songs, including hits from the show, and compete from auditions to performances on center stage in your quest to become the next American Idol. \n \nThe standard version of Karaoke Revolution Presents American Idol does not include a Karaoke Revolution microphone (a special bundle is also available for those who need a mic). Players who already own a different Karaoke Revolution game can jump right in with their Karaoke Revolution microphone, or gamers can use a PlayStation 2-compatible USB headset or microphone to play.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xrdu5xcj16gqvyyli8md.jpg", "width": 480, "cloudinary_id": "xrdu5xcj16gqvyyli8md", "height": 360}], "id": 21382, "name": "Karaoke Revolution Presents: American Idol"}, {"genres": [9], "summary": "Buzz! Junior: Monster Rumble is a Miscellaneous game, developed by Cohort Studios and published by SCEE, which was released in Europe in 2007.", "id": 43506, "name": "Buzz! Junior: Monster Rumble"}, {"genres": [4, 12, 31], "summary": "Beat Down: Fists of Vengeance lets you play as one of five fugitives seeking revenge against their enemies. To survive in the dangerous underworld of Las Sombras, you must find allies, earn money, and prove yourself in street battles.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/grt1j0orxewrfl92xljw.jpg", "width": 937, "cloudinary_id": "grt1j0orxewrfl92xljw", "height": 1323}, "id": 43514, "name": "Beat Down: Fists of Vengence"}, {"genres": [10], "summary": "Developed by the same team responsible for the MTV Music Generator series, Super Trucks Racing is a truck-based driving title that offers every official Super Trucks driver, sponsor, circuit, logo, and locations from the 2002 season. Its most renowned feature, however, is likely its physics engine; which is definitely among the most realistic of the time.", "id": 43352, "name": "Super Trucks Racing"}, {"genres": [12], "summary": "Summon Night Gran-These: Horobi no Tsurugi to Yakusoku no Kishi is a Role-Playing game, developed by Flight-Plan and published by Bandai Namco Games, which was released in Japan in 2010.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cagtec1qyfxrz172tmyh.jpg", "width": 1920, "cloudinary_id": "cagtec1qyfxrz172tmyh", "height": 1080}], "id": 43267, "name": "Summon Night Gran-These: Horobi no Tsurugi to Yakusoku no Kishi"}, {"genres": [14], "summary": "Do you dream of cutting down the net in New Orleans? Now you can experience the thrill of being the National Champ with NCAA? March Madness? 2003 -- the ultimate college basketball experience. From the crazed fans in the stands, to the mascots on the court and the fight songs played in the arenas, NCAA March Madness 2003 captures the spirit, excitement and rivalry that is college basketball.", "id": 43271, "name": "NCAA March Madness 2003"}, {"genres": [12, 15], "summary": "The story revolves around Ashley, son of a Lord from the State of Kastol, who recently returned to his home town. While he is with his friends, he receives a message that the neighbouring State of Lumen is under attack from the north by the troops of Genes. He decides to stop Genes and starts his journey to Lumen in order to end the fight and restore peace on the continent.", "id": 43276, "name": "Elvandia Story"}, {"genres": [14], "summary": "Experience the thrills and action of Bass fishing for the first time on the PlayStation 2 computer entertainment system. Continuing THQ's strong tradition of premiere B.A.S.S. Inc. licensed fishing games, Bass Strike brings the sport of fishing to life like never before.", "id": 43286, "name": "Bass Strike"}, {"summary": "Spanning the vast deserts of the Middle East you must bring the War on Terror home to those who would terrorise the free world. As an elite member of Special Forces you must use all your skills and a fearsome arsenal of weaponry to prevent the Elzar Organisation from achieving their sinister objective.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/usghdq74fly8hv92ecig.jpg", "width": 1280, "cloudinary_id": "usghdq74fly8hv92ecig", "height": 720}], "id": 43291, "name": "Stealth Force: The War on Terror"}, {"summary": "In the sequel to Silent Hill, Silent Hill 2 follows James Sunderland, whose life is shattered when his young wife Mary suffers a tragic death. Three years later, a mysterious letter arrives from Mary, beckoning him to return to their sanctuary of memories, the dark realm of Silent Hill. You must guide James through all-new environments and creepy new areas closed off in the original game. Real-time weather effects, fog, morphing, and shadows set the stage for heart-stopping frights. Be brave as you journey to uncover the truth.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/r5bsdbdnxnpzz7bxgqfa.jpg", "width": 800, "cloudinary_id": "r5bsdbdnxnpzz7bxgqfa", "height": 640}], "id": 43292, "name": "Silent Hill 2: Director's Cut"}, {"genres": [4], "summary": "The craziest heroes and heroines! Who's the toughest? It's time to stop talking and start fighting. \n \n14 unique characters, from bikini-girl to chan-saw boy! \nCharacters from D3Publisher's games come together for a head-to-head show down. Each has their own unique and distinctive style, it's up to you to master them. \n \nThe impact system is key to winning! \nLearn your fighter's combos and special moves. If your energy is running low, use a super impact attack to turn the tables on your enemy! \n \nMultiple game modes and bonus features! \nPlay a wide variety of game modes. Including practise mode for trying out new fighters; survival mode for testing your stamina; race against the clock in an attempt to defeat all characters in time attack mode; and more!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aefhfdforwf4n9nsz9f3.jpg", "width": 1520, "cloudinary_id": "aefhfdforwf4n9nsz9f3", "height": 2139}, "id": 43403, "name": "All Star Fighting"}, {"genres": [15], "id": 43428, "name": "World Championship Cards"}, {"genres": [5], "summary": "Mobile Light Force 2 is an Action game, developed by Alfa System and published by Taito Corporation, which was released in Japan in 2002.", "id": 43242, "name": "MLF 2"}, {"genres": [10], "summary": "The Crazy Frog is cranking up the speed for his latest and greatest racing adventure! After winning the cup and escaping the Drone, the Crazy Frog is now ready to shift into the next gear for the craziest race ever! \n \nWith more speed, zanier power-ups, new friends and even more insane tracks, there is no stopping the Crazy Frog this time! Race through the popular music videos of the Crazy Frog world and use even more zany power ups to ba-ding ding the competition.", "id": 43226, "name": "Crazy Frog Arcade Racer"}, {"genres": [7], "summary": "Sampling a good beat from Dance Dance Revolution, Disney Interactive and Ubi Soft have a new groove going in Jungle Book: Rhythm n' Groove. The game brings all of your favorite characters from Disney's animated movie The Jungle Book and gives them something to dance to. You get to see Baloo, Mowgli, King Louie, and others get their Jungle Boogie going to remixed Jungle Book songs like \"Bear Necessities\". Two players can battle it out for King of the Jungle in two-player dance-offs. Yo Bagheera... Do the Funky Panther!", "id": 43375, "name": "Walt Disney's The Jungle Book Rhythm N' Groove"}, {"genres": [10], "summary": "In Need for Speed Most Wanted, you can try to become the most notorious street racer alive. Outrun both racers and cops to increase your reputation and move up the street racing blacklist. You can choose from a variety of vehicle types and destructible urban maps featuring shortcuts, traffic, and patrolling police. Need for Speed Most Wanted also includes online play for challenging other gamers.", "id": 43492, "name": "Need for Speed: Most Wanted - Black Edition"}, {"id": 43499, "name": "Disney Move"}, {"genres": [4], "summary": "The Fatal Fury series was SNK's first ongoing fighting-game franchise, and many beloved SNK characters and locations made their first appearances in Fatal Fury. Now, gamers can see the series in its beginning stages with Fatal Fury: Battle Archives Volume 1. This package includes four classic Fatal Fury games: Fatal Fury 1, Fatal Fury 2, Fatal Fury 3 and Fatal Fury Special. Fatal Fury 1 was the first fighting game to feature a two-plane system, allowing characters to dodge out of harm's way when confronted with a challenger's attacks.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/qwem0mx7sujnqrahjtwo.jpg", "width": 480, "cloudinary_id": "qwem0mx7sujnqrahjtwo", "height": 270}], "id": 21232, "name": "Fatal Fury Battle Archives Volume 1"}, {"genres": [15], "name": "The Adventures of Darwin", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z4krr28ase65vmweagzc.jpg", "width": 346, "cloudinary_id": "z4krr28ase65vmweagzc", "height": 500}, "summary": "In this strategy game , you become the leader of a prehistoric village. Your goal is to advance your socity by hunting and increasing your numbers. The game has three difficulty settings.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/sfzteoa4vfdwckoycdsi.jpg", "width": 480, "cloudinary_id": "sfzteoa4vfdwckoycdsi", "height": 360}], "id": 20371}, {"summary": "Mobile Suit Gundam: Journey to Jaburo is an action game based directly on the Mobile Suit Gundam films and series. The game begins at the start of the series and ends at the ending of the second film. The game plays in an action game format with a standard third person view. It features newly hand animated cutscenes that depict events from the original television series as well as a CGI opening depicting a space battle from the One Year War and then a scene of the Gundam destroying several Zaku IIs before being attacked by Char Aznable. It is also the prequel to Mobile Suit Gundam: Encounters in Space. \n \nThe English dub of the video game features the voices of the actors who were cast for the Mobile Suit Gundam television series as with most games subsequent to the series' dubbing, rather than the English cast of the films. \n \nJourney to Jaburo takes place during the One Year War, and depicts the crew of the White Base making their way from the Side 7 sector of space colonies to the Federation headquarters at Jaburo. The game starts at Amuro Ray's home of Side 7, where three Zaku mobile suits attack the Federation's prototype mobile suit weapons. Amuro, in the confusion, fights the Zaku units in the Gundam, and is assigned to the White Base as the Gundam's pilot. After the White Base leaves the colony, it is pursued by Char Aznable, \"The Red Comet\". \n \nChar attacks the White Base during re-entry (where the power of the Gundam's beam rifle was revealed), which diverts them into the Zeon-controlled territory of North America. After going through many Zeon defenses (including Garma Zabi in Seattle), the White Base heads into Asia, where they battle Ramba Ral, an ace pilot who raised Sayla Mass when she was a child. After Ramba Ral commits suicide by jumping into Gundam's hand with a grenade, the White Base crew makes their way to Belfast for repairs. \n \nAfter they leave Belfast, they eventually make it to Jaburo, where Char's \"Mad Angler\" squadron finds the location of the base, and launches a massive attack to conquer it. The Zeon forces are beaten back, and the White Base, now dubbed the \"13th Autonomous Mobile Squadron\", heads out into space.", "id": 43461, "name": "Mobile Suit Gundam: Journey to Jaburo"}, {"genres": [4], "summary": "Jojo no Kimyou na Bouken: Phantom Blood is an Action game, developed by Anchor and published by Bandai, which was released in Japan in 2006.", "id": 43464, "name": "JoJo no Kimyou na Bouken: Phantom Blood"}, {"genres": [14], "summary": "Crazy family fun for up to 4 players! Devious courses. Colourful characters. Unique and exciting settings. Addictive gameplay... ...all adding up to hours of fun for you and your friends. Navigate moving obstacles, water hazards, extreme slopes, jumps and more over a range of themed courses crossing the globe, from the wild west to a pirate's cove.", "id": 43474, "name": "Crazy Golf: World Tour"}, {"genres": [5], "summary": "The latest entry in Takumi's Giga Wing series of shooters arrives on the PS2, complete with the series' trademark \"Reflect Force\" system where you raise a barrier around your ship that launches bullets back at your enemy. Score is a big part of the game. What other game lets you get twenty digit scores?", "id": 43477, "name": "Gigawing Generations"}, {"genres": [14], "summary": "FIFA Football kicks its game up a few notches with new installment, FIFA Football 2004. This year's action features more advanced levels of player detail and responsiveness. Play as one of the best players from 16 leagues and 350 teams, from Europe's super leagues to the Americas. Plus, a new Career Mode gives you the chance to take a team from the lower divisions, battle through ranks, sign new players, and turn them into champions. With immersive atmospheres, total realism with the world's premier clubs, and improved gameplay, FIFA 2004 looks to reach the goals of football fans.", "id": 43338, "name": "FIFA 2004"}, {"genres": [10], "summary": "Racing across the tarmac only inches above the road, International Super Karts gives an adrenaline rush like nothing else. Using every ounce of your driving skill is a must in these high-speed, lightweight vehicles. Take part in a variety of championships, exhibition races and time trials to earn extra vehicles and claim the Karting crown.", "id": 43332, "name": "International Super Karts"}, {"genres": [14], "summary": "Virtua Pro Football, known in Japan as World Football Climax, is a PlayStation 2 soccer simulation video game, released by Sega in 2006. The former Italian footballer Roberto Baggio endorsed the Japanese version, having appeared in the TV commercial, flyer and merchandising.", "id": 43397, "name": "Virtua Pro Football"}, {"genres": [10], "summary": "Since April of 1964 the Ford Mustang has sold over 8 million vehicles and has generated a strong following of enthusiasts, aftermarket manufacturers, websites, and publications - all dedicated to this iconic vehicle. \"Ford Mustang\" provides incredible graphics and \"pick up and play\" gameplay - at a value price. Drive the hottest cars from the 40 year history of the Mustang on 22 tracks in 7 U.S. cities. The game features 40 authentically rendered production, concept and racing models from 1964 to 2005, offering arcade-style racing physics and realistic AI, from opponents as well as from obstacle traffic. Compete in \"coin-op\" style Challenges or Career Mode to unlock new cars, tracks and game modes while testing your skills to the limit. Also included: split screen Multiplayer support for Head-to-Head racing.", "id": 43306, "name": "Ford Mustang: The Legend Lives"}, {"genres": [7], "summary": "Pump It Up: Exceed is a dancing game similar to the games in the Dance Dance Revolution series. The Pump It Up dance mat is different from the norm as the arrows are set on diagonals and includes a button in the middle which allows for more complexity in the dance moves that are required to be performed in the game. \n \nThe general gameplay has the player watching a music video as symbols scroll by. The player must match the symbols on the screen with the symbols on the Pump It Up dance pad with their feet. Hitting the arrows in sync with the music will keep the players life bar up and give the player a good rating, while doing the opposite will drain the life bar and give bad ratings. If the life bar drains all the way, the game ends. \n \nThe game has several mode to choose from: \nArcade Mode has the player trying to achieve an “A” or an “S” rating on three consecutive songs. Doing that allows the player to play an extra song. Successfully completing songs in the Arcade mode opens them for play in Home Mode. \nHome Mode allows the player to choose any song they have available to them. \nSudden Death Mode forces the player to perform a song flawlessly or the game ends. \nSurvival Mode - This mode becomes available after the player completes twenty songs in the Home Mode. This is an endurance test for the player, as the game keeps giving the players songs to go through until their life bar is finally depleted. \nVideo Mode - This mode is unlocked after the player completes a total of twenty songs in either Home or Arcade Mode. It allows the player to just watch the videos for any song they've completed. \nTutorial mode - Teaches the player how the game works. \nThe game also keeps track of the players statistics (the rating grades they received for each song). \n \nThe PS2 version of the game features 101 songs, while the Xbox version contains 97 songs, but offers the option to download more songs. As some songs are more difficult then others, the game provides a rating from one to twenty to inform the player on just how hard of a task they are taking on by choosing a particular song.Two dance mats will be required for some songs that offer a freestyle option if the player chooses that setting.", "id": 43313, "name": "Pump It Up: Exceed"}, {"genres": [12], "summary": "Rogue Hearts Dungeon is a Role-Playing game, developed and published by Compile Heart, which was released in Japan in 2007.", "id": 43269, "name": "Rogue Hearts Dungeon"}, {"genres": [10], "summary": "In 2001, Tokyo Xtreme Racer Zero gave players the opportunity to tear up the highways of Tokyo. Now two years later, Tokyo Xtreme Racer 3 adds the highways of Yokohama, Osaka and Nagoya, taking total road length to a monster 200 miles. Choose accurately modeled cars from over 15 different licensed manufacturers such as Nissan, Toyota, GM, Ford, Merceds-Benz and Volkswagen.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fnrghp2pp0zm4ozhliew.jpg", "width": 800, "cloudinary_id": "fnrghp2pp0zm4ozhliew", "height": 1112}, "id": 24184, "name": "Tokyo Xtreme Racer 3"}, {"genres": [31], "summary": "It is the year 2301. Man has terraformed Mars into a beautiful water planet, and has renamed it \"Aqua\". Built upon it is Neo-Venezia, an exact replica of old Venice, with beautiful waterways, palaces and plazas. Akari Mizunashi, a 15 year old girl arrives from Man-Home (formerly known as Earth) to become a gondolier trainee at a company called Aria Company. The company is lead by Alicia Florence, one of the three best gondoliers, also known as the three Water Fairies. Trough hard training, Akari aims to become a Prima herself. Many encounters and mysterious events are sure to follow on this planet of miracles.", "id": 43408, "name": "Aria: The Origination ~Aoi Hoshi no El Cielo~"}, {"genres": [14], "summary": "Following on from the success of Perfect Ace: Pro Tournament Tennis, which sold 80,000 units across Europe last summer, Oxygen Interactive have announced they are to launch a sequel title Perfect Ace 2: The Championships in time for the Wimbledon Championships. Featuring new stadiums, new player models, full player editor, new game mechanics and new animations, Perfect Ace 2: The Championships offers the finest Tennis simulation yet. Perfect Ace 2 takes you on a complete World tour for singles, Doubles and mixed Doubles as well as the option of a quick match anywhere in the world, inc multi-player options for up to 4 players.", "id": 43247, "name": "Perfect Ace 2: The Championships"}, {"genres": [14], "summary": "Premier Manager 09 is a Sports game, developed and published by Zoo Digital Publishing, which was released in Europe in 2008.", "id": 43372, "name": "Premier Manager 09"}, {"genres": [14], "summary": "Released exclusively for the PlayStation 2, Madden NFL 2005: Collector's Edition contains all the features of the regular version, plus a wealth of bonus content. This content includes playable classic versions of Madden from the 16-bit era and two versions from the PlayStation One era; a Madden trivia challenge with more than 1000 questions; Madden Moments, where players can relive the greatest moments of the past 15 seasons; and historical playoff teams from the past 15 years with their authentic uniforms. Also exclusive to the Madden NFL 2005: Collector's Edition will be bonus video content including footage of The Madden Phenomenon, The Music of Madden, an inside look into how this legendary franchise is made each year from scratch, and more.", "id": 43381, "name": "Madden NFL 2005: Collector's Edition"}, {"genres": [7], "summary": "Get your booty on the floor for Dance Dance Revolution X2. Licensed master tracks from some of today's hottest acts will make DDR X2 one for gamers old and new. Debuting in X2 is the unique Dice Master Mode, where players roll the dice to receive a dance challenge and compete to be the ultimate Dance Dance Revolution champion. Players will be able to dance to the beat of an expansive library of over 40 great songs, including a string of top hits recorded by the original artists.", "id": 43218, "name": "Dance Dance Revolution X2"}, {"genres": [9], "id": 43504, "name": "CaveMan Rock"}, {"summary": "Search & Destroy is an Action game, developed and published by Phoenix Games, which was released in Europe in 2006.", "id": 43347, "name": "Search & Destroy"}, {"genres": [5], "summary": "Shadow of Ganymede is an arcade-style space shooter game. \n \nIt's the XXIIth century. The distant Solar System planets become the centres of mining. Since these planets are almost unreachable for humans, the mining rights are granted to the Automatic Mining System Corporation (AMSC), whose control centre is located on Jupiter's satellite Ganymede. On the 20th of May 2114, the central AMSC computer stops responding to the messages from the Earth. On the 21st of May, the Jupiter's cargo ship arrives in the Earth's orbit according to its schedule. However, instead of minerals, the cargo ship brings modified robots, which can annihilate all of the Earth's orbit patrol in a few seconds. The threat of annihilation mounts over The Earth.", "id": 43337, "name": "Shadow Of Ganymede"}, {"genres": [4], "summary": "With the help of the gods, the continent of Atranart had developed into a prosperous civilization. From the dawn of time, magic and technology had both been studied there and had brought great wealth. Then suddenly, the gods disappeared and the world was plunged into war and chaos. And so begins PCCWJ's action beat 'em up, Raging Blades. Offering players four different character classes with differing abilities, Raging Blades boasts nine unique levels with several stages in each, a multitude of difficulty settings, various magical spells, and the option to participate in a story-based campaign or a four-person versus game.", "id": 43324, "name": "Raging Blades"}, {"genres": [14], "summary": "Master the fundamentals of soccer in FIFA Soccer 2003. With more ball control and player moves, this year's FIFA Soccer puts the The Total Club Championship within your grasp. Unleash the skills of the world's greatest players through new player animations and signature skill moves. Experience pressure-cooker atmospheres as you take on Europe's elite teams in their own stadiums featuring actual team chants and songs. EA Sports Freestyle Control lets you produce a feint, one-touch pass, or skill move to leave your opponents standing.", "id": 43335, "name": "FIFA 2003"}, {"genres": [14], "id": 43399, "name": "NFL GameDay 2002"}, {"genres": [5], "summary": "Hitman Trilogy is a box set of Hitman: Blood Money, Hitman: Silent Assassin, and Hitman: Contracts. \nAlso included is a sneak preview bonus disc of Kane & Lynch: Dead Men.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/qm5qlgjw254jryltdqix.jpg", "width": 625, "cloudinary_id": "qm5qlgjw254jryltdqix", "height": 351}], "id": 20084, "name": "Hitman Trilogy"}, {"genres": [31], "summary": "This version of MGS3 came in a special cardboard sleeve, exclusive to HMV stores. The sleeve was also available at a signing event, hand signed by Hideo Kojima and Yoji Shinkawa.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vrlhtaodl0iz20yjatdp.jpg", "width": 1563, "cloudinary_id": "vrlhtaodl0iz20yjatdp", "height": 1109}], "id": 43262, "name": "Metal Gear Solid 3: Snake Eater (Slipcase Edition)"}, {"genres": [10], "summary": "Take to the road in this white-knuckle thriller of from Taito. Choose from a wide selection of Japanese car manufacturers to race, from regular family saloons, to high powered rally cars. Contend with the varying conditions that courses throw at you, from the early morning mist to snow covered terrain. Features include six different car manufacturers, 40 various automobiles, ten courses, and three game modes. Also available in the Japanese version only is iLink and broadband adapter support.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/wt71jm51tddixavsb4ev.jpg", "width": 1786, "cloudinary_id": "wt71jm51tddixavsb4ev", "height": 1064}], "id": 43303, "name": "Tokyo Road Race"}, {"genres": [14], "summary": "For realistic footie action, strap on your cleats for Soccer America: International Cup. The latest to challenge FIFA and MLS for the crown of soccer champ, this rookie drives down the field and puts a few through their nets. The first in its series, Soccer America is coached by ten-year soccer gaming vets, and it shows in the sophisticated AI and blistering graphics. The full power of the PlayStation 2 is on show in 60-frames-per-second motion with motion-captured players animated down to their hair and shadows, all shown in action with nearly 50 different camera positions for soccer action right out of broadcast TV. 18 International teams and 32 American squads line up and shoot hard with bicycle kicks, fakes, and headers. Soccer America features a balanced Easy Play mode to let beginners get into the game, while pro fielders will find the sharp AI more responsive to your fancy moves on the turf than the average soccer sim. With a Multi-Tap (for PlayStation 2), up to four players can call their formations and drive to the net, so limber up and spit out your orange rind--soccer action is calling.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lhxip2juae0gjuvzhsgh.jpg", "width": 1521, "cloudinary_id": "lhxip2juae0gjuvzhsgh", "height": 2133}, "id": 43307, "name": "Soccer America International Cup"}, {"summary": "Shogun's Blade is an Action game, developed by Tamsoft and published by 505 Game Street, which was released in Japan in 2004.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rn9qzjwfyz48snj9xul2.jpg", "width": 1024, "cloudinary_id": "rn9qzjwfyz48snj9xul2", "height": 768}], "id": 43293, "name": "Shogun's Blade"}, {"genres": [10], "summary": "Dirty drivers must test their skill against the elements, as well as against the clock, in the Championship mode raced across densely wooded forest trails, treacherous Alpine passes and the extremes of the African desert. Featuring realistic tuning and modification of your mud-spattered vehicle, it's not just your rallying career youll build up as you race - every part of the car that can be tweaked in reality can be honed in Euro Rally Champion for a fully-customisable rally experience. But even if you don't know your \"rear differential\" from your \"toe-in\" you won't be left choking on the starting grid as Euro Rally Champion gives drivers all of the adrenaline and emotion of an arcade racer as well as the precision and realism of a true simulation. In addition to the single player Time Trial and Championship modes, you can go head-to-head in \"foot to the floor\" multiplayer sessions. Budding stunt drivers and those who simply fancy flipping their car without the risk of fractured limbs and bruised pride can even burn rubber on one of the special Extreme Exhibition stages. These are filled with mad jumps, perilous slopes and the chance to barrel roll your way around adrenaline-inducing arenas of motoring insanity.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ank9bsjktsk5ajisojtk.jpg", "width": 1280, "cloudinary_id": "ank9bsjktsk5ajisojtk", "height": 720}], "id": 43298, "name": "Euro Rally Champion"}, {"genres": [4], "summary": "Round the land is a 3D side scrolling game. Player can choose from any of the available Straw Hat Pirates, clearing each challenge area based of arcs from the East Blue Saga to the Skypiea Arc. After clearing all the levels of each stage the player will have a boss battle with the major enemy leader of the area i.e. Buggy, Crocodile, Enel etc. There are also sub battles featuring characters like Mr. 1 and Jango.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ehl3snqcolz8wfo0j6ex.jpg", "width": 1920, "cloudinary_id": "ehl3snqcolz8wfo0j6ex", "height": 1080}], "id": 43401, "name": "One Piece: Round the Land!"}, {"genres": [7], "summary": "From Wikipedia: \n \nTechnicbeat is an arcade music video game developed by Arika. It is a sequel to the PlayStation 2 game Technictix. The PlayStation 2 version of Technicbeat was published in North America by Mastiff. It was released in Japan in 2002 and the United States in 2004. In this game, players select a song from a preset list and then “play” their chosen song using their on-screen character.", "id": 24168, "name": "Technic Beat"}, {"genres": [8], "summary": "Disney's Lilo & Stitch for PlayStation 2 allows you to relive the movie experience by helping Stitch rescue Lilo from Dr. Pestus and his band of notorious aliens! Along the way, you'll team with Stitch as he outsmarts Bounty Hunter Bob, races cruisers and sets aliens species free! Enjoy non-stop game action as you help Stitch defeat Dr. Pestus and search for a way home.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rrzmrabnqnbg59ibah86.jpg", "width": 929, "cloudinary_id": "rrzmrabnqnbg59ibah86", "height": 532}], "id": 43411, "name": "Stitch: Experiment 626"}, {"genres": [5], "id": 43346, "name": "Psyvariar 2: Ultimate Final"}, {"summary": "Psyvariar: Complete Edition is a Space Shooter game, developed by Skonec and published by Success, which was released in Japan in 2002.", "id": 43351, "name": "Psyvariar - Complete Edition"}, {"genres": [5], "summary": "BioWare's hit game, MDK, has a sequel. MDK2 Armageddon gives the players 10 levels, over 20 types of enemies, three playable characters with unique levels and items for each, and deep story. You can play as Kurt Hectic, Doctor Fluke Hawkins and Max - a six-legged dog - and all three characters have different styles of play. Expect humor and wackiness as well as amazing graphics and gameplay. Sit back and get ready for an explosive, action-packed sequel headed towards the PlayStation 2.", "id": 43456, "name": "MDK2: Armageddon"}, {"genres": [14], "summary": "Soccer Life II combines soccer management, strategy, and player customization into one package.", "id": 43482, "name": "Soccer Life 2"}, {"summary": "Jimmy Neutron is back, but now he's undercover as a super spy in Jimmy Neutron: Jet Fusion. The evil Professor Calamitous plots a sinister plan, and you, as Jimmy must explore dangerous and inventive worlds to stop him. To help you survive this expedition, you'll need high- tech gadgets and weapons such as the Pulse Light Ray, the Gut Buster Fan, and the Jimmy Bot. All your favorite characters from the TV show, including Sheen, Cindy, and even Miss Fowl, appear in the game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hreza5vme29i0ipneqln.jpg", "width": 800, "cloudinary_id": "hreza5vme29i0ipneqln", "height": 600}], "id": 43279, "name": "Jimmy Neutron: Jet Fusion"}, {"genres": [4], "summary": "The game's story involves a fighting tournament during a large festival that allows for any pair of fighters to participate. The participants are allowed to use weapons and alchemical skills. The game's main characters are Edward Elric, Alphonse Elric, and Roy Mustang. The fighting involves the two versus two style of game playing. Each team shares a \"star\" meter which decreases each time one member of the team dies. If all the stars disappear, the battle ends.", "id": 43405, "name": "Fullmetal Alchemist: Dream Carnival"}, {"summary": "Princess Daphne has been kidnapped by the evil dragon Singe and hidden in a medieval castle owned by Mordroc, a powerful and malevolent wizard. To save her, you will take on the persona of Dirk the Daring, a goofy but courageous knight. As he advances through the castle with the help of a magical amulet, Dirk must overcome a slew of challenges, from jumping over flaming pits and climbing ropes to flying across chasms and battling swarms of the wizard's minions. Use cat-quick reflexes, cunning and resourcefulness to solve puzzles, defeat a variety of enemies, and fight your way through the castle to find Daphne and save the kingdom from Mordroc's clutches. \n \nDragon's Lair 3D is an entirely new, built-from-the-ground-up, three-dimensional version of the 1980s coin-op phenomenon. While it stays true to the design and storyline of the arcade game, it offers a massive 3D experience unlike anything else Dragon's Lair fans have played before along with unexpected twists for a whole new adventure.", "id": 22255, "name": "Dragon's Lair 3D: Special Edition"}, {"genres": [13], "summary": "Energy Airforce: is a PlayStation 2 game that focuses strictly on being an authentic flight simulator. \nAll aircraft and weapons used in the game are either existing or prototypes used by the U.S. military. Realistic loads of weapons and fuel (although chaff and flares are unlimited) can be viewed from outside or from a realistic cockpit view. When flying the aircraft in cockpit view, the pilot's leg can be seen depressing appropriately.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kxj41eqlhnjgwzmyxxlq.jpg", "width": 1280, "cloudinary_id": "kxj41eqlhnjgwzmyxxlq", "height": 720}], "id": 43380, "name": "Energy Airforce"}, {"genres": [7], "summary": "Jack of All Trade's FUNKMASTER FLEX DIGITAL HITZ FACTORY for the PS2 provides players with everything they need to make and mix their own sounds like pros. HITZ FACTORY includes over 16,000 instrument sounds and different musical styles for players to mix and match into their own songs. Players can select from among different styles like hip hop, pop, trance, garage indy, and metal, then add, mix, and modify clips from the thousands available to create their own unique songs. HITZ FACTORY also supports USB microphones, so players can even record their own music or vocals to include. Vocals will be analyzed and a new musical riff will be created based off of player's pitch and range. Players can then hear what they just sang as if it was played on a guitar, the drums, or other instruments. HITZ FACTORY also lets players create music videos to go with the music by blending several of the more than 500 clips available into their own video. Up to four different clips can be layered together then mixed with different effects like color, kaleidoscopes, and more. Finally, the DJ Supermixer mode lets players be the DJ with a set of virtual decks to spin. Players who want to work in the music industry or create their own music will love FUNKMASTER FLEX DIGITAL HITZ FACTORY. By turning the PS2 into a recording studio, musicians will be able to make their own songs in no time.", "id": 43217, "name": "Digital Hitz Factory"}, {"genres": [12], "summary": "Eternal Quest is a lavish and engaging title that combines all the vital elements of the third person adventure genre into one perfectly formed product. There is stunning action, glorious combat, a host of magic spells to use and abuse and hordes of enemies to meet and massacre. \nThere is, of course, a brave and battle weary hero to guide to the ultimate prize of peace - and that's you!", "id": 43353, "name": "Eternal Quest"}, {"genres": [10], "summary": "Show no mercy as you fling yourself into the wildest, wackiest cartoon racing games ever! But watch out! Fiendish opponents such as Dick Dastardly and Muttley will do anything to win. \n \nSo you'll need all your speed and wits to be first past the post!", "id": 43447, "name": "Wacky Races Starring Dastardly & Muttley"}, {"summary": "During the dusk of one day, the girl maid Yuuki, who may act reckless at times, was secretly protecting her future master who was returning home from school. This future master was summoned to his grandfather’s villa and found himself facing a large robot army and a man with a hideous face. Faced with so many enemies, Yuuki had to reveal her identity as the secret bodyguard. What is the identity of this master who is attacked by sexy maids and giant robots? And why is that? The key is linked to a certain secret closely related to him…", "id": 43478, "name": "The Maid Fuku to Kikanjuu"}, {"genres": [5, 9], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ntriyhyi7v0bikwwegeb.jpg", "width": 1003, "cloudinary_id": "ntriyhyi7v0bikwwegeb", "height": 1447}, "id": 43453, "name": "Twinkle Star Sprites: La Petite Princesse"}, {"genres": [10], "summary": "Xtreme Speed is a Racing game, developed and published by Phoenix Games, which was released in Europe in 2004.", "id": 43259, "name": "Xtreme Speed"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vkoehmmvxx0a7yvxtaxj.jpg", "width": 1031, "cloudinary_id": "vkoehmmvxx0a7yvxtaxj", "height": 1307}, "summary": "This is the steelbook version of Metal Gear Solid 3: Snake Eater, official titled Limited Metal Edition. This version of the game is not particularly common, possibly because there is no difference between this and the original release apart for the metal case.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vhgq4edagu2ekqe5bg0o.jpg", "width": 1709, "cloudinary_id": "vhgq4edagu2ekqe5bg0o", "height": 1283}], "id": 43264, "name": "Metal Gear Solid 3 – Limited Metal Edition"}, {"genres": [31], "summary": "A really rare collector’s item from the Metal Gear Solid universe. The Sons of Liberty Metal Tin was available in a very limited quantity. Contents: Metal Tin, Standard edition game, Bonus DVD.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gqgr0b1ju13lw8ma0jka.jpg", "width": 1200, "cloudinary_id": "gqgr0b1ju13lw8ma0jka", "height": 800}], "id": 43388, "name": "Metal Gear Solid 2: Sons of Liberty Limited Edition"}, {"genres": [31], "summary": "Explore parts of the town that were closed off in the original - Incredible graphics and true-to-life CG visuals - Real-time weather effects, morphing and shadows - Atmospheric lighting and ambient surround sound makes every moment suspenseful - Dynamic camera effects and beautifully rendered environments - Special digipack packaging includes a free sticker - Includes extra DVD with \"Making Of\", new artwork, trailers for Metal Gear Solid 2 and Pro Evolution Soccer, and more", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/llf994f47gvfq6twsc7a.jpg", "width": 1024, "cloudinary_id": "llf994f47gvfq6twsc7a", "height": 665}], "id": 43277, "name": "Silent Hill 2 (Special 2 Disk Set)"}, {"genres": [12], "summary": "Cardinal Arc is Idea Factory's newest card-based RPG. There's more to it than just that, though, as Gallahad must battle against Heaven and Hell to win as many cards and take over as much territory as he can. There's a two-player versus mode too.", "id": 43284, "name": "Cardinal Arc: Konton no Fuusatsu"}, {"summary": "Pool Paradise: International Edition is a Sports game, developed and published by Conspiracy Entertainment, which was released in Europe in 2006.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ffzmwsgoukmgsdr7bqvr.jpg", "width": 1280, "cloudinary_id": "ffzmwsgoukmgsdr7bqvr", "height": 720}], "id": 43295, "name": "Pool Paradise: International Edition"}, {"genres": [10], "summary": "Climb in, get behind the wheel and buckle up for the ride of your life! Street Lethal is no ordinary racing game. Rampage through the streets of spectacular interactive city envrionments such as London and Paris. Hold on tight as you drive the hottest modern concept cars. If you've ever dreamed about driving high-class speedsters like the Callaway C12, the Pagani Zonda C12-S, and the Fiorvanti F100, you're in luck. Travel through the streets of the world's most prominent cities in a race of the ultimate driving machines. You'll hit speeds above 200 miles per hour as you dodge through street fairs, back alleys, and more in an attempt to win. Experience the power of driving these previously inaccessible vehicles, enjoying 3D graphics and an awesome soundtrack all the while.", "id": 43220, "name": "Supercar Street Challenge"}, {"genres": [31], "summary": "Everblue is an adventure game based on scuba diving. The player takes the role of a scuba diver salvaging items from sunken ships and photographing underwater wildlife while either avoiding or confronting predators like sharks. The game also features an inventory system for collected objects, healing items, weapons, and tools, as well as an above water town with shops and NPCs.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mut2c3iivyupumkjx0cj.jpg", "width": 640, "cloudinary_id": "mut2c3iivyupumkjx0cj", "height": 904}, "id": 37082, "name": "Everblue"}, {"genres": [10], "summary": "Only Crescent Suzuki Racing: Superbikes and Super Sidecars puts you in control of dozens of the meanest superbikes and sidecars on the international circuit, including the GSX-R1000 of British Superbike rider John Reynolds and the fearsome Super sidecar of 2003 world champion Steve Webster. Chicanes, gravel traps and other hazards await you across many amazing race tracks and the ruthless skill of your computer opponents is sure to test your racing technique to the limit. An exciting two-player mode lets you and a friend go head-to-head on every circuit in the game, and even race superbikes and sidecars against each other in the ultimate grudge match!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kwtdshczlxzvzufcim8r.jpg", "width": 800, "cloudinary_id": "kwtdshczlxzvzufcim8r", "height": 600}], "id": 10112, "name": "Crescent Suzuki Racing"}, {"genres": [14], "summary": "SpinDrive Ping Pong puts players at the heart of realistic game play in which you battle your opponents for the top ranking title. SpinDrive Ping Pong's fast-paced, exciting and realistic Ping Pong matches can be played in three different modes: Tournament Mode puts you in a competitive knockout competition, Rally Mode lets you enjoy a thrilling rally and in Exhibition Mode, you can start a single match straight away! Are you able to smash and spin your way to the top and become a world-ranking Spin Drive Ping Pong player?", "id": 43354, "name": "SpinDrive Ping Pong"}, {"summary": "Dynasty Warriors: Gundam, originally released in Japan as Gundam Musou (ガンダム無双 Gandamu Musō?), is a video game based on the Gundam anime series. It was developed by Omega Force and published by Bandai Namco Games. Its gameplay is derived from Koei's popular Dynasty Warriors and Samurai Warriors series. An expanded port for PlayStation 2 called Gundam Musou Special was released on February 28, 2008 in Japan, featuring new scenarios and mobile suits.", "id": 43450, "name": "Gundam Musou Special"}, {"summary": "Plastro, the nefarious leader of the Tan Army, has enlisted the help of the villainous Baron Von Beige to help him set a trap for Captain Blade! \n The Alpha Wolf Squardon once again 'takes to the skies' with an onslaught of new missions, improved helicopters, and more pyrotechnic weaponry than ever before. Join the Air Cavalry as they face a host of challenging foes in their efforts to stop the General's evil plans.", "id": 43466, "name": "Army Men: Air Attack - Blade's Revenge"}, {"summary": "Demolition Girl (also known as The Daibijin) is a ported Japanese game which follows in the tradition of classic monster movies, in that a gigantic creature is destroying the landscape. In this case the gigantic creature is a Japanese woman in a bikini.", "id": 26570, "name": "Demolition Girl"}, {"summary": "Located in the \"Holy Land,\" there exists protein which the legend says that when ingested, it can sculpt the ultimate body. The protein appeared in front of Adon and Samson, asking for protection as it is targeted by the evil builder. Adon and Samson head to the Holy Land to rid the evil from the land and protect the protein.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zry6vasx4rjnsac3j7e7.jpg", "width": 1524, "cloudinary_id": "zry6vasx4rjnsac3j7e7", "height": 2156}, "id": 43418, "name": "Cho Aniki: Seinaru Protein Densetsu"}, {"summary": "In this first person shooter on rails you are George, a ghost hunter, accompanied by his childhood friend and scientist Alicia. You have to exterminate the ghosts that inhabit an old mansion using a special weapon called Spirit Gun. After capturing the various spirits you can read their memories and use this information to solve the mysteries of this ancient mansion.", "id": 43420, "name": "Ghost Vibration"}, {"genres": [14], "summary": "The 2003 version of NGT includes many new innovations: detailed animations, enhanced controls, super realistic trackside details like ball boys and show-time match presentations. \n \nExperience points to improve your player's skills, bonus courts and players to unlock. \n \nThe official courts of Roland Garros (French Open) and the US OPEN as well as both licensed male and female tennis stars.", "id": 43443, "name": "Next Generation Tennis 2003"}, {"id": 43472, "name": "Dinosaur Adventure"}, {"genres": [7], "summary": "Create and sample original music tracks, and remix some songs from today's hip-hop and electronica artists. Songs include OutKast's \"The Way U Move,\" Snoop Dogg's \"From Tha Chuuuch To Da Palace,\" Sean Paul's \"Get Busy,\" Fabolous' \"This Is My Party,\" and Carl Cox's \"Katja.\" You can even combine samples from your own music collection to bring your favorite artists together in a remixed track. With a full-featured Studio Mode--including an editing bay of riffs, beats, bass lines, and vocals--aspiring DJs, producers, and music aficionados alike can easily assemble professional material in a matter of minutes.", "id": 24139, "name": "MTV Music Generator 3: This is the Remix"}, {"genres": [10], "summary": "A Taxi. A Rider. Endless fun. Cheap fare.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jy2wxjnsymw4jd0bpfei.jpg", "width": 1440, "cloudinary_id": "jy2wxjnsymw4jd0bpfei", "height": 1080}], "id": 43457, "name": "Taxi Rider"}, {"genres": [10], "summary": "Sprint Car Racing is perhaps the most extreme, and most electrifying of all of the world`s motorsports. Compensating for their light weight and huge power, these beasts use enormous spoilers and wings to keep themselves on treacherous tracks. Drivers slide around corners sideways and spectacular collisions are frequent, as the cars jostle in tight packs. There is no other sport like it! And now, you can experience the frantic racing action for yourself.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zifdtrgca3eb53rgjbwx.jpg", "width": 1318, "cloudinary_id": "zifdtrgca3eb53rgjbwx", "height": 964}], "id": 43333, "name": "Sprint Car Challenge"}, {"genres": [14], "summary": "Now you can cruise through LA without loading levels or stopping gameplay in Tony Hawk's American Wasteland. You can skate or BMX through a new story mode that takes you through all-new skate areas using tricks that have never appeared in previous Tony Hawk games. The cash that you earn can be used to customize your equipment and your skater by going to tattoo parlors and skate shops. Tony Hawk's American Wasteland also includes a classic mode that features classic Tony Hawk Pro Skater maps and objectives.", "id": 43395, "name": "Tony Hawk's American Wasteland: Collector's Edition"}, {"genres": [9], "summary": "A fast-paced arcade style game of skill, Jelly Belly Ballistic Beans! combines simple but highly addictive gameplay with a world-recognized license to provide a gaming experience that will appeal to casual players as well as seasoned veterans. Try your hand at hundreds of puzzles across 8 different themes. Simple to pick up, but impossible to put down! \nThe main objective is to get the required number of Jelly Belly Beans into the matching cups while scoring points, using power-ups, and earning bonuses along the way. Players use the bean launcher to propel the beans through intricate puzzle patterns. Exploding beans, rocket beans, and extra beans are just some of the power-ups to help players beat the puzzle quickly to score medals.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rxazcowimnqanqwztavn.jpg", "width": 1024, "cloudinary_id": "rxazcowimnqanqwztavn", "height": 576}], "id": 43396, "name": "Jelly Belly: Ballistic Beans"}, {"summary": "Gecko Blaster is an Action game, developed and published by Phoenix Games, which was released in Europe in 2007.", "id": 43256, "name": "Gecko Blaster"}, {"genres": [14], "name": "UEFA Champions League Season 2001/2002", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uw8g0crsweamccukvrk9.jpg", "width": 800, "cloudinary_id": "uw8g0crsweamccukvrk9", "height": 1133}, "summary": "Installment in the UEFA soccer simulation series, featuring rosters and up-to-date data from the 2001/2002 season. This Season's UEFA Champions League gives you the unique opportunity to play against Europe's leading clubs, while also offering you the option to take on previous winners, since 1960. The Official Video Game of The UEFA CHAMPIONS LEAGUE Season 2000/2001. Developed by Silicon Dreams, UEFA Champions League Season 2001/2002 was only released in the Europe market.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/k2kexp03visoppslqwdc.jpg", "width": 1024, "cloudinary_id": "k2kexp03visoppslqwdc", "height": 768}], "id": 22058}, {"genres": [10], "summary": "Wave Rally, also known as Jet Ski Riders, is a 2001 Jet Ski racing game developed by Opus Studio Inc. and published by Eidos Interactive exclusively for the PlayStation 2. It was released in North America and Europe in 2001, and in Japan in 2002", "id": 43304, "name": "Wave Rally"}, {"genres": [10], "summary": "Top Gear: Dare Devil is a game for the Sony PlayStation 2 that involves driving around the cities of Rome, London, Tokyo, and San Francisco. \nThis game consists of Single player and multiplayer. \n \nIn single player, the player drives around one of the four cities, collecting Dare Devil coins. If all Dare Devil coins in a level are collected, the player unlocks a secret car. What also can be collected are keys and wrenches that open up bonus missions. After winning a bonus mission, the player can unlock a paint job for the car used. The player can also free roam around cities. \n \nIn multiplayer, there are three game modes: \n \nLap Racing \nBomb Tag \nCoin Grab", "id": 43274, "name": "Top Gear: Dare Devil"}, {"summary": "Twin Caliber is an Action game, developed and published by Rage Software, which was released in Europe in 2002.", "id": 43410, "name": "Twin Caliber"}, {"summary": "Shikigami no Shiro: Nanayozuki Gensoukyoku is an Action Adventure game, developed by Alfa System and published by Kids Station, which was released in Japan in 2005.", "id": 43419, "name": "Shikigami no Shiro: Nanayozuki Gensoukyoku"}, {"summary": "Pinball Fun is an Action game, developed by HuneX and published by D3Publisher, which was released in Japan in 2003.", "id": 43245, "name": "Pinball Fun"}, {"genres": [10], "summary": "Grab the controls and hold on for dear life with the most electrifying, high-speed racing experience available. \nRace and wreck in enchanting movie-theme worlds, kick it into overdrive with over 30 super-flying vehicles, and blow away the competition with outrageous weapons in the most electrifying racing experience available! \nPreviously known as Revolt 2: Pocket Rockets, this RC vehicle racer graces the 128-bit system with all the slick track designs, great weapons balance, and dead-on control that made the PC and Dreamcast versions such a hit. Luckily, developers from Acclaim's Cheltenham Studios have taken full advantage of the PlayStatation 2 hardware--no longer will tracks be confined to suburban neighborhoods and museums. RC Revenge goes all out to deliver the goods with environments like desert islands and villages wrapped nighttime slumber. And the best part of it all? A level editor for the creative gamer is set to keep the replay value on high", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wv7vlmna0y0t3fdeb1to.jpg", "width": 1524, "cloudinary_id": "wv7vlmna0y0t3fdeb1to", "height": 2156}, "id": 43253, "name": "RC Revenge Pro"}, {"genres": [31], "summary": "Garfield, the world's most famous feline, is back for more adventure, and this time the fur really flies! While taking a well-deserved snooze, Garfield is awakened by dim-witted doggy, Odie, and sees his gal pal, Arlene, in the back of the pound car! Distraught over the idea of never seeing Arlene again, Garfield overcomes his natural selfishness and resolves to rescue her, taking Odie with him -- maybe the mangy mutt can finally be useful! Garfield and Odie set out for a crazy cross-town adventure filled with perils aplenty. Will the cat save the day and get the girl?", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pdiwnbwvkxzqu5srivcp.jpg", "width": 1024, "cloudinary_id": "pdiwnbwvkxzqu5srivcp", "height": 768}], "id": 43445, "name": "Garfield: Saving Arlene"}, {"summary": "Another Century's Episode, abbreviated as A.C.E., is a mecha action video game developed by FromSoftware and published by Banpresto. It was released for the PlayStation 2 in Japan on January 27, 2005. \nAnother Century's Episode is a fast-paced action title featuring characters, mecha, and story elements from nine famous Japanese anime. However, while Super Robot Wars is known for combining super robots, like Mazinger Z, and real robots, like Mobile Suit Gundam, Another Century's Episode exclusively focuses on real robots (later games, however, have included one to two Super Robot series in their casts).", "id": 43263, "name": "A.C.E.: Another Century's Episode"}, {"genres": [5, 10], "summary": "Motor Mayhem is a vehicle combat video game developed by Beyond Games", "id": 43305, "name": "Motor Mayhem"}, {"genres": [15], "summary": "Dai-3-Ji Super Robot Taisen Alpha: Shuuen no Ginga e is a Strategy game, developed and published by Banpresto, which was released in Japan in 2005.", "id": 43309, "name": "Dai-3-Ji Super Robot Taisen Alpha: Shuuen no Ginga e"}, {"genres": [9, 31], "summary": "Shadow of the Colossus is a majestic journey through ancient lands to seek out and destroy gigantic mythical beasts. With a trusty horse at your side, players explore the spacious lands and unearth each towering Colossus creature. The uneasy task of defeating a Colossus relies on intelligent puzzle solving and action oriented game play. \nArmed with strong wits, a mystical sword and a sturdy bow, players use cunning and strategy to topple each behemoth.", "id": 43387, "name": "Shadow Of The Colossus Limited Edition"}, {"genres": [12], "summary": "Gundam: Mobile Suit Saga is the first role-playing game entry into the long-standing Gundam franchise. Thirty-nine different suits are at your disposal to compete against more than 300 different enemies. Customization of characters and suits gives players the ability to control each aspect of their suits, each of which features up to 60 different parts.", "id": 43389, "name": "Gundam True Odyssey: Ushinawareta G no Densetsu"}, {"genres": [14], "summary": "Q-Ball: Billiards Master is a pool player's dream, utilizing the power of the PlayStation 2 to create accurate gameplay in the most impressive pool halls in the world. Players can enjoy realistic gameplay in the most beautiful pool halls in the world, master the techniques used by the pros – including curve shots and position play, Play alone, with friends, or with top ranked professionals, and choose from 10 featured games, plus original options like Billiards and Random Six.", "id": 43272, "name": "Q-Ball: Billiards Master"}, {"summary": "SAS: Anti Terror Force is an Action game, developed by Atomic Planet Entertainment and published by Davilex, which was released in Europe in 2005.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/u1o2wjiawdgpudtj4vce.jpg", "width": 1920, "cloudinary_id": "u1o2wjiawdgpudtj4vce", "height": 1080}], "id": 43294, "name": "SAS: Anti Terror Force"}, {"genres": [5], "summary": "Shooting Love: Trizeal is an Action game, developed by Triangle Service and published by Datam Polystar, which was released in Japan in 2006.", "id": 43415, "name": "Shooting Love: Trizeal"}, {"genres": [4], "summary": "This special collector's edition box set that combines three Mortal Kombat releases from the fighting franchise into one explosive package. Mortal Kombat: Kollection features Mortal Kombat: Deception, Mortal Kombat: Armageddon, and Mortal Kombat: Shaolin Monks, together packing more punch, fatalities and characters into one box than ever before", "id": 43251, "name": "Mortal Kombat Kollection"}, {"genres": [10], "summary": "Moorhuhn: Fun Kart 2008 is a kart racing game starring Moorhuhn (Crazy Chicken) and friends. The eight racing tracks range from a barnyard to beaches to a desert with pyramids in the back ground. Power-ups can be picked up and used on opponents while racing. The player can choose between seven different characters, including two chickens, a frog, turtle, snowman, scarecrow and mole. The game offers three modes: a Championship (two championship each with four tracks), time challenge and two player mode. Kart classes included are 50cc, 100cc and 150 cc.", "id": 43376, "name": "Moorhuhn Fun Kart 2008"}, {"genres": [4], "summary": "Rise to power as \"Gripper\" Hard Knock High's gang leader. Be the toghest thug in the Neighbourhood! Start off fighting in your own school to build up your skills. Master cool fighting styles! Fight your opponents with cool styles like Karate, Boxing, Judo and more... Put Gripper through an assortment of mini-games to strengthen him!", "id": 43350, "name": "Hard Knock High"}, {"genres": [4], "summary": "Based on the popular anime series of the same name Saint Seiya: Chapter Sanctuary brings the legendary conflict between the Knights of Athena and the Knights of Ares home to the PlayStation 2. Battling over the Golden Cloth of Sagittarius, more than 20 different fighters square off against one another across several different modes including those of the Story, Versus, and Practice variety. As an added bonus, several of the show's most memorable moments have been recreated using the latest in CG cinematics as well, with licensed voice-overs specifically re-recorded for the videogame version of the story. Available only in Japan.", "id": 43345, "name": "Saint Seiya: The Sanctuary"}, {"genres": [5], "summary": "Steel Dragon EX offers the best in classic 2D arcade action. Using a wealth of power ups and weaponry, you must save the earth from a robot invasion headed by incredibly powerful bosses across many varied stages.", "id": 43341, "name": "Steel Dragon Ex"}, {"genres": [5], "summary": "Chaos Field is O3 Entertainment's adaptation of the space-shooting Japanese arcade hit of the same name. The game includes three characters, five levels, and multiple weapons to assist you in your 2D shootouts. During gameplay, you can shoot other bullets as they fly at you and use an energy field to absorb the ones you miss.", "id": 43458, "name": "Chaos Field: New Order"}, {"genres": [10], "summary": "Kaido Racer is a Racing game, developed and published by Genki, which was released in Japan in 2004.", "id": 43300, "name": "Kaido Racer"}, {"genres": [12], "summary": "Spectral Force Chronicle is a Role-Playing game, developed by Xpec and published by Idea Factory, which was released in Japan in 2005.", "id": 43414, "name": "Spectral Force Chronicle"}, {"genres": [12], "summary": "An RPG that combines Western-styled history and graphic design with Japanese-styled RPG gameplay, from Korean developer Softmax (one of the first games for the launch of PS2 in Korea.) The sarcastic hero Calintz Jerevinan sets out for adventure after returning home ho his home land of Shudelmir and finds the place overrun with disaster. Along the way, he will meet the mysterious girl Adora, the frosty Princess Juclesia, and other characters in a gigantic game world powered by the ASURA engine. The game uses a FF-style Active Battle system, with Time Points for movement and attach manuever planning, and each character can use one of seven kinds of Carta for tremendous special techniques. \n \nBonus materials include a poster, a mini strategy guide and art book...Revenge is the only thing that can erase this hatred...In the land of Efferia, humans and native-Efferians uneasily co-exist in the throes of an endless war. A young man out for revenge against the natives finds a girl who's lost her memories...Where will destiny lead them...?", "id": 43423, "name": "Magna Carta: Tears of Blood Deluxe Box Set"}, {"genres": [4], "summary": "A double-pack of the two hardcore fighting games from SNK, King Of Fighters 00/01 features all of the tight gameplay and characters (35+ in KoF 2000, over 40 in KoF 2001) of the arcade hits. New features to the home versions include redesigned character select and menu screens, a new continue system that allows players to handicap the CPU fighters as they progress through the game, an auto-save feature, intro movies from these and other previous King of Fighters games, and special new Strikers not seen in the original games or any other versions of these titles. Game modes including Team Play, Party Mode, and even 4-on-4 bouts (KoF 2001 only for 4-on-4) provide hours of gameplay in these classic 2D fighting games.", "id": 43348, "name": "The King of Fighters 2000/2001"}, {"genres": [13], "summary": "Dr. Dolittle is a Simulation game, developed by Aqua Pacific and published by Blast! Entertainment Ltd, which was released in Europe in 2006.", "id": 43255, "name": "Dr. Dolittle"}, {"genres": [14], "summary": "Soccer comes home as you lead your team to victory on or off the field. As a player, you'll tackle, pass, and shoot winning goals from the field. As an owner, you'll buy, sell, or trade players to create a winning team. More than 13,500 officially licensed FIFA pro players from 700 international and league teams compete in 10 stadiums around the globe. Your players can perform a variety of authentic moves, including high-flying headers, bicycle kicks, and goal-saving slide tackles.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vae4moizq5yr9fm1692d.jpg", "width": 450, "cloudinary_id": "vae4moizq5yr9fm1692d", "height": 640}, "id": 22067, "name": "This Is Football 2003"}, {"genres": [14], "summary": "Action baseball game, featuring Midway's classic fast and furious gameplay with beanballs, hard tags, and over-the-top animations. SlugFest features some of the greatest baseball players with the addition of over-the-top abilities, including turbo-speed running, highlight reel-worthy fielding, Earth-shaking collisions and the ability to catch fire and turbo charge the game action. All-new gameplay features add customizable replay, exploding Scoreboards, and updated MLB team rosters. You can also take your coaching skills, players and/or teams online, voice chat with other players, and access an on-screen sports Ticker Tape. Also features an Online Tournament Mode and a soundtrack featuring Ivory Wire, Buckfast Superbee and Flipswitch.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/waetnsbszbavb9njms3g.jpg", "width": 720, "cloudinary_id": "waetnsbszbavb9njms3g", "height": 480}], "id": 23537, "name": "MLB SlugFest: Loaded"}, {"summary": "Atlantis III: The New World is an Adventure game, developed and published by Cryo Interactive, which was released in Europe in 2002", "id": 43299, "name": "Atlantis III: The New World"}, {"genres": [15], "summary": "Sakura Taisen: Atsuki Chishio Ni is a Strategy game, developed and published by Sega, which was released in Japan in 2003.", "id": 43412, "name": "Sakura Taisen: Atsuki Chishio Ni"}, {"summary": "In the game, players assume the role of a news reporter named Pete Goldman for the fictional newspaper Planet Times. Goldman is on assignment to photograph Japan's wildest events and win the Pulitzer Prize. Throughout the course of their journey, players can visit a variety of locations, including a haunted house, a city being overrun by dinosaurs, and an out-of-hand sports event.", "id": 43431, "name": "Polaroid Pete"}, {"genres": [7], "summary": "Flow: Urban Dance Uprising is a breakdancing rhythm game that features a soundtrack of hip hop artists including 50 urban dance tracks by the likes of the Sugar Hill Gang, Kurtis Blow, and Eric B & Rakim. Gamers can compete against as many as seven other players and choose from a host of dancers that perform classic breakdance moves in one of 10 different urban settings. \n \nFlow was originally announced as a component to Eidos' Get On Da Mic (and was known as Get On Da Floor.) In 2005, it became a PS2 exclusive title, brought to market by publisher Ubisoft.", "id": 43385, "name": "Flow: Urban Dance Uprising"}, {"genres": [4], "summary": "In Virtua Fighter 2, the intrepid fighters return to the World Fighting Tournament. Take to the stage to see who will claim the championship title. Will it be Lau Chan, Kage-Maru, Wolf Hawkfield, Jeffry McWild, Akira Yuki, Jacky Bryant, Sarah Bryant, or Pai Chan? The answer lies within. Immerse yourself in this technically challenging game and see if you have what it takes to be the champion of the second World Fighting Tournament! \n \nOn paper, the PlayStation 2 version of Virtua Fighter II mirrors its arcade counterpart exactly. The people who worked on this port were clearly aiming for an arcade perfect title. The game apparently reads the controller at the same frequency as the arcade, 57.5 times per second. Purists who demand perfect timing for their combos should be in heaven. The resolution of the arcade has also been replicated, with VF2 running on the PS2 in 496x384 resolution. This leaves black bars around the game, but you can select to zoom up to full screen in the options menu of you want. The game offers up arcade, versus and ranking modes of play, all playable using either version 2.0 or 2.1 settings (selectable in the options menu).", "id": 43206, "name": "Sega Ages 2500 Series Vol. 16: Virtua Fighter 2"}, {"genres": [4], "summary": "World Heroes Anthology is the complete collection (on one disc) of one of SNK's most popular 2D fighting game series World Heroes. The titles included are: World Heroes, World Heroes 2, World Heroes Jet, and World Heroes Perfect. The collection contains 56 characters using hand-to-hand and weapons based fighting mixed with special super-human abilities enabling each character to perform special attacks. \n \nWorld Heroes Anthology follows the storyline of Dr. Brown, a scientist, who having perfected a time machine has organized a fighting tournament throughout all of history to see who is the best fighter of all time. True to this plot, many of the fighters are based on actual historical figures.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kektdqwbv6az2qjujiqv.jpg", "width": 756, "cloudinary_id": "kektdqwbv6az2qjujiqv", "height": 1059}, "id": 20993, "name": "World Heroes Anthology"}, {"genres": [31], "summary": "THE KINGDOM OF GAMES! \n \nSPOOFISHLY INSANE: THE FIRST VIDEO GAME PARODY! \nConfront the most famous characters in the history of video gaming and discover over a hundred icons of the game-screen hidden among the levels. \n \nACCESS THE LEVELS LIKE CHAPTERS ON A DVD: \nGo directly to the start of each of the 9 theme zones in the park. No more frustration at never seeing the 3rd level - even for the youngest players. \n \nFURIOUS COMBAT. FEATURING A DOZEN EXPLOSIVE ATTACKS. AND OUTRAGEOUS COMBOS: \nRaining Menhirs. Twister Fusion. Lightning Move... \n \n30 MINUTES OF ORIGINAL. GUT-BUSTING. ANIMATED SEQUENCES.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tncxgraz7bjkbh8z9jgb.jpg", "width": 1000, "cloudinary_id": "tncxgraz7bjkbh8z9jgb", "height": 1363}, "id": 43402, "name": "Asterix & Obelix XXL2: Mission: Las Vegum"}, {"summary": "You are Momo Samejima, a special forces agent. Your mission is to assassinate the leader of an organization that's secretly selling a potent new drug, Perorin. You'll make use of guns and grenades as you sneak into a city and face off against enemies in 3D. She tackles thugs with swift kicks in her short, short skirt. She blasts away at goons in her stocking-accessorized, ultra-short china-look dress.", "id": 43325, "name": "The Mini Bijo Keikan"}, {"genres": [12], "summary": "Phantasy Star Generation: 1 is a remake of the game Phantasy Star, originally released for the Sega Master System in 1988, for the Sony PlayStation 2. It was developed by 3D AGES, a joint venture between Sega and D3 Publisher, as the first title of the Sega Ages 2500 series of games.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/k0g6fdrmzaqzz4oaug9s.jpg", "width": 1920, "cloudinary_id": "k0g6fdrmzaqzz4oaug9s", "height": 1080}], "id": 43454, "name": "Sega Ages 2500 Series Vol. 1: Phantasy Star Generation:1"}, {"genres": [14], "summary": "The snow is falling, the boards are waxed and the slopes are ready - can you become the number one Snow Rider! Take part in 3 exciting game modes, spread across 3 downhill slopes. Can you win the Championship in each mode? And earn yourself the coveted title of Resort Champion?", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zfdcbymj9fbevkojmd9w.jpg", "width": 1432, "cloudinary_id": "zfdcbymj9fbevkojmd9w", "height": 1050}], "id": 43336, "name": "Snow Rider"}, {"genres": [14], "summary": "Succeeding in the surprisingly competitive PlayStation 2 billiards genre isn't easy, but Q-Ball competes with a wide selection of game options. Seven modes of play are available: straight pool, free play, eight ball, US nine ball, international nine ball, rotation, frozen, plus carrot, random six, and bowlliards. Q-Ball also makes full use of the analog buttons and sticks for you to determine the power and angle of your shots. \nWith beautiful graphics and precision ball movement, billiards has never been this real! Qball: Billiards Master is a pool player's dream, using the power of the PlayStation 2 to create an unforgettably challenging game. \nPlay in style with QBall!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/mwoosbcwhjthjlq2h2ua.jpg", "width": 1280, "cloudinary_id": "mwoosbcwhjthjlq2h2ua", "height": 800}], "id": 43257, "name": "Pool Master"}, {"genres": [10, 14], "summary": "In Lucinda Green's Equestrian Challenge, you'll create the perfect horse to be your partner in play, practice and competition. You'll form strong bonds with your horse as you feed, groom and train to perfect your show skills. The more you train with your horse, the better it will perform as you win your way to prestigious international competitions of Show Jumping, Dressage and Cross Country.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/w8scqoucvf6o0ex78cxs.jpg", "width": 1194, "cloudinary_id": "w8scqoucvf6o0ex78cxs", "height": 817}], "id": 43254, "name": "Lucinda Green's Equestrian Challenge"}, {"genres": [10, 14], "summary": "Cart Fury is a 2000 open wheel-themed racing video game developed by Midway Games based on Championship Auto Racing Teams (CART). Originally released to arcades, a version was also released for the PlayStation 2. \n \nSome of its famous drivers like Juan Pablo Montoya, Michael Andretti and Christian Fittipaldi (Brazil) are included in the game. The game features the voice of Danny Sullivan. Licensed music by Disturbed and Outkast are used as the official soundtrack of this game.", "id": 43275, "name": "CART Fury"}, {"genres": [10], "name": "Rumble Racing", "videos": [{"video_id": "VxNdIRXFnGU", "name": "Gameplay video"}, {"video_id": "ccu5TjrM7ZY", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yyu0uimpkjkegsadgxbh.jpg", "width": 496, "cloudinary_id": "yyu0uimpkjkegsadgxbh", "height": 700}, "summary": "Rumble Racing is muscle car mayhem for the next millennium. Race outside the lines and push custom cars to the limit with big air stunts and nasty tricks as you race for the Rumble Championship. Unlock new worlds and new tracks with each Gold Cup victory, racing alone or partnering up with a friend.", "id": 43280}, {"genres": [10], "summary": "No grandstands, no checkered flag--Tokyo Extreme Racer Zero is just pure head-to-head competition. Race through the streets of Tokyo at up to 200 miles an hour and challenge other racers to winner-take-all competitions. As you gain victories, you can customize your car with over 125 parts, new paint jobs, and stickers. You'll need a finely tuned machine, plus quick reflexes, and nerves of steel if you want to become Emperor of the Highway.", "id": 43289, "name": "Tokyo Xtreme Racer zero"}, {"summary": "Dante, the world's most stylish demon slayer is back to shake the legions of the underworld to their knees in Devil May Cry 2. This time, Dante has a new devilish partner: Lucia, a mysterious and acrobatic heroine. Don't let Dante's handsome face lull you, as he has some moves of his own, including running and jumping on walls, aerial kicking, and the ability to simultaneously shoot in two directions. Unleash your inner demon as you battle hoards of monsters in massive, hellish environments.", "id": 43409, "name": "Devil May Cry 2 - Limited Edition"}, {"summary": "Maken is a man-made life form created to delve into the human soul and cure mental disease. Take control of this creature in an adventure that takes you across the globe in a battle against a terrorist organization led by a Chinese god. \n \nA 3D action adventure - Maken Shao lets you possess the bodies of key game characters, unlocking their memories and special attacks as you struggle to uncover who is behind a sinister conspiracy to change the fate of humankind forever.", "id": 43421, "name": "Maken Shao: Demon Sword"}, {"genres": [5], "summary": "This non-violent target shooter allows gamers to enter the shooting range, steady their nerves, and take aim at the bull's-eye. The game puts over one hundred faithfully recreated firearms in the hands of the player who can try his or her skill in a wide range of immersive 3D practice environments, from indoor ranges with paper targets, to hillsides with watermelons or flying sporting clays. A certification mode challenges would-be sharpshooters' skills, and the game also boasts detailed descriptions and information for every firearm.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/qgkn5fbzki4qjo8pyxa7.jpg", "width": 480, "cloudinary_id": "qgkn5fbzki4qjo8pyxa7", "height": 336}], "id": 20575, "name": "NRA Gun Club"}, {"summary": "Deep Water is an Action game, developed by Tamsoft and published by D3Publisher, which was released in Japan in 2004.", "id": 43238, "name": "Deep Water"}, {"genres": [8], "summary": "Yanya Caballista: City Skater, known in Japan as Yanya Caballista featuring Gawoo, is an extreme sports skating game for the PlayStation 2. The game is similar to Jet Set Radio in feel and look, but is more of an arcade style game.", "id": 43379, "name": "Yanya Caballista City Skater"}, {"summary": "Realm of the Dead is a zombie-killing action game.", "id": 43210, "name": "Realm of the Dead"}, {"genres": [31], "summary": "Your chance to take part in a thrilling adventure as the most famous dog in the world! Lassie returns in this fun action game following on from the acclaimed movie. The story opens with the discovery that the villainous Eddie Hynes has returned to steal Lassie's litter of six pups. Through each level of the game you'll need to show bravery and determination to track down the missing pups and bring Hynes to justice!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zvf9jrjptb6iptcfnnwi.jpg", "width": 800, "cloudinary_id": "zvf9jrjptb6iptcfnnwi", "height": 600}], "id": 43331, "name": "Lassie"}, {"summary": "Tales of Fandom Vol. 2 is a Miscellaneous game, developed and published by Bandai Namco Games, which was released in Japan in 2007.", "id": 43459, "name": "Tales of Fandom Vol. 2 (Tear Version)"}, {"summary": "Armored Core: Nine Breaker brings back the super strong \"Nine Ball\" mech who appeared in the original PlayStation Armored Core. Those who can defeat \"Nine Ball\" (which likely means you if you see the end credits of Nine Breaker) are labeled as the true most powerful mech around, the \"Nine Breaker.\" In Armored Core: Nine Breaker, players play through two main modes of play: training mode and arena mode. Training mode features 150 programs that test players' skills. Players can try out programs that focus on attack, defense, movement, \"technic,\" \"special\" and \"overall.\" Each of these areas are further divided, with attack comprised of multiple tests in accuracy, power, judgment, \"hit - single\" and \"hit - melee.\" Arena mode is a battle mode in which players take on other mechs in battle. Mech modification, the series' bread and butter, is of course featured heavily in Nine Breaker.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wogfsylpjwfhg5u26lha.jpg", "width": 640, "cloudinary_id": "wogfsylpjwfhg5u26lha", "height": 912}, "id": 23146, "name": "Armored Core: Nine Breaker"}, {"genres": [14], "summary": "All new transfer system, all new look, same brilliant gameplay! \n \nLMA Manager 2006 represents a massive leap forward in the series - now with an even more realistic transfer market - and as challenging and playable as ever! \n \nRealistic Transfer System \nGiving you more complex negotiations and more control than ever before. \n \nStunning 3D Match \nSee your manager take charge from the touch-line! \n \nBrand New Look \nIncredible new visuals and more realistic look. \n \nShare Content & Update Your Stats Online \n \nCommentary from Alan Hansen & Gary Lineker.", "id": 22548, "name": "LMA Manager 2006"}, {"genres": [4], "summary": "The game features a total of 24 characters from the series, both Eva units and Angels, from Neon Genesis Evangelion battling each other in an all-out royale. The game is a side-scrolling 2D fighting game with fully 3D rendered characters, backgrounds, and environments, similar in spirit to the Super Smash Bros. games.", "id": 43404, "name": "Shinseiki Evangelion: Battle Orchestra"}, {"summary": "The Bebop crew go in search of criminal outlaws to capture for bounties when they get caught up in the story of a mysterious organization, space pirate treasure, and a song called \"Diamonds\".", "id": 43406, "name": "Cowboy Bebop: Tsuioku no Serenade"}, {"genres": [15], "summary": "Sakura Wars is a Strategy RPG that features a unique sim-based story system. An in-depth storyline exists, much like in any other RPG; however, the player's destiny in the game is not predetermined. Character interaction plays a major role, and your responses to the various characters in the game can ultimately change the story content and even the final outcome. The battle system is divided into two main parts; ground combat and air combat. Ground combat takes place using two-legged mechanized suits, which transform into jet fighters to take the fight to the sky. Every mech unit in the game can transform from battle mech mode to jet fighter mode during combat. Once transformed, weapons and movement methods will change as well. For example, the hero's ground mode utilizes a sword as his main weapon, but in jet mode he will use long-range missiles.", "id": 43416, "name": "Sakura Taisen V: Saraba Itoshiki Hito Yo"}, {"summary": "Kamen Rider 555 is a game which released on December 18, 2003 in Japan by Bandai. It was an action game which featured many of the characters from the TV series. There were several modes of gameplay for either a single play and two players.", "id": 43424, "name": "Kamen Rider 555"}, {"summary": "Radirgy Precious is an Action game, developed and published by MileStone Inc., which was released in Japan in 2006.", "id": 43417, "name": "Radirgy Precious"}, {"genres": [14], "summary": "Fisherman's Bass Club takes anglers of all ages and abilities into the world of Trophy Bass Fishing. Learn the secrets to hooking bigmouth bass in remote lakes around the world. Discover and use the best strategies for selecting locations that yield the highest quantity and quality of sports fish. \n \nIn this 3D fishing simulation, fight some of the toughest freshwater sports fish around. Select favorite fishing holes and hone skills as a fisherman in multiple bids to win each tournament. Choose the right lures for a personalized style of fishing and come back with load after load of prize-winning bass.", "id": 43427, "name": "Fisherman's Bass Club"}, {"genres": [5], "summary": "The game is set in an era of space colonization where the Helghast Empire has recovered from its defeat in the First Helghan War and launched a blitzkrieg against the outer Interplanetary Strategic Alliance (I.S.A.) colony planet Vekta. Vekta's orbital Strategic Defense (S.D.) platforms failed during the initial assault, allowing the Helghast to land swarms of soldiers onto the surface and making it all the more difficult for the outnumbered I.S.A. forces. \n \nThis is the very rare steelbook of Killzone Collector's Editon. It's one of few games that exist for the PS2 that come with a steelbook.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/orpz3gaworpb8w35xgsx.jpg", "width": 1280, "cloudinary_id": "orpz3gaworpb8w35xgsx", "height": 720}], "id": 43422, "name": "Killzone Collector's Edition"}, {"genres": [8], "name": "Hugo - Magic in the Trollwoods", "videos": [{"video_id": "G9YYZTgxgOM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z40buf6svc8wzirpk7eo.jpg", "width": 1514, "cloudinary_id": "z40buf6svc8wzirpk7eo", "height": 2152}, "summary": "Join Hugo's adventure in the Trollwoods and help him fight evil lurking in the woods.", "id": 48023}, {"genres": [14], "summary": "Should you mount it, release it or just stay onshore?", "id": 43219, "name": "Cabela's Monster Bass"}, {"genres": [14], "summary": "In Konami's ESPN Winter X Games Snowboarding players can relive the popular alternative sport with detailed ESPN integration and identical courses from the 2001 season. Authentic broadcast angles, in-depth rider statistics, and 15 of the world's best pro riders are just a few of the features at their disposal while other extras include real snowboarding gear, four true-to-life X Games events (including Super Pipe and Big Air), three different gameplay modes with support for up to five players, and a killer soundtrack that features Long Beach Dub Allstars, Primer 55, Goldfinger, and more.", "id": 43373, "name": "ESPN Winter X Games Snowboarding"}, {"genres": [14], "summary": "A fitness game that utilizes the EyeToy camera (including a wide-angle lens attachment) to allow players to work out in interactive games, work on posture and balance, and tone their body with conditioning exercises. Features include Aero Motion and Combat, Mind and Body Zone, and The Toning Zone. The game features design input from Nike.", "id": 22550, "name": "EyeToy: Kinetic"}, {"genres": [10], "summary": "This entry in the Ford Racing series sees the racing move onto the streets of Los Angeles, with a unique team racing experience included that puts the player in control of their own Ford Racing three-car team, allowing them to race and also issue commands to team mates to gain tactical and positional advantage. The game showcases 18 fully licensed Ford super cars, from the 1970 Mk1 Capri RS1600, through the Ford GT to the 2007 Shelby GT 500.", "id": 43384, "name": "Ford Bold Moves Street Racing"}, {"genres": [31], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/o8ftie5gcc9bg2sofzeq.jpg", "width": 352, "cloudinary_id": "o8ftie5gcc9bg2sofzeq", "height": 500}, "id": 51457, "name": "Gintama: Together with Gin! My Kabuki District Journal"}, {"genres": [12], "summary": "Seekers of Adoulin is the fifth installment of the popular online role-playing series of Final Fantasy XI. With the newest expansion, players can now extend their journey with never before seen monsters, characters, jobs, and uncharted territory ready to be conquered.\n\nUlbuka — a land of unexplored wilderness — welcomes any who dare discover its hidden secrets. Unexplored lands, undiscovered treasures, and untold dangers await those brave enough to set foot into the wilds, whether with the swords and sorcery of old, the bells of the primal Geomancers, or the arcane arts of the stalwart Rune Fencers.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f5ktppdqxfafxevawzfw.jpg", "width": 225, "cloudinary_id": "f5ktppdqxfafxevawzfw", "height": 317}, "id": 10319, "name": "Final Fantasy XI: Seekers of Adoulin"}, {"genres": [9, 11], "summary": "A fast and furious puzzle game taken to all new heights, FantaVision combines action, shooting, strategy, and puzzle solving in one unique package. Players can combine a wild assortment of flares and other special effects to create explosive chain reactions and then replay the aerial spectacular and vary the camera angle and weather conditions in any way they choose. Environments include cityscapes, amusement parks, and the outer reaches of deep space", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/osbmzt8zo63nvn9pu8e4.jpg", "width": 800, "cloudinary_id": "osbmzt8zo63nvn9pu8e4", "height": 1134}, "id": 10392, "name": "FantaVision"}, {"genres": [5], "name": "Battlefield 2: Modern Combat", "videos": [{"video_id": "mHsCGINFIgA", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/y0inmenwhjrknz6inxv7.jpg", "width": 640, "cloudinary_id": "y0inmenwhjrknz6inxv7", "height": 777}, "summary": "Battlefield 2: Modern Combat is the fourth installment in the Battlefield Series and was developed by DICE and published by EA. It is a console spin-off of the critically acclaimed Battlefield 2 for the PC.", "storyline": "The single player campaign game revolves around a fictional war between NATO and China that takes place in Kazakhstan. The media on both sides air propaganda that accuses the other of war crimes while the player fights for each nation back and forth. When the player eventually chooses a side to lead to victory, it is revealed that a terrorist organization called Burning Flag is responsible for misleading both NATO and China into starting the war. Various war crimes each side believes the other committed during the fighting were in fact arranged by Burning Flag, which also sabotaged the only known attempt at negotiations. The winning side must then stop Burning Flag's leader, Commander 31, from launching 3 nuclear ICBMs at the United States, Europe, and China; failure would mean neither side would have anything left to fight for or live for. During the course of an intense battle, the ICBM launches are halted and Commander 31 killed, with the player being hailed as the hero who made China's- or NATO's- victory possible.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kb5kwwk2uaclrnofste1.jpg", "width": 1917, "cloudinary_id": "kb5kwwk2uaclrnofste1", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/v1uvdcg2dmkryb4p92mg.jpg", "width": 1917, "cloudinary_id": "v1uvdcg2dmkryb4p92mg", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s0ho2r9j8wwxdxpvpmsb.jpg", "width": 1917, "cloudinary_id": "s0ho2r9j8wwxdxpvpmsb", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/by0pxux6cd1rb4qkce7x.jpg", "width": 1917, "cloudinary_id": "by0pxux6cd1rb4qkce7x", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ikzg5czludqybep4hhbk.jpg", "width": 1917, "cloudinary_id": "ikzg5czludqybep4hhbk", "height": 1079}], "id": 348}, {"genres": [10], "name": "MotorStorm: Arctic Edge", "videos": [{"video_id": "F-r3m57sSng", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zrj0wfpchw6crbhjyaru.jpg", "width": 764, "cloudinary_id": "zrj0wfpchw6crbhjyaru", "height": 930}, "summary": "Motorstorm: Arctic Edge is an arcade racer pitting you against 8 other racers, human or AI in a competition to win in The Festival. The backdrop for the game is Alaska where you have to race on icy tracks in mountainous regions. Beside the other racers you have to take into account avalanches, broken ice bridges and a lot of other dangers on the route to victory. \n \nThe game is very fast-paced and it sees you racing around in cars, snowmobiles and trucks. You can select different wheels, exhausts, spoilers and more for your vehicles.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/sdee6bwpbxmnfxjadghh.jpg", "width": 480, "cloudinary_id": "sdee6bwpbxmnfxjadghh", "height": 272}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iommwf04bpkyjzaxy9aq.jpg", "width": 1024, "cloudinary_id": "iommwf04bpkyjzaxy9aq", "height": 576}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qs7u4emqwxcy8wwbse1z.jpg", "width": 1024, "cloudinary_id": "qs7u4emqwxcy8wwbse1z", "height": 576}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jonj11yydrwmbuofrna3.jpg", "width": 480, "cloudinary_id": "jonj11yydrwmbuofrna3", "height": 272}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wqzxu5l25dp1pvocebkn.jpg", "width": 480, "cloudinary_id": "wqzxu5l25dp1pvocebkn", "height": 272}], "id": 21104}, {"genres": [8, 31], "name": "Sonic Heroes", "videos": [{"video_id": "FmWwg-diUWs", "name": "Trailer"}, {"video_id": "ImOO7JUo1H0", "name": "Game intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zfnjb1s5kfk9fci8b4u1.jpg", "width": 290, "cloudinary_id": "zfnjb1s5kfk9fci8b4u1", "height": 414}, "summary": "Sonic & the gang, are back in the latest game, SONIC HEROES. Coming out on the Gamecube & for the first time on Playstation 2, Xbox And PC! Sonic Heroes has a twist to the gameplay, you choose a team of 3 characters. With different strengths. There are 4 teams: TEAM SONIC ~ Sonic, Tails & Knuckles TEAM DARK ~ Shadow, Rouge & E-123 Omega TEAM CHAOTIX ~ Espio, Vector, & Charmy Bee TEAM ROSE ~ Amy, Big, & Cream with her Chao sidekick Cheese. There are 4 modes, Story mode, Challenge mode, the Tutorial modes & the new & improved battle mode for multiplayer fun, and there are plenty of secrets to unlock.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/dm1ojfegzxvlbpwrnp3d.jpg", "width": 1593, "cloudinary_id": "dm1ojfegzxvlbpwrnp3d", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jjjiu2pya98dzhs2klef.jpg", "width": 1587, "cloudinary_id": "jjjiu2pya98dzhs2klef", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mvqbxuqkxwxq6vpskayh.jpg", "width": 1593, "cloudinary_id": "mvqbxuqkxwxq6vpskayh", "height": 897}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pguxy5xgovtrvrp5n3jn.jpg", "width": 1599, "cloudinary_id": "pguxy5xgovtrvrp5n3jn", "height": 897}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mbxbkcy3bdcxxamchur9.jpg", "width": 1591, "cloudinary_id": "mbxbkcy3bdcxxamchur9", "height": 891}], "id": 4156}, {"genres": [14], "summary": "Gamers of all ages will enjoy the varied puzzle games, board games and other multiplayer party-style competitions in My Street for PlayStation 2. My Street takes place in a sunny, residential neighborhood with chirping birds, barking dogs, picket fences, sidewalks and front porches. Customize your character and then head for the backyard, the basement, the local park, or other neighborhood spots to play 8 different games with up to 3 other characters, including Marbles, Chemistry Set, Volleyball, Pigs and Chickens, Dodge Ball, Corn Field Maze, RC Racing and Lawn Mowers.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mm93g45r7ibqhdxguifo.jpg", "width": 640, "cloudinary_id": "mm93g45r7ibqhdxguifo", "height": 908}, "id": 19306, "name": "My Street"}, {"genres": [14], "summary": "The third game, and first on PlayStation 2, in the Everybody's Golf series.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ihrr3b4d9phaelq4av2z.jpg", "width": 640, "cloudinary_id": "ihrr3b4d9phaelq4av2z", "height": 908}, "id": 23459, "name": "Everybody's Golf 3"}, {"genres": [14], "summary": "The Forth game, and second on the PlayStation 2, in the Everybody's Golf series. \nIt is also the second game titled Everybody's Golf in Europe.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/duz19plg6zzahpnmuvsl.jpg", "width": 500, "cloudinary_id": "duz19plg6zzahpnmuvsl", "height": 706}, "id": 36584, "name": "Everybody's Golf 4"}, {"genres": [8, 9, 31], "name": "The Adventures of Cookie & Cream", "videos": [{"video_id": "OBUwwpaRxRQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fnvojuq1xyakzquifmeh.jpg", "width": 252, "cloudinary_id": "fnvojuq1xyakzquifmeh", "height": 357}, "summary": "Players will enjoy puzzling challenges like they've never seen before in this unique party game for the whole family. For the first time in an Action/Platformer, both characters must work cooperatively to help each other through every trap, over each obstacle, and past some very hungry critters that would love to have them for dinner!", "id": 10758}, {"genres": [12], "name": "Suikoden III", "videos": [{"video_id": "VijYRD_KsQE", "name": "Trailer"}, {"video_id": "fA_gDnwcdZ8", "name": "Game intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r2eces74htmfyaotbmhq.jpg", "width": 480, "cloudinary_id": "r2eces74htmfyaotbmhq", "height": 681}, "summary": "Fifteen years after the events of Suikoden II, the stories of Hugo (the son of a village chief), Chris (the virtuous Knight of Zexen), and Geddoe (the rebellious unit commander) intertwine as they gather the 108 Stars of Destiny. Suikoden III features three different battle systems and three styles of combat in a 3D world. Customize each of your three character's skills, and then pair them together to unleash devastating combo attacks.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yshc4hmbs8jcj4lelmch.jpg", "width": 640, "cloudinary_id": "yshc4hmbs8jcj4lelmch", "height": 440}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ius6ei92ehwf8z2xepem.jpg", "width": 640, "cloudinary_id": "ius6ei92ehwf8z2xepem", "height": 467}], "id": 1448}, {"genres": [24], "name": "Tom Clancy's Splinter Cell", "videos": [{"video_id": "VlVxOhiKe-s", "name": "Splinter Cell Intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sirlrkxjkqerudsevbk1.jpg", "width": 640, "cloudinary_id": "sirlrkxjkqerudsevbk1", "height": 817}, "summary": "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! \n \nYou are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyber terrorism and international tensions are about to explode into WWIII.", "storyline": "In April 2004, the President of Georgia is assassinated, allowing Georgian billionaire Kombayn Nikoladze to seize power with a bloodless coup d'état. In August 2004, former U.S. Navy SEAL officer and Gulf War veteran Sam Fisher is recruited by the National Security Agency to work within its newly formed division, \"Third Echelon.\" Working with his old friend Irving Lambert, Fisher is introduced to technical expert Anna \"Grim\" Grimsdóttír, and field runner Vernon Wilkes Jr. \n \nIn October 2004, Fisher is dispatched to Tbilisi, Georgia to investigate the disappearance of two CIA officers. Fisher attempts to meet an informant, Thomas Gurgenidze, only to find him dying in a burning building. Gurgenidze warns that one agent's transmission mentioned proof that could cause a war. Finding the agents' corpses in a police morgue, Fisher learns that a former Spetsnaz agent, Vyacheslav Grinko, removed their subdermal tracking implants. Tracking Grinko's license plate number using CCTV, Third Echelon tracks him to the Georgian Ministry of Defense. \n \nFisher arrives at the Ministry, and records a meeting between Grinko and Canadian hacker Phillip Masse, through which he learns that Nikoladze is conducting an illegal operation in Azerbaijan. Fisher hacks Nikoladze's computer, and learns Nikoladze has been waging an ethnic cleansing campaign across Azerbaijan, by deploying Georgian commandos. In retaliation, NATO forces enter Azerbaijan, prompting Nikoladze to go underground. \n \nThird Echelon learns that Georgian soldiers stationed on a Caspian oil rig have been exchanging data with the Georgian Presidential Palace. Fisher infiltrates the rig during the middle of a NATO airstrike to apprehend a local technician, Lejava, and retrieve his laptop containing the rig's computer data. After interrogating the technician, Fisher learns that the data contains a file on \"The Ark\", Fisher recovers his laptop and encryption key and extracts. \n \nExamining Lejava's laptop, Grim reveals that the intel could have come from a CIA mole. Lambert then reveals that North America has just been hit by a massive cyber warfare attack, directed primarily against military targets. In a broadcast, Nikoladze claims responsibility for the attack and officially declares war on the United States and its allies. Fisher infiltrates the CIA headquarters and accesses the CIA computer mainframe, allowing Grim to trace the data leak to the computer of Mitchell Dougherty. Captured for interrogation, Dougherty claims ignorance of the leak, but the NSA learns that his obsessive–compulsive disorder caused him to back up data on an insecure laptop, which was exploited by a network owned by Kalinatek, Inc. \n \nGeorgia-hired mafiosos attempt to remove all traces of Nikoladze from the Kalinatek offices by destroying the building and murdering the staff. Intercepting a 911 call from a technician named Ivan, Fisher is deployed to the building and retrieves Ivan's encryption key while the FBI rescues Ivan. Fisher extracts with the help of Wilkes, who is mortally wounded in the process and later dies. Using the encryption key, the NSA discovers Nikoladze has been using a network of unconventional relays to communicate with Georgian military cells. The NSA traces the full relay network to the Chinese Embassy in Yangon, Myanmar. Worried Chinese support could cause World War III, Fisher sneaks into the embassy and eavesdrops on a conversation between Nikoladze and General Kong Feirong, and learns they are working together. \n \nFisher learns that captured U.S. Army soldiers and high-ranking Chinese officials are in a local slaughterhouse, so he delays interrogating Feirong to save the hostages, who are scheduled to be executed on a live broadcast. Fisher meets with a Chinese official among the hostages, and learns that Feirong is part of a rogue collective not backed by the Chinese government. Fisher is detected, and in a firefight, Fisher kills Grinko. Returning to the embassy, Fisher grabs a drunken Feirong before he can commit suicide, and forces him to share the information stored on his computer; the information reveals Nikoladze has fled back to Georgia, where he is trying to activate a suitcase nuke known as \"The Ark\". \n \nInfiltrating the Georgian Presidential Palace containing Nikoladze and new de facto Georgian president Varlam Cristavi, Fisher attempts to recover the key to the Ark, which has been placed somewhere in the United States. Fisher corners Nikoladze, who bargains to give the Ark key in exchange for safe passage out of Georgia; before Fisher can recover it, Cristavi soldiers take Nikoladze and the Ark key elsewhere. About to be executed, Fisher escapes when Lambert causes a brief blackout. Discovering Nikoladze is offering the Ark's location for protection, Fisher assassinates Nikoladze. Discovering the Ark, the U.S. Army evacuates an apartment complex in Hope Gate, Maryland on claims of a gas leak, and secretly recovers the Ark. \n \nDespite World War III being averted, Nikoladze's corpse sparks international backlash due to the suspicious circumstances around his death. Watching the Presidential broadcast on the crisis, Fisher then receives a secure phone call from Lambert for another assignment. \n \n[from Wikipedia.org]", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zylmk1vqs5naozsmj2tq.jpg", "width": 800, "cloudinary_id": "zylmk1vqs5naozsmj2tq", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jlrcmjkzzfe4qzmizvc7.jpg", "width": 800, "cloudinary_id": "jlrcmjkzzfe4qzmizvc7", "height": 600}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xlbfh15qbodwa4rhopua.jpg", "width": 1024, "cloudinary_id": "xlbfh15qbodwa4rhopua", "height": 768}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/osk9fgnqbkmvpy3uzdki.jpg", "width": 1024, "cloudinary_id": "osk9fgnqbkmvpy3uzdki", "height": 819}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lyloewxlqoe8vlvk3qvl.jpg", "width": 800, "cloudinary_id": "lyloewxlqoe8vlvk3qvl", "height": 600}], "id": 910}, {"summary": "There are a total of 12 different full games to play in the main mode of Sega Superstars: \n \n Sonic the Hedgehog – As Sonic runs down a round tunnel, he follows the position of the player's hand. Using this method, the aim of the game is to gather rings and Chaos Emeralds in order to obtain the highest score at the end of the game. It is much like the Special Stage on Sonic the Hedgehog 2, Sonic Heroes, and especially Sonic Rush. \n Samba de Amigo – Players choose a song, and then must hit 6 different targets around the screen as the 'beat balls' reach them in time with the music. Posing with hands over 2 of the targets, or holding one position until a trail of beat balls is complete, may also be required from the player. \n ChuChu Rocket! – Movement over a certain target on the screen will cause a bridge to raise, which the chu-chus then follow to the goal. The bridge also must be dropped at certain moments to prevent KapuKapus from destroying the score. \n Puyo Pop Fever – Differently colored puyos will fall from the top of the screen, and the player's body must be positioned to guide them into the corresponding pots and allow bombs to topple off the bottom of the screen. \n Crazy Taxi – Large movements and loud sounds must be undertaken to stop the Crazy Taxi and complete the level. \n Super Monkey Ball – The player must move their arms into different positions in order to guide the monkey ball around obstacles and towards the goal, picking up as many bananas as possible along the way. \n NiGHTS Into Dreams – NiGHTS must be controlled and navigated through rings, collecting chips along the way, by raising your arms into a 'flying' position and adjusting them along the way. \n House of the Dead – A multitude of different zombies must be attacked and defeated by hitting them. Innocent people who occasionally appear must also be avoided. \n Virtua Striker – As footballs drop from the top of the screen, the aim is to head them into differently colored and scored balloons on the opposite side of the screen in order to obtain the highest score. \n Virtua Fighter – Standing to one side, players kick and punch the corresponding attack prompts on the screen in order to defeat the opponent. Block and counter prompts also appear, and must be reacted to accordingly. \n Space Channel 5 – Different dance move combination must be remembered when shown by the Morolians, and then repeated in time to the music by hitting six different buttons on the screen. \n Billy Hatcher and the Giant Egg – By waving their hands over two different targets, players must move Billy and the egg around, and crush enemies and collect fruits along the way to the goal.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rzhsaqfnifla5uwyelvo.jpg", "width": 1540, "cloudinary_id": "rzhsaqfnifla5uwyelvo", "height": 2161}, "id": 43677, "name": "Sega Superstars"}, {"genres": [8, 25, 31], "name": "Sonic Unleashed", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dvv62jgk1d64xilnt3rw.jpg", "width": 240, "cloudinary_id": "dvv62jgk1d64xilnt3rw", "height": 300}, "summary": "Gameplay in Sonic Unleashed focuses on two modes of platforming play: fast-paced levels that take place during daytime, showcasing Sonic's trademark speed as seen in previous games in the series, and slower, night-time levels, during which Sonic's Werehog form emerges, and gameplay switches to an action-based, brawler style of play, in which Sonic battles Gaia enemies", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/uueqhjieekguhjxw6mnb.jpg", "width": 480, "cloudinary_id": "uueqhjieekguhjxw6mnb", "height": 270}], "id": 5169}, {"genres": [14], "summary": "Sega Superstars Tennis is a tennis video game developed by Sumo Digital, crossing over numerous Sega franchises, including Sonic the Hedgehog, Alex Kidd, Space Channel 5 and 12 more.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wzlvp6f6rxyq7e7wf3ky.jpg", "width": 1530, "cloudinary_id": "wzlvp6f6rxyq7e7wf3ky", "height": 2148}, "id": 47367, "name": "Sega Superstars Tennis"}, {"genres": [10], "name": "Sonic Riders: Zero Gravity", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nmbfv94rkqpbnpmns4ud.jpg", "width": 256, "cloudinary_id": "nmbfv94rkqpbnpmns4ud", "height": 314}, "summary": "The Story is split into two halves, the Heroes Story (Team Sonic), and Babylon Story (Babylon Rogues). Although the stories start separately, they overlap each other, telling the story as the main characters within that story see it. Following the format of Sonic Riders, Babylon Story also includes an epilogue that expands past the Heroes Story. \n \nSonic, Tails, and Knuckles are alerted to robots that are attacking a famous city of the future. They set out to retrieve a legendary artifact that has the ability to control gravity. Along the way they discover surprises, including the Babylon Rogues, a group of avian thieves who are also after the artifact. This sets off a war to decide who gets the artifact, leading them to settle their dispute by having an Extreme Gear competition.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/x26gftfa9dpy1uwvw11r.jpg", "width": 480, "cloudinary_id": "x26gftfa9dpy1uwvw11r", "height": 336}], "id": 5168}, {"genres": [10], "summary": "Sonic Riders is the fourth racing game in the Sonic the Hedgehog series, preceded by Sonic Drift, Sonic Drift 2 and Sonic R. \n \nThe game was released to start off the 15th anniversary of the release of the Sonic the Hedgehog series. For a short while, the Microsoft Xbox version of the game was released with a free Sonic X DVD. This game introduces five new playable characters, the Babylon Rogues and the E-10000 series. A sequel to Sonic Riders, entitled Sonic Riders: Zero Gravity, was released in 2008 for the Wii and PlayStation 2, followed by the Kinect-required game Sonic Free Riders for the Xbox 360 in 2010. This was the last Sonic the Hedgehog game for the GameCube and Microsoft Xbox.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lzilfr80swpvivtc1hm9.jpg", "width": 256, "cloudinary_id": "lzilfr80swpvivtc1hm9", "height": 324}, "id": 4158, "name": "Sonic Riders"}, {"genres": [5, 8, 31], "name": "Shadow the Hedgehog", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bgd3dudmo6wye7wbzqxs.jpg", "width": 250, "cloudinary_id": "bgd3dudmo6wye7wbzqxs", "height": 318}, "summary": "The world is in peril as forces, both good and evil, make a play for the powerful Chaos Emeralds. In Shadow the Hedgehog, you can control Shadow and choose which side to fight for. This 3D platformer lets you use weapons, vehicles, environmental objects, and time and space manipulation to combat your foes. \n \nAlthough it is a 3D platform game as with the more recent Sonic Adventure games, the game's levels each feature up to three different missions (Hero, Dark, Normal) that the player may choose to complete. The game's plot depends on which mission is completed as well as subsequent playable levels. The game stars Shadow the Hedgehog and his quest to recover his memory, a goal he has been pursuing since his debut in Sonic Adventure 2, while an evil alien race known as the Black Arms is invading the planet.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kxa4vqnhyymzz89kkxpl.jpg", "width": 305, "cloudinary_id": "kxa4vqnhyymzz89kkxpl", "height": 218}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rpqvciqpuoxoy37shvl0.jpg", "width": 480, "cloudinary_id": "rpqvciqpuoxoy37shvl0", "height": 360}], "id": 4105}]