[{"genres": [8], "summary": "Yikes!!! Get ready for a devious treasure hunt with the infamous scheming Wario. Capture the shining gold and vast treasures locked deep inside a hidden cave. But, beware of poison ponds, perilous prisons, endless walls and creepy woods! Make a quick change into Sea Dragon Wario, Eagle Wario or Bull Wario and utilize their mighty strengths. Blow away enemy cave defenders with body attacks and power actions. Succeed in this greedy plot to seize the riches of this underground world and find this key to freedom!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ohlrcmuu0dbb86xhffsq.jpg", "width": 1280, "cloudinary_id": "ohlrcmuu0dbb86xhffsq", "height": 1284}, "id": 1696, "name": "Virtual Boy Wario Land"}, {"genres": [9], "summary": "The mesmerizing force of Tetris returns with virtual style! This thrilling animated puzzler takes dexterity and split-second timing to the extreme with dimensional blocks and challenging planes. 3-D Tetris propels players at a demanding pace where quick response and strategy rule. Tetris devotees of all levels will crave this latest sensation of brain-teasing fun!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l1yjzhtwxhisjllngjxm.jpg", "width": 800, "cloudinary_id": "l1yjzhtwxhisjllngjxm", "height": 793}, "id": 20380, "name": "3-D Tetris"}, {"genres": [9, 30], "summary": "Prepare to enter the vast expanse of the Milky Way. Put your pinball skills to an interstellar test with four incredible space tables. \n \nBlast your pinball at rotating planets and turn them into dust in the Cosmic world. Send your puck flying through galactic formations in the deep-space Colony. Defeat an evil skeleton and hit the ultimate UFO jackpot! Knock down multiple rings and destroy wicked assailants in an Alien place. Defy arduous obstacles and save the world from impending devastation!", "id": 20381, "name": "Galactic Pinball"}, {"genres": [14], "id": 20382, "name": "Golf"}, {"genres": [5], "summary": "Innsmouth no Yakata is an Action game, developed by Betop and published by I'Max, which was released in Japan in 1995.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/tzqpqhlruclmbxstqdqb.jpg", "width": 1024, "cloudinary_id": "tzqpqhlruclmbxstqdqb", "height": 768}], "id": 20383, "name": "Insmouse no Yakata"}, {"genres": [33], "summary": "The portal between Earth and another mysterious dimension has opened, and the intrepid Jack Brothers have come through for an adventure in our world. Having lost track of time, they now have only one hour to return to their home or be banished forever. Help them battle hoards of loathsome enemies through six electrifying 3-D levels, each with many floors to explore and conquer. This is one phenomenal adventure you can't afford to miss!", "id": 20384, "name": "Jack Bros."}, {"genres": [8, 33], "summary": "Mario finds himself pitted against a host of evil and nasty enemies. You must help him outwit the Spikes, Para-Goombahs, and other beasts and evils that lurk inside a tower that reaches to the clouds. After stunning a Koopa, he uses it as ammo against his enemies! The attack is relentless! \n \nBut watch out, there are also creatures made of fire and ice that must be avoided -- hazards at every turn. Even the narrow ledges on which Mario teeters and the pipes he races through must be traversed with caution! \n \nThe pace gets hotter at each level, and the action jumps right out at you! Hold on! This 3-D Virtual Boy game offers a white-knuckled adventure that will keep you on the edge of your seat!", "id": 20385, "name": "Mario Clash"}, {"genres": [14], "summary": "Smashing tennis action with incredible depth on a realistic 3-D court! Experience the ultimate Virtual Boy sports game in either singles or doubles mode.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r1mbvge6rruljsyzhehg.jpg", "width": 640, "cloudinary_id": "r1mbvge6rruljsyzhehg", "height": 640}, "id": 20386, "name": "Mario's Tennis"}, {"genres": [14], "summary": "Nester, the one-time bad boy of comic fame, brings you the funkiest game of bowling you'll ever experience in 3-D. Finally fans can throw a strike without putting on ill-fitting shoes! \n \nHester, the unknown twin sister, makes her debut appearance. Watch out as the action picks up and the tensions build for these hot-headed bowlers. Their egos clash with outlandish gestures and funky expressions.", "id": 20387, "name": "Nester's Funky Bowling"}, {"genres": [9], "id": 20388, "name": "Panic Bomber"}, {"genres": [5, 13], "summary": "Bursting through incredible dimensions of Virtual space the final mission is clear. Obliterate all enemies and obstacles created by KAOS and terminate this menacing battle system from within. \n \nEmploying an impressive arsenal of high-tech weapons and evasive maneuvers the Tech-Wing Fighter speeds on. Spinning deaths, spy pods and mosquito mechs appear from everywhere! The fate of humanity will soon be defined. Red Alarm! Red Alarm! Alarm Condition Red!!", "id": 20790, "name": "Red Alarm"}, {"genres": [15], "summary": "SD Gundam Dimension War is a Strategy game, developed by Locomotive Corporation and published by Bandai, which was released in Japan in 1995.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/phux2pmmcx8iocfw9lvu.jpg", "width": 640, "cloudinary_id": "phux2pmmcx8iocfw9lvu", "height": 631}, "id": 20791, "name": "SD Gundam: Dimension War"}, {"genres": [5, 33], "summary": "Attention all Earthlings! Relentless alien hordes have been identified near you. Prevent the dangerous Space Invaders from landing on your territory. Use your cannon to defend against waves of descending alien invaders. Don't let them hit the ground or it's all over for you and the Earth! Destroy them and score points!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rbywxpzuie6zqzunyueh.jpg", "width": 640, "cloudinary_id": "rbywxpzuie6zqzunyueh", "height": 647}, "id": 20792, "name": "Space Invaders: Virtual Collection"}, {"genres": [14, 33], "name": "Space Squash", "videos": [{"video_id": "zYitFYMTKfg", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tqrrxujcv1bwfmips0di.jpg", "width": 930, "cloudinary_id": "tqrrxujcv1bwfmips0di", "height": 686}, "summary": "Space Squash is a Sports game, developed by Tomcat System and published by Coconuts Japan, which was released in Japan in 1995.", "id": 20793}, {"genres": [4, 14], "summary": "In a savage display of pounding moves and lightning action, robotic boxers from around the globe step into a futuristic ring. Mirroring the movements of the humans in control, each Teleroboxer is capable of surviving defense matches unbearable to mankind. \n \nSlug it out to the staggering end to determine the true world champion. Created with specialized Techtronic powers and unique personalities, these responsive machines show no mercy on their way to the brutal top.", "id": 20984, "name": "Teleroboxer"}, {"genres": [9], "summary": "V-Tetris is a Miscellaneous game, developed by Locomotive Corporation and published by Bullet Proof Software, which was released in Japan in 1995.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/enbpdtegeurwc5qdejgx.jpg", "width": 800, "cloudinary_id": "enbpdtegeurwc5qdejgx", "height": 804}, "id": 20985, "name": "V-Tetris"}, {"genres": [5, 33], "summary": "Pilot a Futuristic Star Fighter in a Battle for Mankind! \n \nGALACTIC YEAR 210. The earth and its colonies face annihilation in a futuristic war against the human race. YOU have been chosen to pilot RAGNAROK, a star fighter from an advanced alien civilization. \n \nReinforced by fearless AI CHARACTERS, you must locate and destroy menacing fighters and enemy droids. With sheer VERTICAL FORCE blast your way into another dimension to the final Virtual frontier. This mission for mankind is brutal. Be prepared, for it has only just begun!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nilxm0mttjbovic9befq.jpg", "width": 640, "cloudinary_id": "nilxm0mttjbovic9befq", "height": 637}, "id": 20986, "name": "Vertical Force"}, {"genres": [5, 33], "summary": "The sun. For millions of years the source of life. But for one planet the source of it's demise. The temperature climbed, the vast pools of ice at it's poles melted, and the oceans rose. Centuries later, few people remained on this planet, once called Earth. A lone mariner sails the expanse of water, trading to survive. For survival, is all these people do, in this place they know only as Waterworld.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/y5rbmn1cjzfsrvs3jfap.jpg", "width": 382, "cloudinary_id": "y5rbmn1cjzfsrvs3jfap", "height": 379}, "id": 20987, "name": "Waterworld"}, {"genres": [14], "summary": "Virtual Bowling is a Sports game, developed and published by Athena, which was released in Japan in 1995.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kmrlkli7fcamscbauv4g.jpg", "width": 490, "cloudinary_id": "kmrlkli7fcamscbauv4g", "height": 473}, "id": 20988, "name": "Virtual Bowling"}, {"genres": [9], "summary": "Virtual Lab is a Miscellaneous game, developed and published by J-Wing, which was released in Japan in 1995.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/a7owtsldifu9svlnrqsk.jpg", "width": 640, "cloudinary_id": "a7owtsldifu9svlnrqsk", "height": 645}, "id": 20989, "name": "Virtual Lab"}, {"genres": [14], "summary": "Virtual Fishing is a Sports game, developed by Locomotive Corporation and published by Pack-In-Video, which was released in Japan in 1995.", "id": 50597, "name": "Virtual Fishing"}, {"genres": [9], "summary": "Originally developed by Japan System Supply, Nintendo liked the game idea of Bound High! and took over the project later. The game was, besides Dragon Hopper, going to be one of the games, which should have saved the system with a relaunch, but it was delayed again and again until it was cancelled because of the lack of success of the Virtual Boy. At this time, the game already was completely finished. \n \nIn Bound High!, Chalvo, the bouncing robot, travels through space In full 3d-D motion in pursuit of alien invaders that threaten the peaceful inhabitants of Earth. Angling from above, players control rolled up Chalvo, who must destroy all enemies on the playfield by landing on them and throwing them down from the playfield. Falling off the playfield himself, Chalvo will loose a life. \nThe playfield is in space, or high above the earth, and is made of many little squares, which are composed differently from level to level, once big plain areas, once many small, scattered blocks. Bouncing over the platforms can be quite incalculable and dangerous, while some are solid, other ones vanish after one hit or reveal puzzles, items or other objects and besides a lot of different enemies, Chalvo also has to carefully avoid winds, the deep crevices, sharp spikes and highly charged electric \"shockers\" that cause his demise. Adding to the difficulty is the rebound angle when you hit a moving enemy - you don't necessarily bounce straight up in the air. \nSometimes blocks lead to an \"Another Stage\", some kind of mirrored parallel universe with inverted colors and without the dangerous winds.", "id": 50596, "name": "Bound High!"}]