[{"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/io6dbhf4att5f9ih0wyx.jpg", "width": 200, "cloudinary_id": "io6dbhf4att5f9ih0wyx", "height": 275}, "id": 165, "videos": [{"video_id": "NN3M0KPmURU", "name": "Trailer"}], "name": "Star Wars: Super Return of the Jedi"}, {"summary": "It's MEGA MAN versus the powerful leaders and fighting forces of Monsteropolis - that strange multi-layered land of robot-like humanoids created by the wrongly-performed experiments with human beings by Dr. Wily. Mega Man - the chosen defender of the human race. For he dares to single-handedly penetrate Monsteropolis' seven separate societies to stop the rapid expansion of strange misrepresentations of humans. \n \nMega Man's goal is monumental. He must infiltrate seven separate heavily-guarded empires. By himself, he must break down and destroy the following empire leaders: Cutman, Gutsman, Iceman, Bombman, Fireman, Elecman, and Dr. Wily. The action involves Mega Man armed only with laser beam weapons, encountering strangely-configured humanoids. They're atop, in and out of fortified prison-like structures strengthened with thick walls. Hidden amid gun turrets embedded in concrete uprights, even in subterranean passages below icefields. WOW!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bsbms78blxy66c8c5dzm.jpg", "width": 480, "cloudinary_id": "bsbms78blxy66c8c5dzm", "height": 664}, "id": 1738, "name": "Mega Man"}, {"genres": [10], "summary": "Strap yourself in for a life or death ride. In hot pursuit of enemy agents, blaze a trail across Europe in the world's most powerful vehicles. Only your skill and determination will get you all the way to your destination - Berlin!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fybhgznxqmxhhvf0zsfn.jpg", "width": 250, "cloudinary_id": "fybhgznxqmxhhvf0zsfn", "height": 319}, "id": 2055, "name": "Out Run Europa"}, {"genres": [9], "name": "Krusty's Fun House", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dmvpmjnngwzhgfhbbytn.jpg", "width": 200, "cloudinary_id": "dmvpmjnngwzhgfhbbytn", "height": 275}, "summary": "Krusty the Clown's Fun House has been overrun by rats. You must help him to herd the rats into trap machines to clear them out. In order to do so, Krusty must manipulate his environment to set up pathways so that the rats are headed in the right direction. Objects that Krusty move around include blocks, fans, and pipe pieces.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/aldghjzj6pi4uzdlpox7.jpg", "width": 320, "cloudinary_id": "aldghjzj6pi4uzdlpox7", "height": 256}], "id": 2740}, {"genres": [8], "name": "The Simpsons: Bart vs. The Space Mutants", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rjsi8cbmcdbhkqm7ohiu.jpg", "width": 220, "cloudinary_id": "rjsi8cbmcdbhkqm7ohiu", "height": 302}, "summary": "Bart vs. The Space Mutants is a platform game where the player goes into the role of Bart Simpson (from the TV show The Simpsons) and must stop the Space Mutants from invading Springfield. On each of the five levels, Bart must collect (or get rid of) the ingredients that the Space Mutants are planning to use to build their machine, such as purple objects or balloons. He also has to collect enough \"proof\" of the aliens existence (brown coins left behind when they are jumped on), so his family members will help him when he meets a boss (characters such as Nelson and Sideshow Bob). This won't be easy since the Space Mutants are \"using\" human bodies as disguise. In order to discover who are the real Space Mutants, Bart must use his X-ray Specs.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bz4r1io2mnlondyl57dv.jpg", "width": 320, "cloudinary_id": "bz4r1io2mnlondyl57dv", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/g0rdvcbvksupgdoywwcl.jpg", "width": 320, "cloudinary_id": "g0rdvcbvksupgdoywwcl", "height": 256}], "id": 2827}, {"genres": [8], "name": "The Simpsons: Bart vs. the World", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fkoabwhqga3cvvdbbwmv.jpg", "width": 209, "cloudinary_id": "fkoabwhqga3cvvdbbwmv", "height": 300}, "summary": "Yo! Here's the deal! I won the Krusty the Clown art contest so my family and I get to go on this really cool Worldwide Treasure Hunt to China, Egypt, the North Pole and Hollywood. And I need you to help to collect Krusty faces and Krusty products if I want to reach my final destination: a guest appearance on the Itchy & Scratchy Show! Any questions? Good. I'm outta here. Your friend, Bart Simpson.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hhueubwnftzwzlxflqsq.jpg", "width": 320, "cloudinary_id": "hhueubwnftzwzlxflqsq", "height": 256}], "id": 2830}, {"genres": [8], "summary": "LISTEN UP, CRIME FIGHTERS! \n \nThe greatest comic book hero of all time, Radioactive Man, has been kidnapped...and it's up to yours truly to save the R-Man. \n \nI'll put all my awesome super-powers to the best when I battle the slimy Swamp Hag, the evil Dr. Crab and the bad-tempered Lava Man. Once I wipe these villains out and restore Radioactive Man's powers, we'll take on the brains behind this ugly scheme, Brain-O The Magnificent. \n \nSo quit reading and buy this game OR ELSE. That's an order from Bartman, man!!! \n \n-THIS LOOKS LIKE A JOB...FOR BARTMAN! \n-WILL A BLAST OF COLD BREATH PUT THE FREEZE ON SWAMP HAG? \n-THE TERRORS OF THE DEEP ARE NO MATCH FOR THE MIGHTY BARTMAN! \n-DANGER LURKS EVERYWHERE IN THE JUNKYARD! \n-IT'S FIST AGAINST CLAW IN THE EVIL DR. CRAB'S LAIR!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iswp5egdnbg57ucbvue1.jpg", "width": 220, "cloudinary_id": "iswp5egdnbg57ucbvue1", "height": 302}, "id": 2832, "name": "The Simpsons: Bartman Meets Radioactive Man"}, {"genres": [8], "summary": "Itchy & Scratchy is a single player platform side-scroller. The player controls Itchy, the mouse, and must defeat Scratchy, the cat, with a variety of weapons. Itchy caries a default mallet, but can pick up additional weapons on particular levels. Each of the seven levels takes place in a different fictional location and is designed as a maze of doors and platforms. After defeating Scratchy, he usually will return with a special contraption to attack Itchy, and must therefore be defeated again.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uljj2zp9iefsendp22l7.jpg", "width": 252, "cloudinary_id": "uljj2zp9iefsendp22l7", "height": 357}, "id": 2834, "name": "The Itchy & Scratchy Game"}, {"genres": [4, 8, 25], "name": "Bishoujo Senshi Sailor Moon S", "videos": [{"video_id": "Mz1Bawc6Nss", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bgn7xfehtwlpb52xw6cc.jpg", "width": 640, "cloudinary_id": "bgn7xfehtwlpb52xw6cc", "height": 741}, "summary": "Game based upon the 1994 Sailor Moon S anime series.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zw8vqulepawpg2yinmpw.jpg", "width": 320, "cloudinary_id": "zw8vqulepawpg2yinmpw", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wjgjaimyj6huaeiv1zhu.jpg", "width": 320, "cloudinary_id": "wjgjaimyj6huaeiv1zhu", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lx7ttxg0l9xkjolssbmx.jpg", "width": 320, "cloudinary_id": "lx7ttxg0l9xkjolssbmx", "height": 240}], "id": 36697}, {"genres": [25], "name": "Battletoads", "videos": [{"video_id": "nwCU9SwybEg", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mssssrw0th8cfxiynayu.jpg", "width": 1534, "cloudinary_id": "mssssrw0th8cfxiynayu", "height": 2100}, "summary": "Battletoads is the first game of the Battletoads series. It is developed by Rare and published by Tradewest. It was originally released for Nintendo Entertainment System in 1991, with ports for the Sega Genesis, Sega Game Gear, Amiga CD32 and Nintendo Game Boy (with the subtitle Battletoads in Ragnarok's World so as to separate it from the earlier-released Game Boy sequel). \n \nBattletoads is considered to be a game that shows the true potential of the NES' graphics, mainly due to the year of its release, when developers were focusing more on 16-bit consoles. \n \nNot only is it graphically-advanced, but it is also considered to be one of the hardest games of all time, appearing in possibly every listing of difficult video games. It is currently listen at 8th place in IGN's \"Top 10 Most Difficult Games to Beat.\"\n\nIt was re released in 2015 on the Xbox One as part of the Rare Replay Collection.", "storyline": "Fresh from her recent defeat at the Battle of Canis Major, the Dark Queen decides to take out her aggressions on her archenemies, the Battletoads. The 'Toads and their mentor, Professor T-Bird, are currently escorting Princess Angelica home to her father, the Terran Emperor. During a rest stop, Pimple takes Angelica out for a drive in the Toadster, but the vehicle and its occupants are swallowed up by the Dark Queen's ship, the Gargantua, and taken to her tower on planet Ragnarok. \nRash and Zitz are quickly sent down to Ragnarok's surface to rescue their friends, unaware of the dangers that await them, but willing to chance it all on their rescue mission.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rmrbb2e2mhv1cnmuoykv.jpg", "width": 468, "cloudinary_id": "rmrbb2e2mhv1cnmuoykv", "height": 327}], "id": 2970}, {"genres": [30], "name": "Pinball Dreams", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/otf9jhirhvucvgeqjv9p.jpg", "width": 351, "cloudinary_id": "otf9jhirhvucvgeqjv9p", "height": 456}, "summary": "DICE’s first game was built by five friends from the Amiga demo group The Silents in their spare time. What started out as a demo idea soon became a full-fledged pinball simulation published by 21st Century Entertainment with the Amiga as the primary platform. Pinball Dreams captivated gamers and quickly became a cult hit.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jy3ogsz0klzozchfrgky.jpg", "width": 640, "cloudinary_id": "jy3ogsz0klzozchfrgky", "height": 1024}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r67bpj8owvc4zgotppbp.jpg", "width": 640, "cloudinary_id": "r67bpj8owvc4zgotppbp", "height": 1024}], "id": 3024}, {"genres": [8, 31, 33], "name": "The Lion King", "videos": [{"video_id": "nGbanhZRxgc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aeygysu5ksdwlydzi1yi.jpg", "width": 4283, "cloudinary_id": "aeygysu5ksdwlydzi1yi", "height": 5547}, "summary": "The Lion King brings to life the majesty and mystery of Africa thruogh the tale of Simba, a lion cub faced with the challenging transition to maturity. Believing himself to be responsible for his father's death, Simba enters the wilderness - where he finds salvation with Pumbaa the warthog and Timon the meerkat, and his education begins. \n \nTake control of the youg cub Simba and, through interaction as detailed as the lust terrain, guide him safely through.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hchxtr1ys2q0g1nvy6ze.jpg", "width": 1280, "cloudinary_id": "hchxtr1ys2q0g1nvy6ze", "height": 720}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ctpszxvzrtr4cgco0r9v.jpg", "width": 1280, "cloudinary_id": "ctpszxvzrtr4cgco0r9v", "height": 720}], "id": 3166}, {"genres": [4, 8], "name": "Prince of Persia", "videos": [{"video_id": "Xv20j8ChtRY", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lnbjgbihgekwzunqidk8.jpg", "width": 250, "cloudinary_id": "lnbjgbihgekwzunqidk8", "height": 320}, "summary": "The game is set in ancient Persia. While the sultan is fighting a war in a foreign land, his vizier Jaffar, a wizard, seizes power. Jaffar's only obstacle to the throne is the Sultan's daughter (although the game never specifically mentions how). Jaffar locks her in a tower and orders her, under threat of execution, to become his wife. The game's nameless protagonist, whom the Princess loves, is thrown into the palace dungeons. The player must lead the protagonist out of the dungeons and to the palace tower, defeating Jaffar and freeing the Princess in under 60 minutes. In addition to guards, various traps and dungeons, the protagonist is further hindered by his own doppelgänger, an apparition of his own self that is conjured out of a magic mirror.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zomj1uaygbo2zdhkkyjl.jpg", "width": 1919, "cloudinary_id": "zomj1uaygbo2zdhkkyjl", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xhjyq1rronkr1g5uituf.jpg", "width": 1919, "cloudinary_id": "xhjyq1rronkr1g5uituf", "height": 1079}], "id": 2472}, {"genres": [8], "name": "Sonic The Hedgehog", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dvfifwj5ifzqhagayami.jpg", "width": 640, "cloudinary_id": "dvfifwj5ifzqhagayami", "height": 894}, "summary": "Sonic the Hedgehog is a 2D, side-scrolling platformer, whose gameplay centers around Sonic's ability to run at high speed through levels incorporating springs, slopes, high falls, and loop-the-loops. The levels contain hazards in the form of robots (\"badniks\" in the Western game manuals) in which Dr. Robotnik has trapped animals. Although destroying a robot frees the animal within, this is not required to complete the game. The player must avoid rows of sharp spikes, falling into bottomless pits, being crushed by moving walls or platforms, and drowning (which can be avoided by breathing air bubbles periodically released from vents). Sonic's main attack is his spin, where he curls into a ball and rotates rapidly (damaging enemies and some obstacles). This can be performed by jumping in the air or rolling on the ground. \n \nScattered around each level map are gold rings and collecting 100 rings rewards the player with an extra life. Rings are a layer of protection against hazards; if Sonic has at least one ring when he collides with an enemy, he will survive. However, all his rings will be scattered; they will flicker and disappear in a few seconds if they are not picked up again. If Sonic is hit without any rings, he loses a life. Although shields and temporary invincibility may be collected to provide additional protection, certain hazards (such as drowning, being crushed, falling down a bottomless pit or running out of time) will cost Sonic a life regardless of rings or other protection. \n \nThe game is divided into six zones (Green Hill, Marble, Spring Yard, Labyrinth, Star Light, and Scrap Brain), each with its own visual style and enemies. A player must navigate through each zone (subdivided into three acts) to progress. \n \nAt the end of each zone's third act, the player confronts Dr. Robotnik (who pilots a different vehicle each time) in a boss fight. After the sixth zone, the player continues directly to the Final Zone for a last encounter with Robotnik. They begin with three lives (power-ups and rings add more), which are lost when Sonic collides with hazardous enemies (or objects) without rings, falls off-screen or exceeds an act's ten-minute time limit. Lampposts acting as checkpoints allow Sonic to return to the most-recently activated post when he loses a life. If he loses a life as a result of time running out but has another life, the timer will reset to 0:00 when he returns to the checkpoint. If all lives are lost at any point in the game, the game over screen will appear (when the player can return to the beginning of the act with three lives, if they have any continues). \n \nWhen Sonic reaches the end of act one or act two of a zone with at least fifty rings, a large ring appears through which he can jump to enter a Special Stage (a \"Secret Zone\" in the original Genesis manual). In each of six Special Stages, Sonic bounces off the bumpers and walls of a rotating maze in spin attack. Although the player earns a continue with each 50 rings found, their main goal is to obtain the Chaos Emerald at the end of the maze without colliding with a \"goal block\" (which ends the level).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nf1iu9lmtr4nzdz2a2mh.jpg", "width": 480, "cloudinary_id": "nf1iu9lmtr4nzdz2a2mh", "height": 270}], "id": 3192}, {"genres": [12, 16], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/blfodfn8ub9j4j2wyjag.jpg", "width": 436, "cloudinary_id": "blfodfn8ub9j4j2wyjag", "height": 636}, "id": 3200, "name": "Shining Force Gaiden: Final Conflict"}, {"genres": [4, 25], "summary": "The Power Rangers stripped of the Mighty Morphin Powers and forced to flee the earth? Rita Repsula and Lord Zedd over whelmed by an evil far greater than their combined nastiness? The Command Centre totally obliterated and Zordon on the brink of death? The fate of the world in the slimey hands of Ivan Ooze, the most sinister monster the universe has ever seen? Could this be a bad dream? Don't count on it. It all happens in the Morphinominal Mighty Morphin Power Rangers the Movie! And now, you can battle Ivan Ooze, the vilest villain in Nintendo history and a whole host of his mean and ugly minions in this hyper action, seven levels, no holds barred brawl featuring the eye popping graphics and ear pounding sounds of the Super NES. So, morph into action and lead the Power Rangers on to their greatest victory.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lw6kttpocwyy82oziscj.jpg", "width": 220, "cloudinary_id": "lw6kttpocwyy82oziscj", "height": 159}, "id": 3288, "name": "Mighty Morphin Power Rangers: The Movie"}, {"genres": [4, 8, 31], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yzd8r5tawcxeduenuocg.jpg", "width": 268, "cloudinary_id": "yzd8r5tawcxeduenuocg", "height": 188}, "id": 3324, "videos": [{"video_id": "tii1hXALF4o", "name": "Gameplay video"}], "name": "Mighty Morphin Power Rangers"}, {"genres": [5, 8, 31], "name": "Earthworm Jim", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sgpdlhpeaohxwr6ectsy.jpg", "width": 256, "cloudinary_id": "sgpdlhpeaohxwr6ectsy", "height": 358}, "summary": "A crow is chasing a worm named Jim while in outer space Psy-Crow is chasing a renegade ship. The ship's captain has stolen an ultra-high-tech-indestructible-super-space-cyber-suit and Queen Slug-for-a-Butt has ordered Psy-Crow to get it, since it can make her more beautiful than Princess-What's-Her-Name. Psy-Crow blasts the captain and the suit falls to Planet Earth. \n \nBack on earth Jim wonders if he is finally safe when an ultra-high-tech-indestructible-super-space-cyber-suit lands on him. Luckily Jim rests in the neck ring of the suit. Then the space particles begin interacting with Jim, causing a light-speed evolution. Jim soon realizes he is in control of the suit. \n \nJim overhears the Queen's plans for the suit and decides to meet this Princess...", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jsnh7thv2t0pp2tkqhpg.jpg", "width": 320, "cloudinary_id": "jsnh7thv2t0pp2tkqhpg", "height": 224}], "id": 3480}, {"genres": [5, 8], "name": "RoboCop Versus The Terminator", "videos": [{"video_id": "UJu0IeYb7AA", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bw98iwvrfc7crwbvkb7v.jpg", "width": 200, "cloudinary_id": "bw98iwvrfc7crwbvkb7v", "height": 287}, "summary": "In the crumbling ruins of a world under siege, man-machine meets machine-man as legendary cyborgs clash to decide the fate of the Earth. As Robocop, you must travel across time into a bloody future ruled by the mechanical forces of Skynet. You'll face attack from every angle, every moment. An unwavering army of Terminators, robotic dogs, spiders, Endoskeletons and a relentless arsenal of automated weapons await you in this veritable hell on earth. To destroy this enemy, free its hostages and finally pierce the dark heart of a killer computer. It will take something more powerful than plasma rifles and laser guns: the human mind that still burns within you.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/sntj1vonpscowfmcyfpo.jpg", "width": 600, "cloudinary_id": "sntj1vonpscowfmcyfpo", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vndmlzhwwx31no8qemvv.jpg", "width": 640, "cloudinary_id": "vndmlzhwwx31no8qemvv", "height": 480}], "id": 8195}, {"genres": [5, 13], "name": "Urban Strike", "videos": [{"video_id": "x972JIIWCFo", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nxfhkyp71gyjztyofebn.jpg", "width": 640, "cloudinary_id": "nxfhkyp71gyjztyofebn", "height": 891}, "summary": "Urban Strike is a helicopter based shoot 'em up, mixing action and strategy, retaining its predecessor's core mechanics, and expanding on the model with additional vehicles and settings. This time, the campaign takes the player all over the North American continent, beginning in Hawaii and moving through locations in Mexico, San Francisco, New York, and Las Vegas.", "id": 4492}, {"genres": [8, 31], "name": "Disney's Aladdin", "videos": [{"video_id": "bp1XvV8BBfQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/os2dwbnbh9v8gwkeipmd.jpg", "width": 800, "cloudinary_id": "os2dwbnbh9v8gwkeipmd", "height": 582}, "summary": "Disney's Aladdin is a 1993 video game developed by Capcom for the Super Nintendo Entertainment System (SNES). Based on the film of the same name, Disney's Aladdin is a 2D side-scrolling video game in which the player characters are Aladdin and his monkey Abu. The game was released in November 1993, the same month that another game with the same title was released by Virgin Games for Sega Genesis. The two games vary in several respects, including the fact that Aladdin carries a sword in the Virgin game but does not in the Capcom game, a fact that Shinji Mikami, the Capcom game's designer, said made the Virgin game better. The Capcom game was ported to Game Boy Advance (GBA) on March 19, 2004.", "storyline": "Disney's Aladdin was loosely based after the movie of the same title. The storyline is fairly consistent with the movie, and the player controls Aladdin through a series of adventures that are able to maintain somewhat of the look and feel of the movie, despite the limitations of the format.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/soykamthrnmjunp9kydm.jpg", "width": 640, "cloudinary_id": "soykamthrnmjunp9kydm", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eyehvsviud47qiujn2er.jpg", "width": 610, "cloudinary_id": "eyehvsviud47qiujn2er", "height": 407}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mxyh0nxjrfygftpe9vte.jpg", "width": 640, "cloudinary_id": "mxyh0nxjrfygftpe9vte", "height": 468}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iadxkokzpiwyie6zvoyd.jpg", "width": 640, "cloudinary_id": "iadxkokzpiwyie6zvoyd", "height": 400}], "id": 2473}, {"genres": [9], "summary": "The classical puzzle game of moving boxes to the right place hits MSX too with this conversion.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vztexenyzrjcq34rvwrt.jpg", "width": 745, "cloudinary_id": "vztexenyzrjcq34rvwrt", "height": 1038}, "id": 6136, "name": "Soukoban"}, {"genres": [5, 8, 33], "name": "Gunstar Heroes", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rxxkowjhk67wxdzicdpq.jpg", "width": 300, "cloudinary_id": "rxxkowjhk67wxdzicdpq", "height": 428}, "summary": "The Gunstar family are the protectors of the planet Gunstar 9. After many years of peace, vicious dictator Colonel Red kidnapped the Gunstar twins’ older brother and used mind control to make him his slave.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bmbnekbon8rrym67nil5.jpg", "width": 640, "cloudinary_id": "bmbnekbon8rrym67nil5", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x9b2dr1uzinptbri4lui.jpg", "width": 320, "cloudinary_id": "x9b2dr1uzinptbri4lui", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w1hcl1h1q4aov120aooi.jpg", "width": 320, "cloudinary_id": "w1hcl1h1q4aov120aooi", "height": 241}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oaqxofsec6apodol5zbe.jpg", "width": 320, "cloudinary_id": "oaqxofsec6apodol5zbe", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/feqetsjxrimjcmupkqqa.jpg", "width": 320, "cloudinary_id": "feqetsjxrimjcmupkqqa", "height": 240}], "id": 6405}, {"genres": [8], "name": "The Jungle Book", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vx4nojbychdmjmxjcpy8.jpg", "width": 256, "cloudinary_id": "vx4nojbychdmjmxjcpy8", "height": 357}, "summary": "The Jungle Book game is based on a Disney movie hero Mowgli. It's a scrolling arcade action game. You play as Mowgli and your goal is to gather all gems and return to one of your friends or your mother. The jungle is full of the nasty animals and you have to make your way through it safely.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xz8kjleuedi6utdpmmne.jpg", "width": 768, "cloudinary_id": "xz8kjleuedi6utdpmmne", "height": 576}], "id": 6480}, {"genres": [25], "name": "Batman Forever", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wvtsolmndf21wy5jsenn.jpg", "width": 220, "cloudinary_id": "wvtsolmndf21wy5jsenn", "height": 333}, "summary": "Brace yourself for endless action with BATMAN FOREVER! Batman and Robin blast into Gotham City in a duo-player fighting game! Armed with over 125 incredible attacks, fierce combat moves, and an arsenal of gadgets, the Dynamic duo are ready to battle the diabolical minds of Two-Face and The Riddler! \n \nWithout a question...it's BATMAN FOREVER!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/upxt4rcnykxphvcz7pya.jpg", "width": 260, "cloudinary_id": "upxt4rcnykxphvcz7pya", "height": 266}], "id": 7769}, {"genres": [25], "name": "The Adventures of Batman & Robin", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ms4hlrdthun4zfsbty1x.jpg", "width": 800, "cloudinary_id": "ms4hlrdthun4zfsbty1x", "height": 564}, "summary": "Now there is The Adventures of Batman and Robin. \"What's the difference?\" you ask. Precisely,. Batman battles through the eight toughest levels of villainy to hit your TV screen. You'll be dazzled by the animation-style graphics. You'll be awed by great sound and a stirring musical score. You'll swear you were watching the hit animated seriesexcept for one tiny detail. YOU CONTROL THE ACTION! \n \nUsing a combination of brains and brawn, you decide the fate of Gotham City as you strategically lead Batman on his mission to eradicate violence and mayhem. Operating out of the top secret Batcave, you'll use smoke bombs, Batarangs, x-ray goggles and all the weapons your utility belt can hold as you swing across rooftops and dash through dark alleys, tracking down the elusive Catwoman. You'll try to put a stop to Two-Face as you race through the streets in the Batmobile. You'll enlist the aid of Robin to put The Penguin out of business. You can't relax though, because Scarecrow, The Joker, Poison Ivy, Clayface and their motley crews will crush you and take control of Gotham City!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gpif5coud6czhp6ohblr.jpg", "width": 500, "cloudinary_id": "gpif5coud6czhp6ohblr", "height": 438}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cu03yi8oqn6t9wlx7ybj.jpg", "width": 500, "cloudinary_id": "cu03yi8oqn6t9wlx7ybj", "height": 436}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qla8tpu0itliz7xkbu9v.jpg", "width": 500, "cloudinary_id": "qla8tpu0itliz7xkbu9v", "height": 436}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fuc5dkrfmqjd7qwr3wby.jpg", "width": 500, "cloudinary_id": "fuc5dkrfmqjd7qwr3wby", "height": 436}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tsisulycsirdo4yjbsvm.jpg", "width": 500, "cloudinary_id": "tsisulycsirdo4yjbsvm", "height": 436}], "id": 5346}, {"summary": "Enter a vicious web of danger and disaster! The Kingpin of Crime frames Spider-Man for planting a bomb in New York; and Spidey's only hope is to find the keys to the bomb's location before it explodes. Help Spider-Man stick it to the Kingpin and his horde of vicious assassins along the way. Enter hand-to-hand combat with Dr. Octopus! Put the Sandman to sleep! Use dazzling acrobatics to take on the Lizard, Hobgoblin and Venom! Dodge Electro's amped-up charge! Don't be fooled by the new trickery of Mysterio and the villainy of the Vulture! Take aim with Spidey's gadgets. Shoot webs! Stick to walls and ceilings! Swing from skyscrapers!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qsasjl0h7rfmag51gd99.jpg", "width": 257, "cloudinary_id": "qsasjl0h7rfmag51gd99", "height": 196}, "id": 5357, "name": "The Amazing Spider-Man vs. The Kingpin"}, {"genres": [4, 8], "summary": "Standard side-scrolling fighter based off of the Stallone film of the same name. Sly must fight thugs and the elements as he tracks down suitcases of stolen cash dropped around the peaks of the Rockies. Combat follows the Final Fight standard, broken up by some mountain climbing and running (or 3-D snowboarding on the Sega CD) from avalanches. \n \nEnemies are the standard brawler crooks, occasionally carrying guns and knives the player can pick up. The game tends to follow a pattern of having you deal with a natural hazard (scaling a cliff, leaping over gaps), then locking the screen down for a fighting segment, nature again, fighting again, etc. The available fighting moves is limited, compared to other games of this type, and the ability to hit an enemy character is noticeably less accurate. \n \nThe plot is identical to the film, with levels based off of, or inspired by, scenes in the movie. Animated cutscenes move the story along on the cartridge systems, while brief clips from the film play between levels on the Sega CD.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vt4a1gwgvt88td3atuvb.jpg", "width": 175, "cloudinary_id": "vt4a1gwgvt88td3atuvb", "height": 241}, "id": 5370, "name": "Cliffhanger"}, {"genres": [4], "name": "Fatal Fury Special", "videos": [{"video_id": "AlZ1q2Gddsc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cwc6ncgkxaftroc2rb1w.jpg", "width": 250, "cloudinary_id": "cwc6ncgkxaftroc2rb1w", "height": 335}, "summary": "The GRANDMOTHER of all battles! 15 of the FATAL FURY series' top stars gather in the match of the millenium! Use the resurrected Geese Howard and Wolfgang Krauser in a dazzling arena! All you have ever wanted in a fighting game is here in FATAL FURY SPECIAL!", "id": 5385}, {"genres": [25], "name": "Batman Returns", "videos": [{"video_id": "seQGoF4jqDU", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gkm7i8aubxbrs6rxdlkb.jpg", "width": 220, "cloudinary_id": "gkm7i8aubxbrs6rxdlkb", "height": 311}, "summary": "Batman Returns is a beat-em-up side-scrolling game designed for the Sega consoles, and ported to the Nintendo Entertainment System and the Super NES. It was published by Sega, and Konami for the Nintendo platforms. Reviews of the game were very positive, with many citing the impressive quality of graphics, controls, and atmosphere.", "storyline": "The game allows the player to experience seven scenes that were featured in the film of the same name. Batman must fight his way through the Red Triangle Circus Gang, using the various weapons and fighting moves he has available. Each level has a unique boss which must be defeated in order for the player to progress to the next level.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ndv8upeyipjunk5s0ynl.jpg", "width": 220, "cloudinary_id": "ndv8upeyipjunk5s0ynl", "height": 193}], "id": 4379}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vbuxjjnsxbbgjrzsjrvo.jpg", "width": 220, "cloudinary_id": "vbuxjjnsxbbgjrzsjrvo", "height": 314}, "genres": [8], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nmqhkvn29aphzq92lyso.jpg", "width": 320, "cloudinary_id": "nmqhkvn29aphzq92lyso", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ucvldelvo1a4ytd1nfeo.jpg", "width": 286, "cloudinary_id": "ucvldelvo1a4ytd1nfeo", "height": 240}], "id": 4516, "name": "Chuck Rock"}, {"genres": [31], "name": "Ecco the Dolphin", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/atl65klbsns5gwzasbsv.jpg", "width": 256, "cloudinary_id": "atl65klbsns5gwzasbsv", "height": 358}, "summary": "Life was an adventure for Ecco, the young dolphin. The ocean seemed endless with rolling breakers to race through! At high speed Ecco could burst through the waves leaping through the air – almost flying! Until one day, all of that changed. A freak whirlpool of air and water tore the life from Ecco’s home leaving Ecco all alone. Now he must fight to stay alive, while traversing the vast ocean in search of clues that will help him save his family and return them to the bay.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/b0fdf2zhtbuksfkbblfb.jpg", "width": 500, "cloudinary_id": "b0fdf2zhtbuksfkbblfb", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j2rye40bl5onzapxbkgh.jpg", "width": 220, "cloudinary_id": "j2rye40bl5onzapxbkgh", "height": 155}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uza6mh9br5hj0rmaqkn7.jpg", "width": 500, "cloudinary_id": "uza6mh9br5hj0rmaqkn7", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/e1b3gskkzrdenxpumwz3.jpg", "width": 500, "cloudinary_id": "e1b3gskkzrdenxpumwz3", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tav2hke9dnryynke5mqd.jpg", "width": 500, "cloudinary_id": "tav2hke9dnryynke5mqd", "height": 370}], "id": 5378}, {"genres": [31], "name": "Ecco: The Tides of Time", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/b2rz067kdrolzvupjkbt.jpg", "width": 256, "cloudinary_id": "b2rz067kdrolzvupjkbt", "height": 432}, "summary": "Ecco must stop the Vortex! He is “the stone that splits the stream of time.” He now faces his most dangerous quest yet. For it is not just his dolphin pod at stake, but the Earth and all living beings!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/iur1ogvlnddkwval5mpt.jpg", "width": 500, "cloudinary_id": "iur1ogvlnddkwval5mpt", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fmir5uhr3xz4zzhxkpib.jpg", "width": 500, "cloudinary_id": "fmir5uhr3xz4zzhxkpib", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/okjoq9gaimyuo4vxlbdo.jpg", "width": 500, "cloudinary_id": "okjoq9gaimyuo4vxlbdo", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zqckeotwsenmkfdr2xk0.jpg", "width": 500, "cloudinary_id": "zqckeotwsenmkfdr2xk0", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pqmq1bjpq9xuqqb37pro.jpg", "width": 500, "cloudinary_id": "pqmq1bjpq9xuqqb37pro", "height": 370}], "id": 5379}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ni9x1925sswpxnjsntd6.jpg", "width": 252, "cloudinary_id": "ni9x1925sswpxnjsntd6", "height": 434}, "genres": [8], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/w89iw4mihn6kxymcirav.jpg", "width": 320, "cloudinary_id": "w89iw4mihn6kxymcirav", "height": 256}], "id": 4371, "name": "Chuck Rock II: Son of Chuck"}, {"genres": [4], "summary": "In early Japan, a man named Shiro Tokisada Amakusa preaches a heretic religion. Little does anyone know that Amakusa is really a servant of the evil Ambrosia, who took over Amakusa's body. Ambrosia wishes to shroud the world in darkness. Now, choose between 12 warriors (and 3 bonus characters) to fight for the honor of destroying Amakusa, and fulfilling a mission.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dyeld0ai8x2hskftzdtk.jpg", "width": 1612, "cloudinary_id": "dyeld0ai8x2hskftzdtk", "height": 3083}, "id": 4260, "name": "Samurai Shodown"}, {"genres": [8], "name": "Wolfchild", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yxmwtu8plxsuvnsbbsyp.jpg", "width": 220, "cloudinary_id": "yxmwtu8plxsuvnsbbsyp", "height": 277}, "summary": "The world's most renowned biogenetic scientist has been kidnapped and brainwashed into creating an army of bloodthirsty mutant warriors. \n \nSuddenly the fate of all mankind rests in the hands of his youngest son... and a top-secret mutating experiment known as \"Project Wolfchild.\" \n \n-10 freaky levels filled with mind-blowing mazes, brain twisting puzzles and against all-odds combat action. \n \n-CD-quality graphics and a rockin' stereo soundtrack \n \n-Grusome cast of unrelenting schitzoid mutants, each with the power to destroy \n \n-Fully animated introduction sequence", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rrcomwwwoc10xbnsj1u7.jpg", "width": 320, "cloudinary_id": "rrcomwwwoc10xbnsj1u7", "height": 256}], "id": 4403}, {"genres": [14], "name": "World Cup USA '94", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x37aplzhupsxqlb95ogv.jpg", "width": 220, "cloudinary_id": "x37aplzhupsxqlb95ogv", "height": 313}, "summary": "Realistic gameplay with over 15 different moves. Customize gameplay to suit your own soccer style using pre-match options. Over 3000 frames of animation.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nteapw2hs6iryeqgnpwz.jpg", "width": 320, "cloudinary_id": "nteapw2hs6iryeqgnpwz", "height": 256}], "id": 5464}, {"genres": [4, 10], "name": "Road Rash", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eywipiisblrls5hjxcrm.jpg", "width": 1530, "cloudinary_id": "eywipiisblrls5hjxcrm", "height": 2100}, "summary": "Road Rash is an aggressive motorcycle racing game where the player assumes the role of a biker who takes part in a series of illegal races across the U.S.A. Starting at the back of the pack the objective is always to finish first on a linear course, overtaking the other bikers. This is achieved by driving very well or by playing it dirty, knocking opponents of their bikes using clubs, crowbars or your bare hands. The other racers fight back in a similar fashion and there are also hazards. All the races take place on the regular road with normal traffic (in both directions) and the cops, as well as occasional oil slicks and stray cows. \n \nBy winning races you can get promoted to a stronger division and earn cash with which you can buy a better bike. Whenever you're knocked off your bike or hit something you will have to run back to your bike and lose valuable time, plus your bike will suffer some damage. When the player crashes with cops nearby, it is possible to get busted and then you have to forfeit the race. \n \nLike the whole Road Rash lineage, the game has arcade-like gameplay with no intention to be a motorcycle simulation. While the game has a two-player mode, this is not simultaneous.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jmcjdzp6uf3eiw4vnjg2.jpg", "width": 660, "cloudinary_id": "jmcjdzp6uf3eiw4vnjg2", "height": 330}], "id": 3249}, {"genres": [8], "summary": "Uncle Scrooge found a magical necklace on a mysterious island, but the necklace put a curse on him. Now Uncle Scrooge is doomed to float around in the air forever! (Of course Donald always said Scrooge was full of hot air anyway!) To take the curse off Uncle Scrooge, Donald has to take the necklace back to the island. But there's plenty of danger awaiting Donald there. How about lending him a hand?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qv0vrkyrpnt2am1tzimz.jpg", "width": 256, "cloudinary_id": "qv0vrkyrpnt2am1tzimz", "height": 355}, "id": 8447, "name": "Deep Duck Trouble Starring Donald Duck"}, {"genres": [5, 33], "summary": "One thousand years into the future, you live in constant fear of the Dark Dragon and his giant cyborg insect armies. Armed with a deadly weapon from the ancient past and the guidance of your armored blue dragon, you must save your people from endless swarms of deadly foes. Fulfill your destiny and keep the Dark Dragon from reaching the tower; or die trying.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/najyddvubbf4fodifzwn.jpg", "width": 1100, "cloudinary_id": "najyddvubbf4fodifzwn", "height": 1550}, "id": 1670, "name": "Panzer Dragoon Mini"}, {"genres": [8], "summary": "Based on the successful cartoon 'Beavis and Butt-head', the game is very faithful to the series. \n \nIt game stars at the home of Beavis and Butt-head - and from there you can choose to go to different locations like: Turbo mall 2000, the street, burger world, hospital, GWAR concert and more... your main goal is to find money to the GWAR concert.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/weucvd9au4kih5xn1rph.jpg", "width": 250, "cloudinary_id": "weucvd9au4kih5xn1rph", "height": 345}, "id": 7777, "name": "Beavis and Butt-head"}, {"genres": [9], "summary": "The player must maneuver boxes in a warehouse in order to make enough money to woo his desired girlfriend.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tunibtpkpqxkogiko4sh.jpg", "width": 220, "cloudinary_id": "tunibtpkpqxkogiko4sh", "height": 218}, "id": 7799, "name": "Boxxle"}, {"genres": [4, 8, 25], "summary": "Captain America and the Avengers is an arcade game released by Data East in 1991. It features the Marvel Comics characters The Avengers in a side-scrolling brawling and shooting adventure to defeat the evil Red Skull.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aqhtt7tlzobtvtrhpl3u.jpg", "width": 220, "cloudinary_id": "aqhtt7tlzobtvtrhpl3u", "height": 313}, "id": 7816, "name": "Captain America and the Avengers"}, {"genres": [5, 15], "summary": "Choplifter III for the SNES features entirely different levels from the Game Gear and GameBoy versions, and plays slightly different than other Choplifter games. While the controls and basic gameplay haven't changed significantly, and the main goal of each level is still rescuing a certain number of hostages, Choplifter III is faster and more action-oriented than earlier Choplifter games.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xcpfloifqxjhdlswfct6.jpg", "width": 220, "cloudinary_id": "xcpfloifqxjhdlswfct6", "height": 161}, "id": 7824, "name": "Choplifter III"}, {"genres": [8, 31], "summary": "Based on the feature film of the same name. \nThe game casts players in the role of renegade treasure hunters. The player is able to choose between two characters: Morgan Adams, a female character who wields a rapier; or William Shaw, a buccaneer who is armed with a sword. The game features single player and two player action mode. During single player mode, the player's character must battle through 10 levels, encountering various foes such as pirates, redcoats and harbor masters. The game features two different gameplay styles to choose from: Swordplay and Brawling. In addition to all the swordplay, level two requires players to flee from prison guards in a quarry cart, and level five puts player atop a runaway horse-drawn carriage. As the player progresses through the game several items such as knives, bombs, bottles, torches, hammers, pistols, and other weapons are collectable.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uc1f5klfahb84waanamy.jpg", "width": 220, "cloudinary_id": "uc1f5klfahb84waanamy", "height": 161}, "id": 7828, "name": "Cutthroat Island"}, {"genres": [9, 15], "name": "Lemmings 2: The Tribes", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/a6cr1kyletwtrlhk91uh.jpg", "width": 250, "cloudinary_id": "a6cr1kyletwtrlhk91uh", "height": 323}, "summary": "By now, you'll probably be aware of the horrible plight the Lemmings face. Not only do they have to leave their lovely little hovels for good,but they also have to escape their island before they perish in the Darkness that's coming. Your objective therefore is to save as many Lemmings as possible from each tribe and help them escape the Island.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nw7kmb49f3ekhto6hwoz.jpg", "width": 1919, "cloudinary_id": "nw7kmb49f3ekhto6hwoz", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mzdvhqe8methp5tybvum.jpg", "width": 1919, "cloudinary_id": "mzdvhqe8methp5tybvum", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/a9j0zepl92ha7metlp2u.jpg", "width": 1919, "cloudinary_id": "a9j0zepl92ha7metlp2u", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jymapeeaa8etz74ez8ky.jpg", "width": 1919, "cloudinary_id": "jymapeeaa8etz74ez8ky", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hhrdjg9n7mnm25kpqv0r.jpg", "width": 1919, "cloudinary_id": "hhrdjg9n7mnm25kpqv0r", "height": 1079}], "id": 8307}, {"genres": [8], "summary": "Quest for the Shaven Yak Starring Ren & Stimpy is a 2D Platformer game, developed by Realtime Associates and published by Tec Toy, which was released in South America in 1993.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wnfvaezlgnnyf9qaixlj.jpg", "width": 245, "cloudinary_id": "wnfvaezlgnnyf9qaixlj", "height": 350}, "id": 7986, "name": "Quest for the Shaven Yak Starring Ren Hoëk and Stimpy"}, {"genres": [8], "summary": "Wham!!! Biff1!! Pow!!! Asterix is back in another highly exciting adventure. Yet again Asterix and his good friend Obelix are thrown into an amazing adventure, when they find out that Getafix and Dogmatix have been kidnapped by the Romans. Asterix and Obelix must defeat the Romans and bring their friends back home!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/om4m1ntcsb17yqqpsu4r.jpg", "width": 209, "cloudinary_id": "om4m1ntcsb17yqqpsu4r", "height": 294}, "id": 8501, "name": "Asterix and the Great Rescue"}, {"genres": [10, 13], "name": "Super Monaco GP", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qxbmviuaxbzyrrstkfkq.jpg", "width": 220, "cloudinary_id": "qxbmviuaxbzyrrstkfkq", "height": 158}, "summary": "A superb Formula One racing game from Sega that took sprite-scaled graphics to a whole new level. The game's single track offered a very reasonable representation of the famous Monaco Grand Prix circuit. \n \nPlayers could chose to race with one of three different skill/gear settings : \n \nBeginner : Automatic Gears \n \nIntermediate : 4-Speed Manual gears \n \nProfessional : 7-Speed Manual Gears \n \nBefore entering the Grand Prix, a qualification lap had to be completed. In the event of qualifying, the qualifying time determined the player's position on the starting grid. During the race itself, checkpoints had to be reached within a set time, or the race was over.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gtlssmt1jkhd9qjumohi.jpg", "width": 1440, "cloudinary_id": "gtlssmt1jkhd9qjumohi", "height": 1008}], "id": 4528}, {"genres": [8], "name": "Master of Darkness", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j5edfccl6gaku3yukepb.jpg", "width": 256, "cloudinary_id": "j5edfccl6gaku3yukepb", "height": 375}, "summary": "The shadow of Dracula has spread over Victorian England. Make your way through strange and forbidding streets and cavernous warehouses while fighting his army of monsters. Find Dracula, the Master of Darkness, and rescue England from his terrifying grasp.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jjmtaokythgdirahpabb.jpg", "width": 640, "cloudinary_id": "jjmtaokythgdirahpabb", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mvhgzmtucjkpbqvqjs3i.jpg", "width": 640, "cloudinary_id": "mvhgzmtucjkpbqvqjs3i", "height": 480}], "id": 8039}, {"genres": [8], "summary": "Oooooh, that mouse! If there's one thing Tom can't stand, it's a rascally rodent named Jerry, and if that mouse isn't careful, Tom is going to nab him. But Jerry is pretty tricky. So muster up all your feline courage, Tom, 'cause there's a dangerous little mouse in the house!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r0uksxr1m5jqbyk7wsxy.jpg", "width": 188, "cloudinary_id": "r0uksxr1m5jqbyk7wsxy", "height": 268}, "id": 8043, "name": "Tom and Jerry: The Movie"}, {"genres": [8, 31], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/shsijllainbd4lhg4p3u.jpg", "width": 220, "cloudinary_id": "shsijllainbd4lhg4p3u", "height": 301}, "id": 8066, "name": "Taz-Mania"}, {"genres": [31], "summary": "You play as Taz, the famous cartoon-character. Taz is captured by Marvin the Martian and transfered to his intergalactic Zoo! Now it is your job to aid Taz in his great escape from the Zoo-prison and also find a way back home to Earth. To make the escape a little easier, there are items placed here and there, such as cakes which make regain your health. You also find gas tanks, which you can eat and then breath fire.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s6durwxz3xob4apzkqqb.jpg", "width": 220, "cloudinary_id": "s6durwxz3xob4apzkqqb", "height": 309}, "id": 8065, "name": "Taz in Escape From Mars"}, {"genres": [5, 8], "name": "James Bond 007: The Duel", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yt5scgaylhik5blgougn.jpg", "width": 700, "cloudinary_id": "yt5scgaylhik5blgougn", "height": 1032}, "summary": "The Duel is a James Bond video game released for the Sega Master System, the Sega Game Gear, and the Sega Mega Drive / Genesis. The game was developed and published by Domark and released in 1993.\nArmed with a pistol, the player controls James Bond through various side-scrolling enemy bases to rescue female hostages and arm a bomb placed at a strategic point to destroy the base. Along the way, Bond must battle numerous thugs and familiar bosses.\nThe game is notable among Bond games for a number of reasons. Although it was released 4 years after Timothy Dalton's last outing as James Bond, his likeness is used in the game, most notably the opening screens, thus making it Dalton's last appearance in a Bond game to date. It was also the final Bond game to be released by Domark. It was also the first Bond game not to be directly based on a movie or novel. Instead it featured an original storyline, albeit one featuring familiar villains including Jaws and Oddjob. Though the game's storyline was not its strong point, it did blaze a trail for future licence-holders EA, half of whose Bond output would be based on original storylines. One previous Bond game, Operation Stealth, included an original storyline but the game was originally based on a generic Bond-style character named John Glames and only had the licence added for its North American release.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cpgkzltdmesm38grlfu3.jpg", "width": 640, "cloudinary_id": "cpgkzltdmesm38grlfu3", "height": 480}], "id": 1637}, {"genres": [8], "summary": "Smurf to the rescue! Gargamel has already captured 4 Smurfs, Jocky Smurf, Greedy Smurf, Brainy Smurf and Smurfette. To free them you will have to smurf the Angry Smurfs and BUZZ flies before smurfing the mountain by sled, then smurfing the maze mine galleries, smurfing on the back of a stork to smurf Azrael and finally smurf Gargamel from his mansion! \nGood Smurf!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p1tahy0cidaizkca4rls.jpg", "width": 271, "cloudinary_id": "p1tahy0cidaizkca4rls", "height": 186}, "id": 8083, "name": "The Smurfs"}, {"genres": [31], "name": "Desert Speedtrap Starring Road Runner & Wile E. Coyote", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eqkggapwgnl0ttjv31tb.jpg", "width": 220, "cloudinary_id": "eqkggapwgnl0ttjv31tb", "height": 318}, "summary": "This is a platform game starring Looney Tunes famous Road Runner(who you control) and nemesis Wile E. Coyote. Road Runner can jump, eat birdseed to replenish life and run, of course! Holding the D-pad down speeds him up. The clock is ticking and if you run out of time a try is lost, collecting stars adds time to the clock \n \nThere are various items/powerups and bonus areas \n \n3 difficulty settings, choice to play with or without music and/or sound effects and an option to play the game music while not in game", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/f5ofdfksukfvnc9vvr3v.jpg", "width": 1440, "cloudinary_id": "f5ofdfksukfvnc9vvr3v", "height": 1080}], "id": 8098}, {"genres": [8], "summary": "Night falls at the Smurf Village. Inquisitive Smurf brings Smurfette along to Papa Smurf's laboratory to see the Magic Crystal that allows them to travel to anywhere in the world, but suddenly Smurfette breaks it, and they are gone! Now they must face the challenges in all continents in order to retrieve all shards of the Crystal and return home. (In the Master System and the portable versions of this game, there is also the additional task of cleaning the various regions of the world that the two Smurfs visit of its pollution.)", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/popjft4j4hv1eme8clmh.jpg", "width": 240, "cloudinary_id": "popjft4j4hv1eme8clmh", "height": 171}, "id": 4402, "name": "The Smurfs Travel the World"}, {"genres": [4], "summary": "Shaq brings his awesome skill and size to a multi-world fighting game. \n \nAs Shaq, use your lightning-fast shuriken and other martial art techniques to prevail over 11 intensely evil warriors in the enforcement of justice. Or choose any of the 12 warriors and fight head to head. Summon Voodoo's bone shattering earthquake, rebound with Rajah's shockwave sword or lash out with Sett's terrifying mummy wrap. Scores of secret power moves to discover and master.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xlz5dnjlxhncrk9unriy.jpg", "width": 640, "cloudinary_id": "xlz5dnjlxhncrk9unriy", "height": 835}, "id": 8536, "name": "Shaq-Fu"}, {"genres": [8], "name": "Castle of Illusion Starring Mickey Mouse", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ymhbze4eqtbckvxb5u1r.jpg", "width": 248, "cloudinary_id": "ymhbze4eqtbckvxb5u1r", "height": 348}, "summary": "Minnie Mouse has been kidnapped by the evil witch Mizrabel, and it's up to Mickey Mouse to venture through the mysterious worlds of the Castle of Illusion to rescue her in this 2D platformer (and collaboration between Disney and Sega).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ogvzdabi7umyqyo2nwnx.jpg", "width": 1280, "cloudinary_id": "ogvzdabi7umyqyo2nwnx", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pq6mds0h2cyxvhrgpj1m.jpg", "width": 1280, "cloudinary_id": "pq6mds0h2cyxvhrgpj1m", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r0ljlbpzyzflkn9ghxbi.jpg", "width": 1280, "cloudinary_id": "r0ljlbpzyzflkn9ghxbi", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r3eyroib4t342e6plmxw.jpg", "width": 1280, "cloudinary_id": "r3eyroib4t342e6plmxw", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xzlmkb4t39c9apxsel1n.jpg", "width": 1280, "cloudinary_id": "xzlmkb4t39c9apxsel1n", "height": 829}], "id": 8122}, {"genres": [8], "summary": "Mickey finds himself in a fairy tale land where an evil Phantom-in-the-Clouds has stolen a special gem which brought peace and prosperity to a tiny village. It's up to you to help him save the day - and earn a place in Minnie's heart!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ero651vvv7q48yp7pllc.jpg", "width": 252, "cloudinary_id": "ero651vvv7q48yp7pllc", "height": 357}, "id": 8123, "name": "Land of Illusion Starring Mickey Mouse"}, {"genres": [8], "summary": "Mickey is tricked into a perilous quest when the kingdom is threatened by an evil cloud of darkness. As temporary king, Mickey must solve riddles, find maps and avoid trickery across 5 magical lands to save the Tree of Life from the cowardly King Pete.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dkpvbjxorslup5tqbjv4.jpg", "width": 192, "cloudinary_id": "dkpvbjxorslup5tqbjv4", "height": 262}, "id": 8125, "name": "Legend of Illusion Starring Mickey Mouse"}, {"genres": [8], "summary": "Presenting the world famous Daffy Duck P.I. Armed with your lethal bubble gun, search the Hollywood film sets for Yosemite Sam's Golden Cartoon World Movie Awards and the despicable Mad Professor Duck Brain.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l3k6u3ne1xmgu1mhjigt.jpg", "width": 1430, "cloudinary_id": "l3k6u3ne1xmgu1mhjigt", "height": 2025}, "id": 4461, "name": "Daffy Duck in Hollywood"}, {"genres": [8, 15, 33], "name": "Bubble Bobble", "videos": [{"video_id": "ZVLcmx7kW7s", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fvvjot97a8ia4xwzjy3i.jpg", "width": 352, "cloudinary_id": "fvvjot97a8ia4xwzjy3i", "height": 494}, "summary": "In the game, each player controls one of the two Bubble Dragons, Bub and Bob. The player can move along platforms, as well as jump to those above and to the side, similar to most platform games. \n \nThe player can also blow bubbles. These can trap enemies, who are defeated if the bubble is then burst by the player's spiny back. Bubbles that contain enemies can be popped at the same time resulting in different foods being projected around the level. Each enemy trapped in a bubble equates to a different food. Food is consumed and transferred to points (an increasing scale of 1000 points is awarded for each enemy burst in tandem with another meaning: one enemy burst equals one food item worth 1000 points, two enemies burst equals two food items worth 1000 and 2000 points, three enemies burst equals three food items worth 1000, 2000 and 4000 points, and so on), which results in earning lives. These same bubbles also float for a time before bursting, and can be jumped on, allowing access to otherwise inaccessible areas. Players progress to the next level once all enemies on the current level are defeated. \n \nEnemies turn \"angry\" — becoming pink-colored and moving faster — if they are the last enemy remaining, escape from a bubble after being left too long or a certain amount of time has been spent on the current level. A monster will also become angry if either player collects a skull (the only negative item in the game), and the monster is hit by the resulting comet crossing the screen (however, this is a rare occurrence). \n \nAfter a further time limit expires, an additional invincible enemy appears for each player, actively chasing them using only vertical and horizontal movements. These do not need to be defeated to complete the level, and disappear once a player's life is lost. \n \nContact with enemies and their projectiles (rocks, lasers, fireballs, etc.) results in death.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hwbgrtxakeodkfwzlppe.jpg", "width": 800, "cloudinary_id": "hwbgrtxakeodkfwzlppe", "height": 750}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/el9zsctos0tamlhg2aat.jpg", "width": 540, "cloudinary_id": "el9zsctos0tamlhg2aat", "height": 506}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nckph4earsembk75t6mi.jpg", "width": 540, "cloudinary_id": "nckph4earsembk75t6mi", "height": 506}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/t7oo9mhc4yeodrutksgu.jpg", "width": 540, "cloudinary_id": "t7oo9mhc4yeodrutksgu", "height": 506}], "id": 2630}, {"genres": [10], "name": "Micro Machines 2: Turbo Tournament", "videos": [{"video_id": "omgZpeALT3U", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zagakbazhvbpsfnlyxnf.jpg", "width": 300, "cloudinary_id": "zagakbazhvbpsfnlyxnf", "height": 422}, "summary": "Micro Machines 2: Turbo Tournament featured cars that require different handling techniques for each course and also hovercraft and helicopters. There are different playing modes including \"head-to-head\", in which each player earns points by driving a full screen ahead of the opponent. TV presenter Violet Berlin features as a playable driver. The MS-DOS version featured a track editor.\nA selling point for the Sega Genesis/Mega Drive version was the J-Cart, a cartridge including two control ports, thus eliminating the need for a 4-player adaptor. It also included a 'pad-sharing' feature which allowed 2 players to share a single joypad; thus it enabled 8 players to compete simultaneously, on certain tracks.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/dwj9bpr6bfuxntzxafht.jpg", "width": 640, "cloudinary_id": "dwj9bpr6bfuxntzxafht", "height": 480}], "id": 8775}, {"genres": [5, 8, 31], "name": "Alien³", "videos": [{"video_id": "jsKzeo5RXuo", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fake7ncywh8afhenybc1.jpg", "width": 250, "cloudinary_id": "fake7ncywh8afhenybc1", "height": 350}, "summary": "Alien³ was released after the Alien 3 film. After success on the Super Nintendo and Genesis platforms, the game was built and ported to other systems, including the Commodore 64 and Game Gear. The game is set on the world of the film, Fury 161, but the gameplay has more in common with the film Aliens, throwing wave after wave of enemies at the player.", "storyline": "Loosely based off of the movie franchise, the main character Ripley arrives at Fiorina \"Fury\" 161, and she finds the planet is infested by Xenomorph Runnera. She is equipped with Colonial Marine equipment to defend herself while rescuing prisoners that are captured by the Aliens.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vrhrnif7e8nn2gy61zmg.jpg", "width": 800, "cloudinary_id": "vrhrnif7e8nn2gy61zmg", "height": 585}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ymhwoff8klxpxekccwji.jpg", "width": 640, "cloudinary_id": "ymhwoff8klxpxekccwji", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aziwtkukbkydayirxbzd.jpg", "width": 640, "cloudinary_id": "aziwtkukbkydayirxbzd", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bzaazyymcersos1ooidd.jpg", "width": 638, "cloudinary_id": "bzaazyymcersos1ooidd", "height": 477}], "id": 8908}, {"genres": [14], "name": "Arch Rivals", "videos": [{"video_id": "R-jIrsxJ_v4", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uoxl9wtfuiwyvupmdsxm.jpg", "width": 1534, "cloudinary_id": "uoxl9wtfuiwyvupmdsxm", "height": 2100}, "summary": "Arch Rivals is a basketball game developed and published by Midway in 1989. The game introduces violence as an important part of the game, encouraging players to punch opposing players and stealing the ball from them. The game is regarded as the forerunner to Midway's popular arcade basketball game, NBA Jam.", "storyline": "Players are able to select between a vareity of fictional teams and players. Games follow the standard basketball rules, with the exception of the accepted level of violence. The objective is to outscore the opponent. There are only two players on each team on the court, rather than the standard 5 men/team that is standard in basketballl.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/i5yvkzkimaqht7sbawyn.jpg", "width": 640, "cloudinary_id": "i5yvkzkimaqht7sbawyn", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nq70jywgllenszeubtp3.jpg", "width": 512, "cloudinary_id": "nq70jywgllenszeubtp3", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z51owsjwcmka4ria3hls.jpg", "width": 640, "cloudinary_id": "z51owsjwcmka4ria3hls", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zd7vyyozdvcwqoqaj1mh.jpg", "width": 300, "cloudinary_id": "zd7vyyozdvcwqoqaj1mh", "height": 281}], "id": 4515}, {"genres": [25], "name": "Streets of Rage", "videos": [{"video_id": "sLpS_s1PaXM", "name": "Gameplay video"}, {"video_id": "MXjaCkPWpvU", "name": "Game intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/so3nydnezx136deqo7pc.jpg", "width": 640, "cloudinary_id": "so3nydnezx136deqo7pc", "height": 895}, "summary": "Streets of Rage (ベアナックル 怒りの鉄拳 Bea Nakkuru: Ikari no Tekken?, \"Bare Knuckle: Furious Iron Fist\") is a side-scrolling beat 'em up video game developed and published by Sega in 1991 for Mega Drive/Genesis. It is the first installment of the Bare Knuckle/Streets of Rage series which was followed by Streets of Rage 2 and Streets of Rage 3. The game was converted to Game Gear, Sega CD and Master System. In 2007, the game was released for the Wii's Virtual Console in North America and Europe, and in 2009 it was released for the iOS via the App Store. It was again made available as part of Sonic's Ultimate Genesis Collection in 2009 on both the PlayStation 3 and Xbox 360 consoles.", "storyline": "The once peaceful city has been taken over by a criminal syndicate, including factions of the police. Mass violence is now common and no one is safe. Adam Hunter (an accomplished boxer), Axel Stone (skilled martial artist) and Blaze Fielding (judo expert) are young ex-police officers who have quit the force to fight back against the syndicate. \nDepending on whether the game is played as one-player or a two-player co-op, and whether the player accepts or rejects Mr. X's offer to join his henchmen, there is a possibility for an alternate ending where the player becomes the new head of the crime syndicate.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/dgzny6lsebonawh8b3hs.jpg", "width": 640, "cloudinary_id": "dgzny6lsebonawh8b3hs", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zzqzpcvoqrbi5x6su5mz.jpg", "width": 640, "cloudinary_id": "zzqzpcvoqrbi5x6su5mz", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ihmklwo06d83qnlpkyl5.jpg", "width": 640, "cloudinary_id": "ihmklwo06d83qnlpkyl5", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l1mxjtivfaewzetl2ffh.jpg", "width": 640, "cloudinary_id": "l1mxjtivfaewzetl2ffh", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hfakhjocgmcwbdodqm8t.jpg", "width": 320, "cloudinary_id": "hfakhjocgmcwbdodqm8t", "height": 240}], "id": 1652}, {"genres": [4], "name": "Mortal Kombat II", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jamebiyoftkhbgypxaje.jpg", "width": 698, "cloudinary_id": "jamebiyoftkhbgypxaje", "height": 1026}, "summary": "500 years ago, Shang Tsung was banished to the Earth Realm. With the aid of Goro he was to unbalance the furies and doom the planet to a chaotic existence. By seizing control of the shaolin tournament he tried to tip the scales of order towards chaos. Only seven warriors survived the battles and Shang Tsung's scheme would come to a violent end at the hands of Liu Kang. Facing execution for his failure and the apparent death of Goro, Tsung convinces Shao Kahn to grant him a second chance.. Shang Tsung's new plan is to lure his enemies to compete in the Outworld where they will meet certain death by Shao Kahn himself. Now, the Kombat continues...\n\nFollowing his defeat to Liu Kang, Shang Tsung begs his master, Shao Kahn, to spare his life. He tells Shao Kahn that the invitation for Mortal Kombat cannot be turned down, and if they hold it in Outworld, the Earthrealm warriors must attend. Kahn agrees to this plan, and restores Tsung's youth. He extends the invitation to Raiden, who gathers his warriors and takes them into Outworld. The tournament is dangerous, as Shao Kahn has the home field advantage, and an Outworld victory will unbalance the furies and allow Outworld to subdue Earthrealm.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/q5fqzywe1e5w7uktbe8v.jpg", "width": 480, "cloudinary_id": "q5fqzywe1e5w7uktbe8v", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/u6sbsqbfjnckmiiuzqla.jpg", "width": 452, "cloudinary_id": "u6sbsqbfjnckmiiuzqla", "height": 306}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/trv68dw9mj559emzwjqv.jpg", "width": 400, "cloudinary_id": "trv68dw9mj559emzwjqv", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vnnmg5zogmnc8vcgvtpe.jpg", "width": 1280, "cloudinary_id": "vnnmg5zogmnc8vcgvtpe", "height": 812}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dca0r150tljtbin6dadt.jpg", "width": 1280, "cloudinary_id": "dca0r150tljtbin6dadt", "height": 800}], "id": 1619}, {"genres": [14], "name": "Madden NFL 96", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vk9c0uipcngabeknfcsq.jpg", "width": 640, "cloudinary_id": "vk9c0uipcngabeknfcsq", "height": 891}, "summary": "Madden NFL 96 is one of the earlier games in the long lasting franchise. It is the first to include a create-a-player feature that had the player preform mini games similar to real NFL drills. With 28 NFL teams and many more secret historic teams, Real NFL players, and the iconic NFL on Fox music theme, Madden 96 offered an authentic experience for fans of the sport.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/fxrq0tx8da0dfh6ie8im.jpg", "width": 514, "cloudinary_id": "fxrq0tx8da0dfh6ie8im", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/c0xtxn34plufxhlzwfjk.jpg", "width": 514, "cloudinary_id": "c0xtxn34plufxhlzwfjk", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tofigtw9dze1i3jg1ye0.jpg", "width": 514, "cloudinary_id": "tofigtw9dze1i3jg1ye0", "height": 449}], "id": 4542}, {"genres": [13], "name": "Battle Tank", "videos": [{"video_id": "lVY-CYWL0g4", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/khfwmhp1t8ebxwhu4y12.jpg", "width": 220, "cloudinary_id": "khfwmhp1t8ebxwhu4y12", "height": 301}, "summary": "Battle Tank was developed by Imagineering in 1990 for the Nintendo Entertainment System and eventually ported to the Sega Game Gear console. It was originally set to become a space flight game for the Commodore 64, and thus was underdeveloped for what it became.", "storyline": "Battle Tank puts the player inside the tank in first-person view, with access to a number of different types of weapons-including shells, machine guns, smoke bombs, and wire-guided missiles. The player, after receiving mission orders for each level, must travel to an objective and fight various enemies-including other tanks, helicopters, and infantry.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/e0vjux2rvnkjpkqwyofz.jpg", "width": 300, "cloudinary_id": "e0vjux2rvnkjpkqwyofz", "height": 262}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kx7nrcmqqtsj7rwppmgr.jpg", "width": 640, "cloudinary_id": "kx7nrcmqqtsj7rwppmgr", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qor9jbkjjeueix1ksgoq.jpg", "width": 480, "cloudinary_id": "qor9jbkjjeueix1ksgoq", "height": 360}], "id": 10623}, {"genres": [25], "name": "The G.G. Shinobi", "videos": [{"video_id": "dNyujunejlM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rqrj5lsnjo21ywp72sva.jpg", "width": 220, "cloudinary_id": "rqrj5lsnjo21ywp72sva", "height": 309}, "summary": "The G.G. Shinobi is a side-scrolling action game by Sega released for the Game Gear in 1991. It was the first Shinobi game developed specifically for a portable game platform.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/l8bq8ftqdo0jrhu3uccq.jpg", "width": 500, "cloudinary_id": "l8bq8ftqdo0jrhu3uccq", "height": 385}], "id": 10219}, {"genres": [33], "name": "Pac-Man", "videos": [{"video_id": "9-ot7wUVgyo", "name": "VR"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nbyv4qrmbax0bhh1tscn.jpg", "width": 220, "cloudinary_id": "nbyv4qrmbax0bhh1tscn", "height": 285}, "summary": "Pac-Man is an arcade game developed by Namco and first released in Japan on May 22, 1980. it is considered one of the classics of the medium, virtually synonymous with video games, and an icon of 1980s popular culture. The player controls Pac-Man through a maze, eating pac-dots (also called pellets or just dots). When all pac-dots are eaten, Pac-Man is taken to the next stage. Four enemies (Blinky, Pinky, Inky and Clyde) roam the maze, trying to catch Pac-Man. If an enemy touches Pac-Man, a life is lost and the Pac-Man itself withers and dies. When all lives have been lost, the game ends. Near the corners of the maze are four larger, flashing dots known as power pellets that provide Pac-Man with the temporary ability to eat the enemies. The enemies turn deep blue, reverse direction and usually move more slowly. When an enemy is eaten, its eyes remain and return to the center box where it is regenerated in its normal color. Blue enemies flash white to signal that they are about to become dangerous again and the length of time for which the enemies remain vulnerable varies from one stage to the next, generally becoming shorter as the game progresses.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yrqnzkjoxerct8zs2d15.jpg", "width": 1910, "cloudinary_id": "yrqnzkjoxerct8zs2d15", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/d8wfzd5v0amm26i14tlf.jpg", "width": 1919, "cloudinary_id": "d8wfzd5v0amm26i14tlf", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jtanfcbexsjk9hkvgyzl.jpg", "width": 1919, "cloudinary_id": "jtanfcbexsjk9hkvgyzl", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l0jad3sctdtn5ihhetbb.jpg", "width": 1919, "cloudinary_id": "l0jad3sctdtn5ihhetbb", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/meu7gehvwcynvr5i0hec.jpg", "width": 1919, "cloudinary_id": "meu7gehvwcynvr5i0hec", "height": 1079}], "id": 2750}, {"genres": [14], "name": "NBA Jam", "videos": [{"video_id": "YQRVtXT7xxU", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rnnqyqiy4doz0bm53ytk.jpg", "width": 475, "cloudinary_id": "rnnqyqiy4doz0bm53ytk", "height": 347}, "summary": "NBA Jam is a basketball arcade game published and developed by Midway in 1993. It is the first entry in the NBA Jam series. The main designer and programmer for this game was Mark Turmell. Midway had previously released such sports games as Arch Rivals in 1989, High Impact in 1990, and Super High Impact in 1991. The gameplay of NBA Jam is based on Arch Rivals, another 2-on-2 basketball video game. However, it was the release of NBA Jam that brought mainstream success to the genre.\nThe game became exceptionally popular, and generated a significant amount of money for arcades after its release, creating revenue of $1 billion in quarters. In early 1994, the Amusement & Music Operators Association reported that NBA Jam had become the highest-earning arcade game of all time.\nThe release of NBA Jam gave rise to a new genre of sports games which were based around fast, action-packed gameplay and exaggerated realism, a formula which Midway would also later apply to the sports of football (NFL Blitz), and hockey (2 on 2 Open Ice Challenge).", "storyline": "NBA Jam, which featured 2-on-2 basketball, is one of the first real playable basketball arcade games, and is also one of the first sports games to feature NBA-licensed teams and players, and their real digitized likenesses.\nA key feature of NBA Jam is the exaggerated nature of the play - players jump many times their own height, making slam dunks that defy both human capabilities and the laws of physics. There are no fouls, free throws, or violations except goaltending and 24-second violations. This means the player is able to freely shove or elbow his opponent out of the way. Additionally, if a player makes three baskets in a row, he becomes \"on fire\" and has unlimited turbo and increased shooting precision. The \"on fire\" mode continues until the other team scores, or until the player who is \"on fire\" scores 4 additional consecutive baskets while \"on fire.\"\nThe game is filled with easter eggs, special features and players activated by initials or button/joystick combinations. For example, pressing A five times and right five times on any Genesis controller would activate \"Super Clean Floors\". This feature would cause characters to fall if they ran too fast or changed direction too quickly. And players can enter special codes to unlock hidden players, ranging from US President Bill Clinton to Hugo the Charlotte Hornets mascot. On the arcade machine, there is also a hidden 'tank' game that allows the player to run around a 3D wireframe field. In order to access this mode, however, the player must be able to toggle the on/off switch located behind the machine. While the game was powering back on, the player holds Up and all buttons on player 1 and Down and all buttons on player 2.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/atj4owuxcm4bfbsqiqqc.jpg", "width": 640, "cloudinary_id": "atj4owuxcm4bfbsqiqqc", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xrvkfismfh3aabwakac0.jpg", "width": 609, "cloudinary_id": "xrvkfismfh3aabwakac0", "height": 480}], "id": 8995}, {"genres": [14], "summary": "NHL '95 was EA Sports' third licensed ice hockey game, promising the fastest action in the series to date. The action is viewed top-down, and can be played with or without realistic penalties. There is a full season mode, allowing you to guide a team through all 84 matches, with the option of injuries potentially putting players out of a sequence of matches. You have full control over trading and creating players for your squad. New in-game moves include dummy shots and lie-down blocks.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qn20alz72rghcn9orqsq.jpg", "width": 1482, "cloudinary_id": "qn20alz72rghcn9orqsq", "height": 2100}, "id": 4509, "name": "NHL 95"}, {"genres": [8], "name": "Indiana Jones and the Last Crusade: The Action Game", "videos": [{"video_id": "QRk-rq0bezk", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hwgtppwjunslvkhmqw1d.jpg", "width": 1600, "cloudinary_id": "hwgtppwjunslvkhmqw1d", "height": 2037}, "summary": "A two-fisted action game from the people who brought you the smash hit movie. \n \nThe chase is on...all the way to the greatest treasure in history, the Holy Grail. And if you can survive the treacherous caves of Colorado...the medieval catacombs of Venice...the deadly ramparts of Schloss Brunwald...and the cunning traps of the Grail Temple...then you've earned your whip and your hat! \n \nWhip those bad guys...as only Indy can! Relive the greatest action scenes from the greatest Indy movie of them all. \n \nIt's red hot, slam-bam action, Indiana Jones and LucasFilm style!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kxrsizyzs0lzttdthnln.jpg", "width": 320, "cloudinary_id": "kxrsizyzs0lzttdthnln", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w85bgx6pi38o5hjfggqx.jpg", "width": 288, "cloudinary_id": "w85bgx6pi38o5hjfggqx", "height": 200}], "id": 185}, {"genres": [8, 9], "name": "Mickey's Ultimate Challenge", "videos": [{"video_id": "hhvMj_Fpl7Q", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q0zk8ma6jto0wamrdbgf.jpg", "width": 640, "cloudinary_id": "q0zk8ma6jto0wamrdbgf", "height": 638}, "summary": "Mickey's Ultimate Challenge is a puzzle game for the Super NES, Game Boy, Genesis/Mega Drive, Sega Master System, and Game Gear. The Master System version, released in 1998, was the last game ever released for that console.[3] All other versions were released in 1994. It was rated for all ages, aimed toward younger children, and was designed for only one player. Players move Mickey through the game by making him walk, jump, and go through doors. There are five major challenges, a segue, and a final challenge. It has met with mixed reviews from gaming magazines. It is also the first title developed by WayForward Technologies, under the name Designer Software.", "storyline": "Five Magical Puzzles\nFull Of Family Fun!\n\"The sky is rumbling!\nThe sky is rumbling! What ever can it be?\" cry the citizens of Beanwick.\n\"Is it a storm? Is it a monster? Is it the end of the Kingdom?\" I don't know, but I'll find out, says Mickey, \"if I have to search every room in the Castle of Beanwick to solve the mystery!\"\nIn Mickey's Ultimate Challenge, volunteer as Mickey or Minnie to help the Kingdom of Beanwick solve the mystery of the rumblings in the sky. But, first you must prove worthy of the challenge--by thinking your way through a series of fiendishly clever puzzles, players from 4 to 104 can take full advantage of the game's interactive capabilities to put their critical thinking skills to the ultimate test. Five incredible locations!\nFive brain-teasing challenges starring many of your favorite Disney characters. Solve them all for a chance to see what's really up, up there!\nIs this all a dream? Play Mickey's Ultimate Challenge and decide for yourself!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/p71fyaak8nk0sissesl5.jpg", "width": 480, "cloudinary_id": "p71fyaak8nk0sissesl5", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rbzakn6fppu7wvsbed4t.jpg", "width": 480, "cloudinary_id": "rbzakn6fppu7wvsbed4t", "height": 360}], "id": 18628}, {"genres": [25], "name": "Battletoads In Ragnarock's World", "videos": [{"video_id": "bbOmNTMTG6I", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mynzemvs54f0dntaoehi.jpg", "width": 377, "cloudinary_id": "mynzemvs54f0dntaoehi", "height": 380}, "storyline": "Battletoads is a platform video game developed by Rare and published by Tradewest. It is the first instalment of the Battletoads series and was originally released on 1 June 1991 for the Nintendo Entertainment System. It was subsequently ported to numerous other platforms, including the Mega Drive, Amiga, Game Boy and Game Gear. In the game, two space mutant warriors known as the Battletoads, Rash and Zitz, embark on a mission to defeat the evil Dark Queen on her planet and to rescue their kidnapped friends; Pimple and Princess Angelica.\nThe game was developed in response to the interest in the Teenage Mutant Ninja Turtles franchise. A Master System port of the game was developed but never released. It has received mostly positive reviews upon release, with critics praising the graphics and variations of gameplay, however many critics were divided over the difficulty. It won six awards from the 1991 Nintendo Power Awards, and has since been renowned as one of the most difficult video games ever created. It was later included in Rare's 2015 Xbox One retrospective compilation, Rare Replay.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/szbvi0l5lzook0w4qav0.jpg", "width": 556, "cloudinary_id": "szbvi0l5lzook0w4qav0", "height": 500}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rictsdrxjqlj2ap9epab.jpg", "width": 556, "cloudinary_id": "rictsdrxjqlj2ap9epab", "height": 500}], "id": 18627}, {"genres": [4], "name": "Mortal Kombat 3", "videos": [{"video_id": "ikWeup2QW6I", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ekf2wwvzogrgig5qpxkr.jpg", "width": 488, "cloudinary_id": "ekf2wwvzogrgig5qpxkr", "height": 483}, "summary": "Mortal Kombat 3 (MK3) is a fighting game developed by Midway Games and first released into arcades in 1995 as the third game in the Mortal Kombat series. As in the previous games, it has a cast of characters that players choose from and guide through a series of battles against other opponents. The game avoids the tournament storyline of its predecessors, as various warriors instead fight against the returning Shao Kahn, who has resurrected his bride Sindel and started an invasion of Earthrealm.\nThe third installment of Mortal Kombat retains the blood and gory attacks that defined the series. It introduces new types of the Fatality finishing moves, including Animalities. Other features new to the series were combos, predefined sequences used to perform a series of consecutive attacks. A \"Run\" button was also added, allowing players to briefly dash toward the opponent, as were \"Kombat Kodes\", an unlockable content system using various symbols that can be entered before two-player matches to achieve certain effects.\nSome characters from the previous games returned and new characters were introduced into the series. Mortal Kombat 3 notably omitted popular characters from previous games, some of whom were added in an update, Ultimate Mortal Kombat 3, released later in 1995. The PC and home console-exclusive Mortal Kombat Trilogy (1996) added even more characters, as well as other new features.", "storyline": "Mortal Kombat 3 builds further on the gameplay of the previous game. A \"Run\" button, accompanied by a \"Run\" meter, was introduced. This was primarily to address concern from fans who thought that the previous games gave too much of an advantage to the defending player. The Run meter is drained by running (the character cannot run backwards, only forwards) and by performing combos.\n\"Chain combos\", also known as pre-programmed combos (labeled \"dial-a-combos\") were also introduced. Chain combos are button sequences that cannot be interrupted once one hit connects; some chain combos end with an uppercut or other move that knocks the opponent into the air, so that more damage can be dealt via a traditional juggle combo. To please players of various skill levels, a \"Choose Your Destiny\" screen appears in the single player mode to allow player-selectable difficulty.\nFor the first time, certain levels were interactive by allowing characters to uppercut each other through the ceiling where both characters would continue the battle in a different stage. This could alter the game's level cycle. Both normal uppercuts and uppercuts that are part of a ground combo would result in a level change. Kung Lao's \"Whirl Wind Spin\" move would also have the same effect. However, if the character is defeated by an uppercut, there is no level change.\nAll of the different styles of finishing moves featured in Mortal Kombat II (Fatalities, including the non-lethal Babality and Friendship moves) return in MK3. Additionally, the rumored Animality, where the character transforms into an animal in order to kill their opponent, is featured for the first time. Another new addition is the Mercy, where the character can give their opponent a small sliver of life if they have won two rounds and are at the \"Finish Him/Her\" screen. A Mercy is necessary for an Animality to occur. Finally, three new Stage Fatalities can be performed in the Subway, the Bell Tower and the Pit 3.\nAnother concept introduced in this game is the \"Kombat Kode\". A Kombat Kode is a six-symbol code entered at the VS screen in a two-player game to modify gameplay, fight hidden characters or display certain text messages. Also introduced in this game was the \"Ultimate Kombat Kode\", a 10-character code using symbols, that could be entered on the game over screen after the continue screen disappears in single player mode. It was used to unlock a robotic version of the character Smoke; it can be done by either the player or the arcade operator. The arcade owner could reset this code by accessing the game's diagnostic menu by toggling a DIP switch within the MK3 cabinet. The codes were revealed through gaming magazines, promotional material and other Mortal Kombat media.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/z7xmewnxmqha3ewssav6.jpg", "width": 480, "cloudinary_id": "z7xmewnxmqha3ewssav6", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i7mu9gd0zvij2ldwjw4t.jpg", "width": 400, "cloudinary_id": "i7mu9gd0zvij2ldwjw4t", "height": 300}], "id": 1620}, {"genres": [5, 10, 33], "name": "Chase H.Q.", "videos": [{"video_id": "3-QvpB1cIow", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/e5kf5whqwgdch9zopxt8.jpg", "width": 522, "cloudinary_id": "e5kf5whqwgdch9zopxt8", "height": 640}, "summary": "At the start of each level the player is informed who they are pursuing, a great distance away: They must apprehend the criminal before their time limit expires. The criminal's car is constantly moving away, so if the player repeatedly crashes or drives too slowly, the criminal will escape. At some points during the game the road splits, and the correct turn must be taken, otherwise it will take longer to catch the criminal. When their vehicle is reached, the time limit is extended; the vehicle must be rammed a number of times until the criminal is forced to stop, then is arrested.\n\nThe game includes five levels. As both the initial time limit to reach the criminal and the time extension to ram the criminal are just 60 seconds, the game is very short - a player who is able to finish the game on one credit will enjoy at most ten minutes of game-play.\n\nInterestingly enough when Nancy at Chase HQ (at the start of every level) calls on the radio the frequency is always 144.X (various)Mhz. This is actually the 2-meter band of amateur or ham radio frequencies.\n\nAlthough superficially similar in technology to Sega's Outrun, Chase HQ features significant technical advancements over that title in the presentation of perspective, hills and track splits.", "storyline": "The player assumes the role of a police officer named Tony Gibson, member of the \"Chase Special Investigation Department.\" Along with his partner, Raymond Broady, he must stop fleeing criminals in high-speed pursuits.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ir6drqnaorndfzrhnut3.jpg", "width": 320, "cloudinary_id": "ir6drqnaorndfzrhnut3", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/h0yyoue9vgh54eut3sje.jpg", "width": 256, "cloudinary_id": "h0yyoue9vgh54eut3sje", "height": 224}], "id": 6802}, {"genres": [8], "name": "Cool Spot", "videos": [{"video_id": "0iMM2vqrE08", "name": "Game intro"}, {"video_id": "nsbwXl-EuHw", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lq7ydlvreddtkl8xjpmq.jpg", "width": 220, "cloudinary_id": "lq7ydlvreddtkl8xjpmq", "height": 310}, "summary": "Cool Spot is a mascot for 7 Up, introduced in 1987. During this time, the red spot in the 7 Up logo was anthropomorphized: given arms, legs, a mouth, and sunglasses. British video games developer Virgin Interactive's American studio produced a platform game starring the 7 Up Spot, entitled Cool Spot.", "storyline": "In each level the player must rescue other cool spots, who look exactly alike, from cages at the end of that level, which is not necessarily the point at the far right of the level map. In order to do so, the player is required to collect a certain number of \"spots\" that would change (usually increase) as the game progressed. \"Spots\" were placed across the level in large quantities, and were the game's substitute for items such as the coins in Super Mario Bros", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zntmpoa2eslja0dyqixr.jpg", "width": 800, "cloudinary_id": "zntmpoa2eslja0dyqixr", "height": 700}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vu4kn00wfnzjwbpwvzf7.jpg", "width": 800, "cloudinary_id": "vu4kn00wfnzjwbpwvzf7", "height": 700}], "id": 2621}, {"genres": [5, 15], "name": "Desert Strike: Return to the Gulf", "videos": [{"video_id": "RYVDt8XhTBM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gaw3afg1loubd7laxw1x.jpg", "width": 640, "cloudinary_id": "gaw3afg1loubd7laxw1x", "height": 900}, "summary": "Desert Strike: Return to the Gulf, commonly known as Desert Strike, is a shoot 'em up video game released by Electronic Arts (EA) in February 1992 for Sega's Mega Drive. The game was later released on several other formats such as the SNES, including a much upgraded version for the Amiga home computer. The game was inspired by the Gulf War and depicts a conflict between an insane Middle Eastern dictator, General Kilbaba, and the United States. The player controls a lone Apache helicopter and attempts to destroy enemy weapons and installations, rescue hostages and capture enemy personnel, while managing supplies of fuel and ammunition.", "storyline": "After terrorist leader General Kilbaba has seized control of an unnamed \"small but wealthy\" Gulf emirate, overthrown the monarchy and installed himself as dictator, the United States sends a lone helicopter to destroy his army in a series of swift strikes. The game's plot was felt by commentators to be a thinly disguised reference to the Gulf War, while comparisons were drawn between Kilbaba and Saddam Hussein, and between the game's unnamed desert setting and Iraq", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cxusupfchpxan2wgpkdk.jpg", "width": 320, "cloudinary_id": "cxusupfchpxan2wgpkdk", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p8libh8cr9glunjgqeux.jpg", "width": 320, "cloudinary_id": "p8libh8cr9glunjgqeux", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pxpcx6oxlsk5lpybfebv.jpg", "width": 512, "cloudinary_id": "pxpcx6oxlsk5lpybfebv", "height": 446}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jb57tb30vntxx7id9y7w.jpg", "width": 320, "cloudinary_id": "jb57tb30vntxx7id9y7w", "height": 256}], "id": 6798}, {"genres": [4, 8, 25, 33], "name": "Double Dragon", "videos": [{"video_id": "cy5f9ayBHbM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/brfsdesusepguypwilld.jpg", "width": 625, "cloudinary_id": "brfsdesusepguypwilld", "height": 795}, "summary": "The player character has a repertoire of martial art techniques which they can perform by using the joystick and three action buttons (kick, jump, and punch) individually or in combination. Techniques range from basic punches and kicks, to more elaborate manoeuvres like hair grabbing moves and elbow strikes. When playing with another player, one can assist the other by grabbing their partner's opponent from behind. Caution should be taken, though, as some enemies are able to do the same thing to the players. The player begins the game with a certain number of extra lives and a life gauge which depletes as the player takes hits. If the life gauge runs out or the time limit reaches zero, the player will lose a life.\n\nThere is a small variety of enemy characters that the player will face through the course of the game. Certain enemies carry melee weapons, which can be knocked out of their hands and picked up to use against them. Available weapons include baseball bats, whips, throwing knives, and dynamite; in addition, rocks, oil drums, and boxes can be found in certain places.\n\nThe game is divided into four different stages or \"missions,\" which consist of a city slum, a factory, the woods, and the gang's hideout. The game normally ends if a single player defeats the final boss alone. However, if two players manage to complete the game together, they are then forced to fight each other in order to determine who will win Marian's affections.", "storyline": "The player takes control of martial artist Billy Lee, or his twin brother Jimmy (also known as Hammer and Spike in the supplementary materials for the American arcade release), as they fight their way into the turf of the Black Warriors gang in order to rescue their common love interest Marian.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ftfk5zx4x9v5wf4wjzdy.jpg", "width": 480, "cloudinary_id": "ftfk5zx4x9v5wf4wjzdy", "height": 360}], "id": 6787}, {"genres": [10], "name": "F1", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ugbeixadipjjsto2sdjs.jpg", "width": 630, "cloudinary_id": "ugbeixadipjjsto2sdjs", "height": 814}, "summary": "F1 is an Official Formula One Racing Game. It's also the fastest, most authentic, most thrilling Game Gear racing game yet. Battle it out on the real Formula One Circuits against the real teams and the real drivers of the FIA Formula One World Championship.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/mplcgcyfib0rg3pnlnwz.jpg", "width": 320, "cloudinary_id": "mplcgcyfib0rg3pnlnwz", "height": 256}], "id": 12082}, {"genres": [31, 33], "summary": "Dizzy is an egg living in a world of magic and fantasy. The basic concept of the game is to move around the world, finding various items and collectibles, and to use them in the right locations. Dizzy has no special skills or abilities, save for his remarkable feats of somersaulting, and must solve all problems he faces with the clever use of one or more items.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j1n8fijaxzretihlynjt.jpg", "width": 640, "cloudinary_id": "j1n8fijaxzretihlynjt", "height": 812}, "id": 12089, "name": "Fantastic Dizzy"}, {"genres": [4, 8], "name": "Zool", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eadky4cysuabfhoc4gx4.jpg", "width": 800, "cloudinary_id": "eadky4cysuabfhoc4gx4", "height": 1002}, "summary": "Once every year, the games world is rocked by a game so stunning, so fast, so colorful, so big, so demanding, so mega, so awesome, so varied, so incredible, and so full of fabulous features and unexpected treats, that everybody just looks at it and says \"THAT'S IT!\" This year, Zool, The Ninja From the Nth Dimension, is definitely \"IT!\"", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ndlot8gudrvy4hw2sbcp.jpg", "width": 320, "cloudinary_id": "ndlot8gudrvy4hw2sbcp", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kwhmhgzlcdubvprtbukj.jpg", "width": 320, "cloudinary_id": "kwhmhgzlcdubvprtbukj", "height": 256}], "id": 2547}, {"genres": [4], "summary": "A revolution in combat games - featuring a unique combat intelligence system that adapts to and learns your style of play! The first game with film-quality, controllable 3D graphics. Robot attack routines choreographed by a martial arts expert. Witness the first ever morphing character to appear in a computer game! Awesome cinematic link sequences.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/v2ap1rvqyd0ywlac5gu8.jpg", "width": 2100, "cloudinary_id": "v2ap1rvqyd0ywlac5gu8", "height": 1531}, "id": 4259, "name": "Rise of the Robots"}, {"genres": [10], "name": "Micro Machines", "videos": [{"video_id": "BMpZznee74I", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/acgmkiuatjpwroyxysjz.jpg", "width": 250, "cloudinary_id": "acgmkiuatjpwroyxysjz", "height": 350}, "summary": "Micro Machines is a classic racing game. Simple, fast-paced and lots of fun. You are given the control of miniature cars, choppers, speedboats, racecars, tanks, jeeps, formulas and many more vehicles to choose and about 20 different tracks to drive on. You'll have to race AI opponents or your friends on various locations such as kitchen desks, pool tables, workshops, school desks, gardens, bathtubs etc.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/a6oiltqjardzk9dbebng.jpg", "width": 240, "cloudinary_id": "a6oiltqjardzk9dbebng", "height": 210}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pqaxs9rovgugzy9oq54r.jpg", "width": 257, "cloudinary_id": "pqaxs9rovgugzy9oq54r", "height": 196}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vznsyperp3lhgqsieajz.jpg", "width": 318, "cloudinary_id": "vznsyperp3lhgqsieajz", "height": 159}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/da2uyejdeaq2jfjiupgg.jpg", "width": 259, "cloudinary_id": "da2uyejdeaq2jfjiupgg", "height": 194}], "id": 2703}, {"genres": [10], "name": "Ivan ''Ironman'' Stewart's Super Off Road", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lqq2z4zompqz4raewix9.jpg", "width": 630, "cloudinary_id": "lqq2z4zompqz4raewix9", "height": 767}, "summary": "Compact offroad races. Pick your site and win the world offroad tournament.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/uey9p9lvjurbazcy1am3.jpg", "width": 320, "cloudinary_id": "uey9p9lvjurbazcy1am3", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/homjg2tvbnr8mc7arngy.jpg", "width": 320, "cloudinary_id": "homjg2tvbnr8mc7arngy", "height": 200}], "id": 12735}, {"genres": [5], "summary": "Moving from one room to the next within the studio/arena, players have to shoot down hordes of enemies as they advance from all sides, while at the same time collecting weapons, power-up items, and assorted bonus prizes until a final show down with the show's host where you are finally granted your prizes, your life and freedom. One of the enemies is fat and is named Mr. Shrapnel who roams aside of the walls of some rooms and after a short period of time he explodes. In the NES version, he is replaced by a giant rolling bomb.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/d8gi6iepz0ukld5oxqwk.jpg", "width": 630, "cloudinary_id": "d8gi6iepz0ukld5oxqwk", "height": 803}, "id": 12853, "name": "Smash T.V."}, {"genres": [14], "name": "Winter Olympics: Lillehammer '94", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qgocmgntcw0gkbnfx6ce.jpg", "width": 800, "cloudinary_id": "qgocmgntcw0gkbnfx6ce", "height": 1126}, "summary": "Winter Olympics offers you the ultimate experience in sports simulations. You'll race against the best in the world... and the clock... fighting for gold in a game where you'll face 10 spectacular events testing your speed, skill, strength and endurance to the limit. It's your chance to go for gold in the world's greatest winter sports spectacle!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/exp7zucudf2tdrklqnto.jpg", "width": 320, "cloudinary_id": "exp7zucudf2tdrklqnto", "height": 256}], "id": 4507}, {"genres": [8], "name": "Global Gladiators", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mxkzzxuntu7omi7sqavu.jpg", "width": 256, "cloudinary_id": "mxkzzxuntu7omi7sqavu", "height": 360}, "summary": "Global Gladiators (also known as Mick and Mack: Global Gladiators) is a 1992 platform game by Virgin Interactive, originally programmed by David Perry (who at the time had already moved to the United States and was located on the recently formed Virgin Games USA development studio) for the Mega Drive/Genesis and eventually ported by other Virgin Interactive teams in Europe (with the help of Graftgold and Krisalis Software) to the Sega Master System, Sega Game Gear and the Commodore Amiga. A Super Nintendo port was also in development but was never completed for undisclosed reasons, though a prototype exists on the Internet. The game is loosely based on the McDonald's fast food chain and has a strong environmentalist message. \n \nA Game Boy port of the title was also fully developed (by Damian Stones, of Climax) but was never released for the same legal reasons as the Super Nintendo port. \n \nIn the single-player game, the player controls Mick or Mack through four worlds; Slime World, Mystical Forest, Toxi-town and Arctic World. Each world has several sub-stages where the character must collect a certain number of Golden Arches to advance. \n \nThey are guided in their quest by Ronald McDonald, who appears at the beginning and the end of the game. The characters are armed with a Super Soaker-type gun that shoots gooey projectiles. \n \nThe game engine is the same used in other Virgin Interactive games such as Cool Spot and Disney's Aladdin, as all of them (Mega Drive/Genesis versions) were handled by David Perry's programming team, which eventually turned into Shiny Entertainment.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vyycvnz1ciz972ksdqqy.jpg", "width": 512, "cloudinary_id": "vyycvnz1ciz972ksdqqy", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i6exzai3g6uza32g5dyz.jpg", "width": 512, "cloudinary_id": "i6exzai3g6uza32g5dyz", "height": 448}], "id": 6828}, {"genres": [8], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hdidqbl2vlkysp1b5c6d.jpg", "width": 360, "cloudinary_id": "hdidqbl2vlkysp1b5c6d", "height": 500}, "id": 14207, "name": "The Addams Family"}, {"genres": [8], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nzecgtsjnuonenlgg6vh.jpg", "width": 800, "cloudinary_id": "nzecgtsjnuonenlgg6vh", "height": 1099}, "id": 14340, "name": "Bram Stoker's Dracula"}, {"genres": [14], "name": "PGA Tour Golf", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dnpjmlr852k3wlyvp28b.jpg", "width": 640, "cloudinary_id": "dnpjmlr852k3wlyvp28b", "height": 817}, "summary": "This first game in the series was originally released in 1990 for DOS computers, 1991 for Sega Genesis, Macintosh, SNES, and Commodore Amiga, and 1993 for Sega Master System and Game Gear. It was developed and published by Electronic Arts for DOS and Macintosh, ported to Genesis, SNES, and Game Gear by Sterling Silver Software, to Amiga by Bluesky Innovations, and to Master System by Polygon Games. The Genesis/Mega Drive version features 6 professional golfers as playable or as CPU opponents; Fred Couples, Mark McCumber, Larry Mize, Joey Sindelar, Craig Stadler, Bruce Lietzke.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/whmyi1nljpzg2ud7zq73.jpg", "width": 480, "cloudinary_id": "whmyi1nljpzg2ud7zq73", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ynycrhd3uahr4dkzbo8o.jpg", "width": 320, "cloudinary_id": "ynycrhd3uahr4dkzbo8o", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aincdwgtblyvict4mnov.jpg", "width": 320, "cloudinary_id": "aincdwgtblyvict4mnov", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hn1df9x4fqad53ggvrxo.jpg", "width": 256, "cloudinary_id": "hn1df9x4fqad53ggvrxo", "height": 160}], "id": 12714}, {"genres": [25], "summary": "Last Action Hero is a series of action video games based on the film of the same name. Versions were released for the NES, SNES, Sega Genesis, Game Boy, Sega Game Gear, Amiga and MS-DOS. Versions for the Sega Master System and Sega CD were also announced, but never released.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yepacrqxf5cmemsxjwjc.jpg", "width": 1541, "cloudinary_id": "yepacrqxf5cmemsxjwjc", "height": 1370}, "id": 16139, "name": "Last Action Hero"}, {"genres": [9, 15, 33], "name": "Dr. Robotnik's Mean Bean Machine", "videos": [{"video_id": "a-1b3IA2ujA", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nb8hilglvgl2aadztd0l.jpg", "width": 800, "cloudinary_id": "nb8hilglvgl2aadztd0l", "height": 1119}, "summary": "Dr. Robotnik is changing the jolly folk of Beanville into devious little robots that will help rid Planet Mobius of music and fun forever. Group the beans together to help them escape, and compete against Robotnik’s wily henchbots!", "storyline": "Dr. Robotnik has hatched a plan to ensure that no fun or music remains on Mobius. To do this, he kidnaps the jolly citizens of Beanville and stuffs them into a giant roboticizing machine called the Mean Bean-Steaming Machine to turn them into devious little robot-slaves. Across Beanville, Beans disappear and are sent to the Mean Bean Machine. The player sets off on a daring adventure to defeat Robotnik's minions and stop Robotnik. The game ends after a face-off with Robotnik, in which the Mean Bean Machine is destroyed and the Beans are freed. \n \nRobotnik's nemesis, Sonic the Hedgehog, is never mentioned throughout the game to rescue or help the player.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cjgfkufqxyp5bxnttp9q.jpg", "width": 500, "cloudinary_id": "cjgfkufqxyp5bxnttp9q", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dfsgnqkb5dgwz7yeektn.jpg", "width": 500, "cloudinary_id": "dfsgnqkb5dgwz7yeektn", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rrbdtarhmngvh6js2tlp.jpg", "width": 500, "cloudinary_id": "rrbdtarhmngvh6js2tlp", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hieizzsmtjpf1qr87tkx.jpg", "width": 500, "cloudinary_id": "hieizzsmtjpf1qr87tkx", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jzb5ntrutndx4hlsjrjk.jpg", "width": 500, "cloudinary_id": "jzb5ntrutndx4hlsjrjk", "height": 370}], "id": 4499}, {"genres": [5, 31], "name": "Judge Dredd", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s0ljjre9kx2r0ofnkyuf.jpg", "width": 300, "cloudinary_id": "s0ljjre9kx2r0ofnkyuf", "height": 342}, "summary": "Judge Dredd is an action video game for the Super NES, Sega Genesis/Mega Drive, Game Gear and Game Boy originally released in 1995. The game is loosely based on the 1995 film Judge Dredd, which was a spin off from the Judge Dredd strip from 2000AD.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ferp4fykdr3lk64expdx.jpg", "width": 456, "cloudinary_id": "ferp4fykdr3lk64expdx", "height": 398}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vddcjsgfmzwr4pado0o2.jpg", "width": 640, "cloudinary_id": "vddcjsgfmzwr4pado0o2", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w5uizynw4lltwmkfsrhi.jpg", "width": 480, "cloudinary_id": "w5uizynw4lltwmkfsrhi", "height": 360}], "id": 4387}, {"genres": [8], "summary": "Sorceress Magica De Spell and her rotten ravens have kidnapped Huey, Dewey and Louie! Worse yet, she's snatched Uncle Scrooge's Lucky Dime! Join Donald Duck in his quest to prove that Magica is no match for him.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z9wtki6fqmrk3v7if4n2.jpg", "width": 480, "cloudinary_id": "z9wtki6fqmrk3v7if4n2", "height": 680}, "id": 12910, "name": "The Lucky Dime Caper starring Donald Duck"}, {"genres": [12, 15, 24], "summary": "The continent of Tyramus has lived in peace for almost a century, thanks to the four elemental crystals of the kingdom of Arliel. However, peace is threatened by the invading armies of the Jyn Empire, led by Emperor Grym, who wants to use the four crystals to rule over Tyramus. Fortunately, Princess Iris can escape with one of the crystals and now the player has to protect her and the crystal and somehow find a way to drive back the hordes of Jyn. \n \nGameplay in Crystal Warriors is quite similar to Shining Force. The player fights in turn-based battles controlling different characters like fighters, healers, rangers and mages, all with different strengths and skills. Whenever two units engage in battle, they enter a duel mode lasting for up to two turns. In this mode the player can choose between four commands: \"battle\" (attack), \"retreat\", \"spell\" and \"monster\". While the first three commands are quite self-explanatory, the \"monster\" command is interesting. Whenever a non-human enemy is defeated, it can be tamed and be used in battles. While most monsters do not have many HP they can serve as good attackers for physically weak characters or take some hits in order to protect his master. In-between battles the player can visit towns to rest, buy weapons and spells or recruit new party members.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ggakwvsavchtpi6dvonw.jpg", "width": 653, "cloudinary_id": "ggakwvsavchtpi6dvonw", "height": 908}, "id": 11648, "name": "Crystal Warriors"}, {"genres": [5], "summary": "A sidescrolling shooter in which you fight your way through 5 missions, each with a boss to defeat at the end. Along the way you find Power-Ups to help your odds either by improving your weapon or speed. Three difficulty levels are available (careful: \"Easy\" does not let you reach the very end)", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/m4jijiwyiooyekydazdy.jpg", "width": 190, "cloudinary_id": "m4jijiwyiooyekydazdy", "height": 271}, "id": 18233, "name": "Aerial Assault"}, {"genres": [12], "name": "Wonder Boy III: The Dragon's Trap", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xv5swpbl59r69or78m7l.jpg", "width": 256, "cloudinary_id": "xv5swpbl59r69or78m7l", "height": 355}, "summary": "A direct sequel to Wonder Boy in Monster Land, you wander through the lands using multiple forms that each have different abilities. Each defeated boss unlocks a new form that has to be used to advance to a new area, while shops give you access to new equipment for money.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/i2g8aliycm7wmm6hhw6y.jpg", "width": 600, "cloudinary_id": "i2g8aliycm7wmm6hhw6y", "height": 338}], "id": 18277}, {"genres": [8, 33], "name": "Wonder Boy", "videos": [{"video_id": "mPafvZNUpiQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gomu9gldwucfi5uuyv3t.jpg", "width": 1000, "cloudinary_id": "gomu9gldwucfi5uuyv3t", "height": 1412}, "summary": "Wonder Boy (ワンダーボーイ Wandā Bōi?) is a 1986 platformer video game published by Sega and developed by Escape (now known as Westone Bit Entertainment). \n \nOriginally designed for arcades, it was later ported to the SG-1000, Sega Mark III/Master System and Game Gear video game consoles by Sega, and to the ZX Spectrum, Commodore 64 and Amstrad CPC home computers by Activision. The game is also known as Super Wonder Boy (スーパーワンダーボーイ Sūpā Wandā Bōi?) for its Sega Mark III release in Japan and Revenge of Drancon for its Game Gear release in North America. \n \nIt was the first in the long-running Wonder Boy series of games and was followed up by five sequels, Wonder Boy in Monster Land, Wonder Boy III: Monster Lair, Wonder Boy III: The Dragon's Trap, Wonder Boy in Monster World and Monster World IV. It was also the basis for the Adventure Island series.", "id": 5560}, {"genres": [9, 15], "name": "Columns", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kwuzpbc2pbmh9nyf6pjz.jpg", "width": 1536, "cloudinary_id": "kwuzpbc2pbmh9nyf6pjz", "height": 2100}, "summary": "Go back in time to a bygone civilization: the ancient world of Phoenicia. There you will play a simple and captivating game where sparkling, rainbow-coloured jewels drop one after another. According to the ancient merchants, by arranging three or more of the same jewels horizontally, vertically or diagonally, you shall perform miracles.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cd8mjdfmxweqt7exagem.jpg", "width": 500, "cloudinary_id": "cd8mjdfmxweqt7exagem", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/n8jcw6xrojnanxlrq9nw.jpg", "width": 500, "cloudinary_id": "n8jcw6xrojnanxlrq9nw", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pqii3gimcmeuvyihdx8k.jpg", "width": 500, "cloudinary_id": "pqii3gimcmeuvyihdx8k", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dfjy15r3hdisrsljiatl.jpg", "width": 500, "cloudinary_id": "dfjy15r3hdisrsljiatl", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l81nie6efqvfupppczta.jpg", "width": 500, "cloudinary_id": "l81nie6efqvfupppczta", "height": 370}], "id": 4446}, {"genres": [5, 33], "summary": "Originally titled \"Fantasy Zone Gear: Opa Opa Jr. no Bōken\", this game is technically a sequel to the first Fantasy Zone, but got released under the same name outside of Japan.\n\nLike the other Fantasy Zone titles, this is a side-scrolling shooter where you can fly through the levels in both directions, with a boss fight waiting after you destroyed all \"base\" enemies (they are bigger than the regular enemies and static). Along the way you can upgrade your ship in shops, if you collect enough coins from destroyed enemies.", "id": 18292, "name": "Fantasy Zone"}, {"genres": [33], "name": "Pengo", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rmjwhfd18ramq94cpitl.jpg", "width": 192, "cloudinary_id": "rmjwhfd18ramq94cpitl", "height": 262}, "summary": "The player controls Pengo, a red penguin that resides in the Antarctic. The game takes place in an overhead maze made of ice blocks, where Pengo fights the trolling, blob-like Sno-Bees. The objective of the game is for Pengo to survive a series of rounds by eliminating all Sno-Bees, while amassing bonuses by bringing together the three diamonds dispersed in the maze.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/efqoiu30xothjoiptkyw.jpg", "width": 1026, "cloudinary_id": "efqoiu30xothjoiptkyw", "height": 720}], "id": 12316}, {"genres": [25], "summary": "Use your wits and your razor sharp sword to recapture the Golden Axe from the diabolical Death Adder. Defeat skeletons and giant bats in dark, deep chasms and caves. And summon Earth, Thunder and Fire Magic to fight gargoyles that come to life before your eyes!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/k6l1uug6ku3phousq10t.jpg", "width": 640, "cloudinary_id": "k6l1uug6ku3phousq10t", "height": 907}, "id": 19485, "name": "Ax Battler: A Legend of Golden Axe"}, {"genres": [14, 15], "summary": "Try your hand at the hottest video poker game around! Even seasoned veterans will find Solitaire Poker a welcome challenge!", "id": 19493, "name": "Solitaire Poker"}, {"genres": [14], "summary": "An isometric mini-golf game for 1-2 players", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xe7qg57rj1sghkicseoo.jpg", "width": 495, "cloudinary_id": "xe7qg57rj1sghkicseoo", "height": 700}, "id": 19505, "name": "Putt & Putter"}, {"genres": [5, 33], "summary": "The Halley's Comet is back from outer-space and scientists all over the world are excited by this event. But this time, things do not really go according to plans and an unexpected fleet of alien spaceships appears from behind the comet. Their destination is Earth and Humanity's finest spaceship and pilot is sent to counter the attack.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xgtcfhdqdudeb3wnhupl.jpg", "width": 800, "cloudinary_id": "xgtcfhdqdudeb3wnhupl", "height": 1107}, "id": 19509, "name": "Halley Wars"}, {"genres": [12], "summary": "A roguelike \"dungeon\" crawler that leads you through 30 levels on your quest to find a way to return to your own world.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yalqtb9ajd2rytiy6259.jpg", "width": 256, "cloudinary_id": "yalqtb9ajd2rytiy6259", "height": 363}, "id": 18226, "name": "Dragon Crystal"}, {"genres": [5, 33], "summary": "Vigilante forces have raided government military installations and \"confiscated\" tanks, planes, even warships! Pilot your G-LOC fighter to victory against the guerillas. Only you have the skills to get the job done and save the day!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ppkmhowyrdiuumtk5pto.jpg", "width": 500, "cloudinary_id": "ppkmhowyrdiuumtk5pto", "height": 700}, "id": 4464, "name": "G-Loc Air Battle"}, {"genres": [14], "summary": "Now you have the opportunity to play the same courses that have challenged golf’s greatest legends. WORLD CLASS LEADERBOARD features three famous 18-hole golf courses and each hole authentically reproduces the distance, traps, trees, rough and water hazards of: \n \n-St. Andrews - The Most Revered Course in Golf \n-Doral Country Club - The Florida Blue Monster \n-Cypress Creek - The Largest and the Finest \n \nThe fourth course, designed specifically for “WORLD CLASS” is the “GAUNTLET COUNTRY CLUB”. Only those who have mastered the best courses in the world should expect to come close to par at “THE GAUNTLET”. \n \n“WORLD CLASS” will challenge you with the same strategy and option decisions you face in your real game. And because the look and feel are so life-like, it may improve your actual golf game as well!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bsopk9cc5zfpwvpjdclp.jpg", "width": 800, "cloudinary_id": "bsopk9cc5zfpwvpjdclp", "height": 1028}, "id": 19492, "name": "World Class Leaderboard"}, {"genres": [8, 25], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rzlbrrxgnyez3dz5r8sv.jpg", "width": 800, "cloudinary_id": "rzlbrrxgnyez3dz5r8sv", "height": 918}, "id": 19507, "name": "Ninja Gaiden"}, {"genres": [8, 33], "name": "Shinobi", "videos": [{"video_id": "JjLI4djnBIg", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xceoah1hpqdoz7cdxlco.jpg", "width": 850, "cloudinary_id": "xceoah1hpqdoz7cdxlco", "height": 1204}, "summary": "The five missions in the game are each three or four stages long. Several hostages are being held in each stage; Joe must rescue all of them before he is allowed to finish the stage. The last stage in each mission has no hostages, but instead features a powerful boss character whom Joe must defeat. After completing each of the first four missions the player is taken to a bonus stage, where he can earn an extra life if he is able to kill all of the ninjas leaping towards him. Completing the fifth mission ends the game. Also, once the fifth mission begins, continues are no longer allowed; the player has to finish the game with however many lives he has left at that point. If the player earns a place on the high score board, the number of credits it took him to get that score is displayed along with his score.\n\nJoe's standard weapons are an unlimited supply of shuriken, along with punches and kicks when attacking at close range. One hostage per stage gives him a power-up. When powered-up, his throwing stars are replaced by a gun that fires large, explosive bullets, and his close-range attack becomes a katana slash. Joe can also perform \"ninja magic,\" which may be used only once per stage and kills (or damages, in the case of bosses) all enemies on the screen. The game also allows the enemies to hide behind boxes or use shields to block Musashi's shurikens.[4]\n\nJoe can be killed with one hit, provided he is hit by a projectile or melee attack, but if he does not find himself in those situations, the player can touch regular enemies and just be pushed back without being damaged. Since most enemies appear in the same place on each level, it is possible to master the game by memorizing their locations and devising patterns to defeat them.\n\nAt the end of each stage, the player receives score bonuses based on performance. Completing the stage without using ninja magic or without using any throwing stars or bullets earns the player a point bonus. The player has three minutes to complete each stage; remaining time at the end of the stage is also converted to bonus points and added to the player's score.", "storyline": "The player controls a ninja named Joe Musashi who has to stop a criminal organization called \"Zeed\" who are kidnapping the children of his ninja clan. Through five missions (consisting of three stages for the first mission and four stages each for the rest), Musashi must make his way to Zeed's headquarters and free all the hostages in the first two or three stages before confronting the boss at the final stage of each mission. At the start of each mission, the player is shown their objective, followed by a file containing a photograph of the enemy boss and a map display pinpointing the location of the next stage.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/m1wg2howev33jbdf1fxy.jpg", "width": 400, "cloudinary_id": "m1wg2howev33jbdf1fxy", "height": 240}], "id": 6899}, {"genres": [5, 33], "summary": "The gameplay in Galaga '88 is built on the same premise as that of the original Galaga game, but is in many ways more complex and more difficult. The game is divided into a series of 29 Stages distributed through eight Worlds. The starship Galaga accelerates between Stages and Worlds and even to higher dimensions (go to the section on Dimensional Travel below to find out more). \n \nWith the exception of the third and eighth, each World culminates in a Challenging Stage. There are six such stages to engage in any full game, and each begins with the on-screen announcement \"That's Galactic Dancin'!\" and has its own YM2151-generated song to which the enemy formations dance. In any given Challenging Stage, both the design of the enemies and their dancing formations shall vary according to the player's current Dimension. As in Galaga, the objective is to destroy all forty enemies before they fly away off the screen. However, refraining completely from touching any controls for the duration of a Challenging Stage awards a \"secret bonus\" ranging in value from 10000 to 25000 points, and equal to the \"special bonus\" which would have been awarded for destroying all forty enemy aliens instead. \n \nGalaga '88 introduces a variety of new enemies and behaviors. Most of these special enemies are worth varying amounts of bonus points when destroyed. Some enemies can combine into larger enemies which take multiple hits to destroy, while others arrive in eggs, explode in a shower of fireworks, grow with multiple hits, or sport armor which makes them invincible while in formation. Certain enemies drop small formations of tiny creatures that wiggle their way down the screen, and still others can act as escorts to incoming groups of enemies and then quickly dive at the player before leaving the game. Most stages also include various obstacles which appear once the enemy formation has been assembled. These can be destroyed with either one or several shots, and the first one on each stage will leave a \"Warp Capsule\". \n \nAt the start of the game, the player can select how many Galaga starships to start with (one or two), affecting their number of remaining lives. The game ends after the final boss is defeated (or when the player's last ship is destroyed or captured) - in the latter case, the player can continue the game for an additional credit. The Game Over screen shows the player's hit-miss ratio and a visual representation of their progress. If the player reaches Stage 27, the game also shows a picture of the final boss (damaged if defeated, but silhouetted if not). If the arcade operator has set the \"continue\" option to \"on\", the player also cannot continue if he is defeated on Stages 27-29.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dzvnsugtflvzs4qdintw.jpg", "width": 850, "cloudinary_id": "dzvnsugtflvzs4qdintw", "height": 1193}, "id": 15535, "name": "Galaga '88"}, {"genres": [14], "id": 15241, "name": "Kick Off 2"}, {"genres": [8, 33], "id": 10220, "name": "The G.G. Shinobi II: The Silent Fury"}, {"genres": [9], "summary": "As Slider, you must stop the poisoning of your homeland, Rozen, by the diabolical Scum lords!", "id": 12911, "name": "Slider"}, {"genres": [5], "summary": "Space Invaders is the most famous video game ever! Now SUPER SPACE INVADERS has arrived with a host of amazing new features - wave after wave of weird and hostile aliens, fantastic multiway scrolling playfields, huge end of level mega monsters and secret levels for only the best to find! It'll drive you crazy, but you won't be able to leave it alone!", "id": 12859, "name": "Super Space Invaders"}, {"genres": [5], "summary": "Run… fly… dodge those obstacles, but return fire on wave after wave of attacking aliens. Armed with a really big gun, you have to defend yourself against the alien hordes using your wits to navigate around the screen. But watch out for those end of level bosses! \n \nOriginating in the arcades, Space Harrier is a third-person rail shooter with pseudo-3D graphics, set in the same world as Fantasy Zone. The lone titular hero fights aliens with a fireball-launching cannon, which can also be used to transform the hero into a flying rocket. The protagonist is constantly in motion, but the speed of his movement can be regulated by the player.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jj3psqxcwdq6ea8togkz.jpg", "width": 1401, "cloudinary_id": "jj3psqxcwdq6ea8togkz", "height": 1389}, "id": 12857, "name": "Space Harrier"}, {"genres": [15], "summary": "The Chessmaster is a game where the player has the chance to play against the CPU controlled Chessmaster at a standard game of chess. \n \nTo play the game the player must pick up the chess pieces with there hand cursor and place it in the desired location, within the rules a standard chess game. There are 16 different difficulty levels that includes 2 beginner levels, 13 standard levels (ranging from an average of 5 seconds to 4.5 minutes per shot depending on level), and a infinite level that will keep thinking of a shot until a perfect shot can be made or it is forced to move. There is also a teaching mode that shows the player all the possible moves with the selected piece. Two players can play each other with two controllers and there is also an option of letting the Chessmaster play itself.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hym9edt4nxw59vrvr0xa.jpg", "width": 800, "cloudinary_id": "hym9edt4nxw59vrvr0xa", "height": 1153}, "id": 12909, "name": "The Chessmaster"}, {"genres": [33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dcmwbgvvkzsb0x3i7rrm.jpg", "width": 640, "cloudinary_id": "dcmwbgvvkzsb0x3i7rrm", "height": 910}, "id": 4372, "name": "The Terminator"}, {"genres": [10, 33], "name": "OutRun", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wikclvhxdsrgllhzqhfd.jpg", "width": 850, "cloudinary_id": "wikclvhxdsrgllhzqhfd", "height": 1208}, "summary": "OutRun is a racing game originating in the arcades. The player can race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks. \n \nGameplay is viewed form just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/houuut8un6fxbeq0sjpn.jpg", "width": 1470, "cloudinary_id": "houuut8un6fxbeq0sjpn", "height": 1533}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vrpgdhtz22nhoi4azxvh.jpg", "width": 640, "cloudinary_id": "vrpgdhtz22nhoi4azxvh", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ndzkhuhrkszg9xiyehtt.jpg", "width": 640, "cloudinary_id": "ndzkhuhrkszg9xiyehtt", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wxo06xndkdytt8dftd9y.jpg", "width": 440, "cloudinary_id": "wxo06xndkdytt8dftd9y", "height": 308}], "id": 2051}, {"genres": [14, 33], "summary": "Side Pocket is a pocket billiards video game originally released into arcades by Data East in 1986. The arcade version was eventually ported to six home console platforms and two sequels to the game were produced, as well as a spin-off series called Pocket Gal. G-Mode currently owns the intellectual property rights to the Side Pocket series, and licenses these games globally.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gix5tmkrolablyzhonhu.jpg", "width": 252, "cloudinary_id": "gix5tmkrolablyzhonhu", "height": 346}, "id": 6048, "name": "Side Pocket"}, {"genres": [8], "id": 19537, "name": "Coca Cola Kid"}, {"genres": [8], "summary": "Fully rendered graphics thrust Sonic into an exciting 3D playing environment. An all new gameplay perspective puts you in the middle of Sonic's 3D adventure! The evil genius Robotnik is after the Chaos Emeralds and it's up to Sonic to stop him. Rescue the innocent Flickies before Robotnik turns them into part of his evil plan! \n \nSonic Blast was the last Sonic game for the Game Gear. \nThe game was also ported to the Sega Master System in Brazil by TecToy and released in December 1997, making it the last game ever made for that system. \n \nWhile this game was released at the end of 1996 in conjunction with the similarly named Sonic 3D Blast, it is worth noting that the two games have little in common. No enemies, levels, or bosses, are shared between the games. The story is also completely different. Sonic and Knuckles join together to collect five of a Chaos Emerald's pieces and confront Dr. Robotnik at Silver Castle.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eabk0avvrxtokyfqg2vo.jpg", "width": 250, "cloudinary_id": "eabk0avvrxtokyfqg2vo", "height": 346}, "id": 19538, "name": "Sonic Blast"}, {"genres": [8, 31], "name": "Sonic the Hedgehog 2", "videos": [{"video_id": "8cr1rqVcIhA", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ntf28xepajngtq6q4mvo.jpg", "width": 1521, "cloudinary_id": "ntf28xepajngtq6q4mvo", "height": 2100}, "summary": "Dr. Eggman (aka Dr. Robotnik) has returned, turning helpless animals into robots and forcing them to build his ultimate weapon, the Death Egg! But this time, Sonic has a friend that can help him: Tails! Find the 7 Chaos Emeralds and stop Dr. Robotnik’s evil scheme!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/aeazsmwnemy9caad5jxp.jpg", "width": 1597, "cloudinary_id": "aeazsmwnemy9caad5jxp", "height": 899}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ap6ptovy4koli0unr6nm.jpg", "width": 1597, "cloudinary_id": "ap6ptovy4koli0unr6nm", "height": 897}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yeqzlc8rbbgfmudb3bql.jpg", "width": 1597, "cloudinary_id": "yeqzlc8rbbgfmudb3bql", "height": 897}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ptfgp9sijeqkajwptny2.jpg", "width": 1593, "cloudinary_id": "ptfgp9sijeqkajwptny2", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eqba0h9qaqrt7bu34diz.jpg", "width": 1597, "cloudinary_id": "eqba0h9qaqrt7bu34diz", "height": 897}], "id": 4438}, {"genres": [4], "summary": "Take the Virtua Fighter arcade experience wherever you go! Challenge the world's greatest fighters in the World Fighting Tournament! Crush your opponent with fighting moves straight from Virtua Fighter 2 arcade game!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gitngmjl9garbmp40aa6.jpg", "width": 677, "cloudinary_id": "gitngmjl9garbmp40aa6", "height": 957}, "id": 1548, "name": "Virtua Fighter Animation"}, {"genres": [8], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f8fitdqmpfcpa7kjbmus.jpg", "width": 490, "cloudinary_id": "f8fitdqmpfcpa7kjbmus", "height": 684}, "id": 19556, "name": "Sonic the Hedgehog: Triple Trouble"}, {"genres": [9], "id": 19573, "name": "Sokoban"}, {"genres": [9], "summary": "A 2D top-down arcade game with several minigames", "id": 19662, "name": "Kaitō Saint Tail"}, {"genres": [9], "name": "Baku Baku Animal", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wbik7f10fcchvita8jfy.jpg", "width": 850, "cloudinary_id": "wbik7f10fcchvita8jfy", "height": 1208}, "summary": "The player must line up falling blocks of animals and foodstuffs. When an animal is aligned adjacent to a tile of its favoured food, the animal eats the food. Larger groups of connected food of the same type scores higher when eaten. \n \nWhen animals eat foodstuffs, they also make random blocks fall on the opponent's area, right after the currently falling blocks. The object of the game is to make one's opponent not be able to place more blocks.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kc8djboyu8stvgmqqthb.jpg", "width": 1368, "cloudinary_id": "kc8djboyu8stvgmqqthb", "height": 2328}], "id": 19665}, {"genres": [12], "id": 13904, "name": "Lunar: Sampo-suru Gakuen"}, {"genres": [13], "summary": "A pet simulator, similar to Tamagotchi, where you take care of a small kitten.", "id": 19668, "name": "Neko Daisuki!"}, {"genres": [8], "summary": "BUGS BUNNY has dreamed his way into double trouble. A Mad Scientist is after Bugs' brain! To escape, bugs must use the Scientist's Televisor to travel through dreamland and outwit his LOONEY TUNES pals, including DAFFY DUCK, ELMER FUDD, and YOSEMITE SAM. But Bugs' nightmare doesn't end there. Before he can rest, Bugs must rocket to Mars to battle MARVIN THE MARTIAN and his trusty dog K-9. Move fast or... \"That's all Folks!\"", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xzzx7vgzr6vmqpvi0u5r.jpg", "width": 250, "cloudinary_id": "xzzx7vgzr6vmqpvi0u5r", "height": 349}, "id": 3052, "name": "Bugs Bunny in Double Trouble"}, {"genres": [9], "summary": "Based on the movie of the same name, a mystical circular portal called a \"Stargate\" has been uncovered. In attempting to unlock its secrets, its power is unlocked creating a passageway to a different world named Abydos. A special forces team is sent to the new world to investigate but is soon ambushed and its supplies taken including a powerful nuclear bomb. \n \nAs Colonel O'Neil, a variety of objectives must be met starting with the recovery of supplies and the finding of other teammates, including civilian archaeologist Daniel Jackson. Once regrouped, O'Neil must lead the attack on the god, Ra and escape back to Earth before the power of the nuclear bomb can be unleashed on this new world. \n \nThe game is a side-scroller platform adventure. The player controls O'Neil on a variety of objectives and is armed with a rifle weapon and grenades. Embarking through desert, caverns and nomad towns... eventually to the palace of Ra.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ywdd8lavfcvuntkkw0pq.jpg", "width": 800, "cloudinary_id": "ywdd8lavfcvuntkkw0pq", "height": 700}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pis0amhimlgwlxda8gs7.jpg", "width": 800, "cloudinary_id": "pis0amhimlgwlxda8gs7", "height": 700}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/miqyktztj9iqpvsq7ds1.jpg", "width": 800, "cloudinary_id": "miqyktztj9iqpvsq7ds1", "height": 700}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wrxvi3rf97fqnxfcdwzx.jpg", "width": 800, "cloudinary_id": "wrxvi3rf97fqnxfcdwzx", "height": 700}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f0ynykiubtlfif0rcnwv.jpg", "width": 800, "cloudinary_id": "f0ynykiubtlfif0rcnwv", "height": 700}], "id": 19689, "name": "Stargate"}, {"genres": [9, 33], "summary": "Super Columns is charged with new ways to play and win at this intensely gripping puzzle game. Magic gems can suddenly flip the screen while Bomb gems can blast up to 5 gems at once! Hook up to a friend with your Gear to Gear connection and really test your skills!", "id": 19690, "name": "Super Columns"}, {"genres": [12, 31], "summary": "Sylvan Tale follows the typical action-adventure game formula: The player controls a character who must solve puzzles, fight enemies, and talk to non-player characters in order to acquire special powers and items that will allow him to unlock new areas of the game world and solve the puzzles within. While the player may revisit areas, the game progresses in an essentially linear fashion, as each area can only be accessed if Zetts(the player character) has acquired a specific item or ability from the previous area.", "id": 19691, "name": "Sylvan Tale"}, {"id": 19693, "name": "Predator 2"}, {"genres": [4], "name": "Mortal Kombat", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lbpslq8trfkv2lc0065q.jpg", "width": 698, "cloudinary_id": "lbpslq8trfkv2lc0065q", "height": 886}, "summary": "Mortal Kombat is a 1992 Fighting video game by Midway, originally designed for Arcade systems, but later ported to various home computers and consoles. Mortal Kombat was well received around the world and has spawned countless sequels and spin-offs with it's 22nd title coming up in 2015. Mortal Kombat is the first game in the Mortal Kombat series and was followed by Mortal Kombat II in 1993.", "storyline": "Mortal Kombat follows the story of the Mortal Kombat tournament, a sacred martial arts contest created by the Shaolin Monks, that takes place on a secluded island. Over 500 years ago, the evil sorcerer Shang Tsung overthrew the monks with the help of the monster warrior Goro, and now hosts the contest to steal the souls of the contest's losers to keep himself immortal and powerful. This year's Mortal Kombat tournament is about to take place, and 7 contestants are ready to fight. Liu Kang a noble Shaolin warrior, Scorpion and Sub-Zero, two rival ninja warriors with origins shrouded in secrecy, Johnny Cage a professional martial arts movie star, Raiden the God of Thunder, invited by Shang Tsung personally, Kano a ruthless crime lord, and Sonya Blade a US special forces soldier hunting after Kano.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/suagypvd2jxydgkrsvte.jpg", "width": 320, "cloudinary_id": "suagypvd2jxydgkrsvte", "height": 256}], "id": 1618}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wv2lklly0piypdwok43h.jpg", "width": 640, "cloudinary_id": "wv2lklly0piypdwok43h", "height": 811}, "genres": [33], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vgecqskw8mn923czwfis.jpg", "width": 1919, "cloudinary_id": "vgecqskw8mn923czwfis", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/scqzpzpv6fcmtwmdt0qy.jpg", "width": 1919, "cloudinary_id": "scqzpzpv6fcmtwmdt0qy", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xm6u7ordofvbjo4pst47.jpg", "width": 1919, "cloudinary_id": "xm6u7ordofvbjo4pst47", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cgv0mfhk8fuo8hhadacb.jpg", "width": 1919, "cloudinary_id": "cgv0mfhk8fuo8hhadacb", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x2sk4xjgxrhnxgxtxyly.jpg", "width": 1919, "cloudinary_id": "x2sk4xjgxrhnxgxtxyly", "height": 1079}], "id": 12793, "name": "Terminator 2: Judgment Day"}, {"genres": [5, 33], "summary": "An evil government has trapped you in a futurustic labyrinth! Fight your way through urban mazes in pursuit of hidden keys... the keys to expose the government's corruption.", "id": 19694, "name": "Arena: Maze of Death"}, {"genres": [5, 8, 33], "name": "RoboCop 3", "videos": [{"video_id": "7FILe8utwVU", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sjiyzu3gv74jruqaoubb.jpg", "width": 800, "cloudinary_id": "sjiyzu3gv74jruqaoubb", "height": 1099}, "summary": "RoboCop 3 is a side-scrolling platform shooter. You get missions (such as rescuing your colleagues who are being kept hostages), which are divided into several smaller levels. The levels usually consist of several platforms, and are heavily populated by enemies who shoot at you. You can gather special repair kits, which will be used to restore your health after you've completed a level. \"RoboCop 3\" is more of a shooter than its predecessors, having more and tougher enemies.", "id": 19695}, {"genres": [5], "summary": "\"Virtual Reality\" for your Super NES! \n \nWelcome to the exciting new world of FaceBall 2000, where 3D graphics, first person perspective and 360° maneuverability make you feel like you're inside your video game! What you see is where you are, as you team up, compete with a friend or play alone against computer-controlled opponents. \n \nTransport yourself inside the walls of CyberZone, where you'll be surrounded by menacing enemies lurking in a series of treacherous mazes. Or, enter the Arena where \" Have a Nice Day\" takes on a qhole new meaning in fast-paced rounds of high-tech combat. \n \nWherever you go in FaceBall 2000, it's your chance to wipe the smiles off those annoying happy faces - and maybe a few of your friends - once and for all!", "id": 19701, "name": "Faceball 2000"}, {"genres": [14, 33], "summary": "NBA JAM Tournament Edition brings you more senses-shattering slam dunking excitement than ever! More than twice as many NBA superstars, more than double the secret characters, Hot Spots, Super Jam Power-Ups, battery back-up and - OH MY - nine all-new rim-rattling slam dunks plus all the original jams! NBA JAM Tournament Edition... it's on FIRE!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wdozhhocqiba6bbvbmac.jpg", "width": 800, "cloudinary_id": "wdozhhocqiba6bbvbmac", "height": 1134}, "id": 19712, "name": "NBA Jam Tournament Edition"}, {"genres": [8], "summary": "You are the Phantom, searching for the evil Rebecca Madison in the vast city of Metropia. As head of Maximum, Inc., she will stop at nothing to fulfil her twisted plans to control the world... unless you can overpower her. \n \nVicious bosses and hordes of biots, programmed to destroy you, relentlessly attack of every turn. But you strike back with an arsenal of heavy-duty weapons including a smart gun, inductance rope, homing missile, and many others. Use two weapons at once to double your chances of survival! Then control your destiny as you weave your way through more than 60 incredible levels! \n \nThe danger is staggering. The fate of the city, the eco-system, and all of humanity rests on your abilities. You know what must be done to save Metropia and the world from certain doom.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p51atvpygc58tqdmqkua.jpg", "width": 2100, "cloudinary_id": "p51atvpygc58tqdmqkua", "height": 1548}, "id": 19713, "name": "Phantom 2040"}, {"genres": [8, 9, 31], "summary": "Tails must stop the Battle Fortress bird army from taking control of Tails Island to rule over the animals. \n \nOn land, in the air, and at sea, Tails battles some pretty tough birds! \nDepending on the Japanese and international version of the game, Tails Adventure is either a prequel or continuation of the Sonic the Hedgehog games for the Sega Genesis. The game mixes traditional platforming and role-playing elements, as Tails is using different items and abilities, as well piloting his creations Remote Robot and Sea Fox, to travel across Cocoa Island to liberate it from the Battle Kukku Empire. Like many Sonic games for the Game Gear, Tails Adventure has been ported onto numerous compilation titles and other games as an unlockable game. It later received a re-release on the Nintendo 3DS in 2013.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qn2c8t4hvmbgomdz0duj.jpg", "width": 1000, "cloudinary_id": "qn2c8t4hvmbgomdz0duj", "height": 1380}, "id": 19715, "name": "Tails Adventure"}, {"genres": [4], "id": 19718, "name": "Saban's VR Troopers"}, {"genres": [8, 33], "summary": "Dr. Robotnik has created a world of 3D mazes, into which he has thrown Sonic and added a whole new dimension to his life! Now the Dude with Attitude can spin dash in every direction - collecting keys to access hidden levels and bonus rooms as he never could before. Can you help guide Sonic through the maze and past the all-new clan of evil Bosses to defeat the damnable Doctor? \n \n It is also playable on Sonic Adventure DX: Director's Cut and in the PC, Nintendo 3DS, and on the PlayStation 2 and Xbox editions of Sonic Mega Collection Plus. The game features isometric 3D gameplay similar to Sonic 3D. Sonic and Robotnik are the only characters in this game. \n \nSonic Labyrinth was also released on the Nintendo e-Shop for the Nintendo 3DS's Virtual Console on 28 June 2013.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rwdciwth4k1dljns315b.jpg", "width": 490, "cloudinary_id": "rwdciwth4k1dljns315b", "height": 684}, "id": 19731, "name": "Sonic Labyrinth"}, {"genres": [8], "summary": "Welcome to the colorful world of Garfield and his friends. In this, the first ever 8MB GameGear game, you will see exciting adventures and take part in motion picture escapades which combine action, comedy and lots of attitude. Garfield makes his debut as a TV and video game star in full technicolor glory across hundreds of huge levels, on this, the biggest ever GameGear game!", "id": 19736, "name": "Garfield: Caught in the Act"}, {"genres": [14], "summary": "Before marketing fat-reducing grills, boxing legend George Foreman endorsed this boxing game with a 3rd-person view similar to Punch Out. A full range of punches and jabs are available, with full round-by-round scoring from the judges. You can choose from 3-12 rounds, and there are 2 camera views as well as an automatic switch option. \n \nYou can play simple exhibition matches or tournaments, or launch into a career mode. In this you start at the bottom of the world rankings, and must reach the top by beating the game's players, who other than George are all fictitious boxers with varying strengths and weaknesses. The coach gives advice before each fight to help highlight weaknesses in your play. There are passwords for each round.", "id": 19741, "name": "Foreman for Real"}, {"genres": [4], "name": "Primal Rage", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qh8fd8run6kzetudl7rf.jpg", "width": 850, "cloudinary_id": "qh8fd8run6kzetudl7rf", "height": 1093}, "summary": "A meteor struck the Earth, and caused great chaos. Seven gods from ancient times awoke, and are now attempting to take control of the post-apocalyptic world. \n \nPrimal Rage is a one-on-one fighting game featuring dinosaurs and giant apes as the fighters. The graphics are done with digitized stop-motion animation. Gameplay is similar to Mortal Kombat in that it is viewed from a side perspective, and features deadly finishing moves at the end of the match.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/syumv1xcqtvqow3rr4fb.jpg", "width": 320, "cloudinary_id": "syumv1xcqtvqow3rr4fb", "height": 200}], "id": 4271}, {"genres": [33], "summary": "Wizard Pinball is an Action game, developed by Teque Interactive and published by Domark, which was released in Europe in 1992.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f235j1gvvddgnj0w1a9t.jpg", "width": 715, "cloudinary_id": "f235j1gvvddgnj0w1a9t", "height": 1024}, "id": 19753, "name": "Wizard Pinball"}, {"genres": [7, 8], "summary": "Music can be fun! Tempo, the hip-hoppin' grasshopper. lives in the musical world of planet Rhythmia. It's up to Tempo to save the rhythm and give King Dirge the blues! Tempo boogies, spins, snaps his fingers and slings notes to zap King Dirge’s tune-swiping ants. \n \nMusic is the key! Collect CDs to charge up Tempo's energy. Learn about notes in the bonus round! \n \n5 rockin' stages, each with its own rollin' beat!", "id": 19761, "name": "Tempo Jr."}, {"genres": [8], "summary": "Sylvester's alter ego, the dastardly Dr. Cheesefinger, has \"kidnapped\" the cheese supply and Speedy Gonzales' girlfriend, Carmel. Can this \"speedy-mouse\" outwit the callous cat and rescue the village cheese supply?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zvxyfmwwbbv4mpcor65m.jpg", "width": 640, "cloudinary_id": "zvxyfmwwbbv4mpcor65m", "height": 910}, "id": 4460, "name": "Cheese Cat-Astrophe starring Speedy Gonzales"}, {"genres": [14], "summary": "Pete Sampras Tennis is a Sports game, developed and published by Codemasters, which was released in Europe in 1994.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gxozwtephdccubxnpsop.jpg", "width": 666, "cloudinary_id": "gxozwtephdccubxnpsop", "height": 773}, "id": 4434, "name": "Pete Sampras Tennis"}, {"genres": [14], "summary": "Compete in a super realistic ice hockey game with all the frantic action of Championship Hockey - skilful skating, thundering body checks and rifling slap shots. You'll have to skate well to avoid crunching body checks from defenders and out manoeuvre goalkeepers in your quest for The Cup!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oszv3gpi2rbbnrk1kso1.jpg", "width": 341, "cloudinary_id": "oszv3gpi2rbbnrk1kso1", "height": 468}, "id": 19772, "name": "Championship Hockey"}, {"genres": [14], "summary": "Raw™ slams your senses with 24 megs of the most ruthless mat mayhem ever! The hottest superstars, all new superhumans megamoves and more in-and-out-of-the-ring action stand between you and the championship belt. This Raw™...and RAW IS WAR!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dge0nq1yup9bzhcdzc1o.jpg", "width": 708, "cloudinary_id": "dge0nq1yup9bzhcdzc1o", "height": 1000}, "id": 19771, "name": "WWF Raw"}, {"genres": [8, 33], "name": "James Pond 3: Operation Starfish", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wnox9snehghc9sygcccn.jpg", "width": 1475, "cloudinary_id": "wnox9snehghc9sygcccn", "height": 2100}, "summary": "Unlike the first game of the series, that was a mission-based game, and the second one, where your character had unique abilities such as observing the whole level and growing to unlimited height, James Pond 3 is a standard jump and run platform game. Pond can run very quickly (by holding down the A button) through large levels, which often contain steep mountain sides and other tricky areas. Once again, he has to oppose the evil scientist Maybe and his minions.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nbb00jis6qkrhna4ygkd.jpg", "width": 320, "cloudinary_id": "nbb00jis6qkrhna4ygkd", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mmgbgfakfqbe9imihgor.jpg", "width": 320, "cloudinary_id": "mmgbgfakfqbe9imihgor", "height": 256}], "id": 5926}, {"genres": [10, 14, 33], "summary": "Monster Truck Wars is a Driving game, developed by Gremlin Graphics and published by Acclaim, which was released in 1994.", "id": 19783, "name": "Monster Truck Wars"}, {"genres": [8, 9, 30], "name": "Sonic the Hedgehog: Spinball", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q1nqzyif9gwygk46s6fo.jpg", "width": 800, "cloudinary_id": "q1nqzyif9gwygk46s6fo", "height": 1116}, "summary": "Dr. Eggman (AKA Dr. Robotnik) is once again turning the animals of Mobius into robots using his monstrous contraption, the Veg-O-Fortress. Only Sonic can penetrate the Pinball Defense System to free the animals, retrieve the Chaos Emeralds, and put a stop to Dr. Eggman’s fiendish plans!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gfnr4htilqe2wjxiee0p.jpg", "width": 500, "cloudinary_id": "gfnr4htilqe2wjxiee0p", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kne2ilwqjbvlc0gqyjom.jpg", "width": 500, "cloudinary_id": "kne2ilwqjbvlc0gqyjom", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fgowgszhgnpfgtsqco6z.jpg", "width": 500, "cloudinary_id": "fgowgszhgnpfgtsqco6z", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fotpdmqcex67xcr10kaf.jpg", "width": 500, "cloudinary_id": "fotpdmqcex67xcr10kaf", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yjsoafbfd6nc3b1fusws.jpg", "width": 500, "cloudinary_id": "yjsoafbfd6nc3b1fusws", "height": 370}], "id": 16036}, {"genres": [4, 8], "summary": "A plague AND a deadly double-cross! The Legacy Virus is annihilating mutantkind and the GamesMaster is holding the key. He offers the X-Men a chance to play his game and win the secret...BUT he also offers the same to their arch-enemies with the ADDED satisfaction of destroying the X-Men! The X-Men must split up to find the cure or perish forever.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oyzbpedtzqttagwtusuq.jpg", "width": 2680, "cloudinary_id": "oyzbpedtzqttagwtusuq", "height": 3704}, "id": 19938, "name": "X-Men: Gamesmaster's Legacy"}, {"genres": [9, 15], "summary": "Shanghai II is a Puzzle game, developed and published by SunSoft, which was released in Japan in 1990.", "id": 21549, "name": "Shanghai II"}, {"genres": [33], "summary": "Woody Pop is an Action game, published by Sega, which was released in Japan in 1987.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iz9wcex5yth26xyufhlb.jpg", "width": 800, "cloudinary_id": "iz9wcex5yth26xyufhlb", "height": 1111}, "id": 21551, "name": "Woody Pop"}, {"genres": [8], "name": "Dynamite Headdy", "videos": [{"video_id": "tYn68fFIx1U", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/t74lloptoeq4tnfa1l96.jpg", "width": 256, "cloudinary_id": "t74lloptoeq4tnfa1l96", "height": 351}, "summary": "Dynamite Headdy is a platform game in which the player controls Headdy, a puppet with a detachable head. This head can be fired in eight directions to attack enemies and obstacles, as well as retrieve out of reach items. By grabbing a HangMan, Headdy is able to pull himself up various platforms, or drag certain areas towards him. By finding a walking case named HeadCase, Headdy can gain a special head type depending on the image shown on HeadCase at the time he hits it. These range from offensive heads that increase his strength, allows him to shoot homing stars or suck up everything on screen, to support heads which include invulnerability, shrinking to reach small areas and sleeping to regain health. Most of these heads have a time limit before the head returns to normal, with the player able to cancel at any time, though some heads, such as the Pin Head, disable manual cancellation. The game also features a side-scrolling shooter stage, during which Headdy can change between three unique Head Types.", "storyline": "Headdy, the central protagonist of the game, arrives in North Town to find that the evil puppet King Dark Demon is in the midst of attacking the puppet town to select which of the peaceful toys should live and which should be converted into his evil minions. Headdy is captured and rejected by Dark Demon's forces, and is dropped into the dust cargo to be thrown into the incinerator. However, Headdy escapes the clutches of Dark Demon's minions and sets off to defeat the evil king. \n \nHowever, trouble is afoot. Not only is the puppet world filled with Dark Demon's minions, but to reach the evil overlord's castle, Headdy must defeat Dark Demon's Keymasters who serve as the king's elite guard. To make matters worse, Headdy is followed by Trouble Bruin, a puppet jealous of Headdy's success. Trouble Bruin wants to be the star instead of Headdy, and will stop at nothing to get rid of him.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/w3zujolsfrrgpx5our3o.jpg", "width": 1197, "cloudinary_id": "w3zujolsfrrgpx5our3o", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dcqhxkwqqwzgql9onzjm.jpg", "width": 1191, "cloudinary_id": "dcqhxkwqqwzgql9onzjm", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/n3jovc4medlu3cqcpsrg.jpg", "width": 1191, "cloudinary_id": "n3jovc4medlu3cqcpsrg", "height": 891}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hgqxl89dsjl8cs3ahphk.jpg", "width": 1189, "cloudinary_id": "hgqxl89dsjl8cs3ahphk", "height": 891}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iskgeerrbzruzuhmvhsn.jpg", "width": 1195, "cloudinary_id": "iskgeerrbzruzuhmvhsn", "height": 891}], "id": 22744}, {"genres": [13], "name": "F-15 Strike Eagle", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bdz77ncg6k6olnu3xqkl.jpg", "width": 1000, "cloudinary_id": "bdz77ncg6k6olnu3xqkl", "height": 1402}, "summary": "F-15 Strike Eagle is an F-15 Strike Eagle combat flight simulator first released in 1985 by MicroProse. It is the first in the F-15 Strike Eagle series comprising also the sequels F-15 Strike Eagle II and F-15 Strike Eagle III.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rss75k517uvlzk6yhaxz.jpg", "width": 280, "cloudinary_id": "rss75k517uvlzk6yhaxz", "height": 192}], "id": 12261}, {"genres": [14], "name": "NFL Quarterback Club 96", "videos": [{"video_id": "KNiIenc7ovs", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/om1oktdy5z2hcob4hlll.jpg", "width": 370, "cloudinary_id": "om1oktdy5z2hcob4hlll", "height": 266}, "summary": "This game is the next-gen update of NFL Quarterback Club. \n \nEvery team from the 1996 NFL season is shown here, with real player numbers and stats. 32 offensive plays and 16 defensive plays are available as you play. Options include setting quarter lengths, from one to 15 minutes, and selecting your mode of play: Preseason, Playoffs, or a full Season, in which you play 18 games towards the goal of the Super Bowl.", "id": 25080}, {"genres": [9, 10, 15, 33], "name": "Marble Madness", "videos": [{"video_id": "bTtM0QTKfnc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ryvunixvrbibtedtwl4m.jpg", "width": 1000, "cloudinary_id": "ryvunixvrbibtedtwl4m", "height": 991}, "summary": "Marble Madness is an isometric platform game in which the player manipulates an onscreen marble from a third-person perspective. The player controls the marble's movements with a trackball, though most home versions use game controllers with directional pads. The aim of the game is for the player to complete six maze-like, isometric race courses before a set amount of time expires. When a player completes a race, the remaining time is added to the next race's allotted time. The game also allows two players to compete against each other.\n\nCourses are populated with various objects and enemies designed to obstruct the player. As the game progresses, the courses become increasingly difficult and introduce more enemies and obstacles. Each course has a distinct visual theme. For example, the first race, titled \"Practice\", is a simple course that is much shorter than the others, while the fifth race, named \"Silly\", features polka-dot patterns and is oriented in a direction opposite from the other courses", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hoi8b4t1vbnauuojc1xj.jpg", "width": 320, "cloudinary_id": "hoi8b4t1vbnauuojc1xj", "height": 256}], "id": 2246}, {"genres": [13, 33], "name": "Paperboy", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/y1ad39sesw16yhq8w2zw.jpg", "width": 360, "cloudinary_id": "y1ad39sesw16yhq8w2zw", "height": 500}, "summary": "Paperboy is a 1985 arcade game by Atari Games originally developed in 1984 . The players take the role of a paperboy who delivers newspapers along a suburban street on his bicycle. The game was ported to numerous video game consoles and personal computers. The Nintendo Entertainment System (NES) version represented the first NES game developed in the United States and coincidentally, the Sega Master System version represented the first SMS game developed in the United Kingdom. Paperboy was innovative for its theme and novel controls.\n\n\nGAMEPLAY:\nThe player controls a paperboy on a bicycle delivering newspapers along a suburban street which is displayed in a cabinet perspective (or oblique projection) view. The player attempts to deliver a week of daily newspapers to subscribing customers, attempts to vandalize non-subscribers' homes and must avoid hazards along the street. Subscribers are lost by missing a delivery or damaging a subscriber's house.\n\nThe game begins with a choice of difficulty levels: Easy Street, Middle Road and Hard Way. The object of the game is to perfectly deliver papers to subscribers for an entire week and avoid crashing (which counts as one of the player's lives) before the week ends. The game lasts for seven in-game days, Monday through Sunday.\n\nControlling the paperboy with the handlebar controls, the player attempts to deliver newspapers to subscribers. Each day begins by showing an overview of the street indicating subscribers and non-subscribers. Subscribers and non-subscribers' homes are also easy to discern in the level itself, with subscribers living in brightly colored houses, and non-subscribers living in dark houses.\n\nDelivering the papers\nThe paperboy begins his route at the start of the street (bottom of the screen) and progresses towards the end. The player can control the paperboy's speed, but the paperboy is in constant movement and cannot stop moving forward until the level (day of the week) has ended. Should he slow down or stop for more than a few seconds, a swarm of bees will appear (arcade version only). For each paper that is delivered to a subscriber's mailbox, the player receives 250 points. If the paper is delivered to the subscriber's doorstep, the player receives 100 points. Points are multiplied x2 for playing 'Middle Road', and x3 for playing 'Hard Way'. Points can be gained for breaking plants, running over flowers, or throwing papers into windows of the non-subscriber houses.\n\n\nIn Paperboy, the player attempts to deliver newspapers to subscribers along a suburban street.\nThe primary objectives of the game are to keep as many subscribers as possible and to stay alive. Secondary objectives include vandalizing non-subscribers' homes and hitting nuisances with newspapers.\n\nKeeping subscribers is fairly straightforward: the player must deliver a paper to them. While the player may deliver more than one paper to each customer, they have to avoid accidentally damaging their homes, such as by throwing a paper through a window. Delivering a newspaper directly into the customer's newspaper box (or mailbox, as the voiceover calls it) earns bonus points. Accidentally damaging a customer's home or failing to deliver a paper causes the customer to cancel his subscription and may cause him to set traps for the paperboy the next day. In more advanced rounds, the homeowner may immediately run after the paperboy after the house is damaged.\n\nThe player must stay alive by avoiding obstacles that appear along the street. Some obstacles include everyday nuisances such as fire hydrants, storm drains, break dancers, cars, skateboarders, drunks, kids with radio controlled toys and even rather bizarre foes such as a tornado, oversized house cats, and even the Grim Reaper himself. The player must also cross street intersections successfully (which gets harder each day). Some obstacles can earn the player bonus points. For example, the breakdancer and some men brawling in the street can be \"smacked\" with a newspaper for extra points. Running into any of the obstacles with the bike results in the loss of a life.\n\nThere are two types of collisions possible from running into obstacles, \"%#@*!\" and \"SMACK!\" The former results from hitting obstacles that are integral parts of the landscape, such as fire hydrants, fences, and signposts. The latter collision type comes from obstacles not integral to the landscape: cars, people, dogs and bees.\n\nAlong the way, the paperboy can pick up extra bundles of papers since he can carry only a limited number. These are sometimes located in difficult to reach spots.\n\nA 'Perfect Delivery' is achieved by successfully delivering to all current subscribers. This award doubles bonus points for each house delivered to, as well as reinstating one lost subscriber - up to a maximum of 10 out of the 20 houses being subscribers. If a 'Perfect Delivery' is achieved when the player already has 10 subscribers, double bonus points are still awarded, but no further subscribers are added.\n\n\nTraining course\nPaperboy encountering some obstacles, such as a Big Wheel tricyclist and a construction worker.\nThe end of each level contains a \"training course\", with unique music, which the player can traverse within an allotted time for bonus points. In the training course are various targets to be struck with papers, jumps, water and other hazards. Riding over a jump replenishes the paperboy's stock of papers in addition to earning points. As with the rest of the level, the difficulty of the training course increases over the week, with new hazards added each day. Crashing on the course or running out of time ends the day, but does not result in the loss of a life. Successful completion of the training course rewards the player with a bonus for any remaining time.\n\n\nFinish line bug\nA bug in the game allowed the player to skirt the finish line at the end of the training course and repeat it a second time, with garbage data appearing in the display, garnering huge scores.\n\nRecapping the delivery\nThe next day begins with the neighborhood overview again, highlighting new subscribers and any unsubscribers. A flawless delivery record for the previous day results in a new subscriber. The next day through, the street is harder with more obstacles and faster cars.\n\nThe game concludes with the Sunday delivery. The road is the hardest version of whichever road the player has selected, and the Sunday edition papers are heavier and fly more slowly. Successfully delivering papers on this day ends the game, but with a newspaper headlined \"Paperboy Wins Award For Outstanding Paper Delivery\", complete with a picture of the paperboy holding a trophy.\n\nLosing all lives also ends the game with a headline reading \"Paperboy Calls It Quits.\" Causing all subscribers to cancel their subscriptions by either failing to deliver their paper or vandalizing their houses results in a headline reading \"Paperboy Fired\", along with a digitized voice which states \"You're fired!\"\n\nThe arcade version of the game included a number of voice clips, used both as voiceover commentary at game start (e.g. \"Paperboy... stopping at nothing in his valiant effort to save this land from TV journalism,\") and as the voice of the paperboy himself when tossing a paper into a mailbox (e.g. \"Now you have a friend in the paper business.\") or losing a life (e.g. \"I live a life of danger.\"). Hitting a few particular obstacles could trigger voice clips specific to the obstacle. (For example, a satirical \"Let's see you hang ten!\" when struck by a skateboarder, or when struck by a tricyclist, he replies, \"I hate that kid.\") Voice clips from collisions only result from the \"SMACK!\" kind.\n\n\nPORTS:\nPaperboy was ported to consoles and home computers, starting in 1986. In some of these versions, the player could assume the role of a papergirl instead of a paperboy. Paperboy was ported to the BBC Micro and Acorn Electron (by Andy Williams, 1986), Commodore 64 (by Chris Harvey and Neil A Bate, 1986), Commodore 16 (1986), Amstrad CPC (1986), ZX Spectrum (1986), Apple II (1986), TRS-80 Color Computer (1986), DOS (1988), Apple IIGS (1988), NES/Famicom (1988)(1991, Japan), Game Boy (1990), Game Boy Color (1999), Atari ST (1989), Amiga (1989), Atari Lynx (1990), Sega Master System (1990), Game Gear (1991), and Sega Mega Drive/Genesis (1991)(1992, Japan). The NES version is particularly notable for being the first NES game developed in the United States.\n\nUnlike the arcade version, several of these versions inspired a sequel, Paperboy 2 for several home systems (Amiga, Amstrad CPC, Atari ST, DOS, Game Boy, Game Gear, Sega Genesis, NES, SNES, ZX Spectrum), and a 3D version for the Nintendo 64 called Paperboy 64.\n\nMore recently, Paperboy was included in Midway Arcade Treasures, a compilation of arcade games for the Nintendo GameCube, PlayStation 2, PlayStation Portable, Xbox, and Windows released in 2003.\nA Mobile version of Paperboy was released in 2005.\n\nPaperboy was also released on February 14, 2007 on Xbox Live Arcade for the Xbox 360; however, the game was delisted.\n\nAn iPhone/iPod Touch 25th anniversary version of Paperboy was released December 18, 2009.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/s29dx0vdizqqbw5vpxbl.jpg", "width": 512, "cloudinary_id": "s29dx0vdizqqbw5vpxbl", "height": 384}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hz9edpqsrkywr9ci1b4y.jpg", "width": 512, "cloudinary_id": "hz9edpqsrkywr9ci1b4y", "height": 384}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/idugnjxjvjttyane7bhl.jpg", "width": 1440, "cloudinary_id": "idugnjxjvjttyane7bhl", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pvgwxx6im9gxwopvrtr7.jpg", "width": 640, "cloudinary_id": "pvgwxx6im9gxwopvrtr7", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nsoegta4imoyaeztqif4.jpg", "width": 259, "cloudinary_id": "nsoegta4imoyaeztqif4", "height": 194}], "id": 11762}, {"genres": [5, 33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kgphjj73bg95djm2lpm4.jpg", "width": 1000, "cloudinary_id": "kgphjj73bg95djm2lpm4", "height": 1401}, "id": 26028, "name": "Dropzone"}, {"genres": [10, 14], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iivpnceja8bzif4dikfb.jpg", "width": 640, "cloudinary_id": "iivpnceja8bzif4dikfb", "height": 890}, "id": 27071, "videos": [{"video_id": "o9v-9lGNJQ4", "name": "Gameplay video"}], "name": "Kawasaki Superbikes"}, {"genres": [10], "name": "Ayrton Senna's Super Monaco GP II", "videos": [{"video_id": "MVJVAGiBR7A", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/efvo5ezzbj1uvdgwreki.jpg", "width": 282, "cloudinary_id": "efvo5ezzbj1uvdgwreki", "height": 397}, "summary": "Ayrton Senna's Super Monaco GP II (アイルトン・セナ スーパーモナコＧＰ II) or simply Super Monaco GP II is a racing game developed and published by Sega for the Sega Mega Drive, Sega Master System and Sega Game Gear in 1992. It is a sequel to Super Monaco GP, but this time the game is sponsored by Ayrton Senna (who won the Monaco Grand Prix six times). Also unlike the previous game, Super Monaco GP II was not released in arcades or for any non-Sega console or computer. \n \nAt the time of release it was regarded as the most realistic racing experience on home video game consoles, and the fact that it was endorsed by Ayrton Senna meant the game was very popular. However, due to these celebrity endorsements, it is unlikely Super Monaco GP II will be re-released without cutbacks.", "id": 27077}, {"genres": [8, 33], "summary": "All the Adventure and Excitement of the 16-bit Game -- are you ready to challenge the dark side? \n \nChoose your Rebel warrior: Luke Skywalker, Leia Organa, Han Solo, Chewbacca or Wicket the Ewok. Relive the action of the movie as you rescue Han from Jabba the Hutt, destroy the power generator on the forest moon of Endor, challenge Darth Vader and the evil Emperor and lead the Rebel assault fleet in the final battle to destroy the new Death Star! \n \nThe Force will be with you as you struggle to defeat the Empire once and for all!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/apl3uda8ludtfcwtflij.jpg", "width": 1000, "cloudinary_id": "apl3uda8ludtfcwtflij", "height": 1000}, "id": 48939, "name": "Super Star Wars: Return of the Jedi"}, {"genres": [14], "summary": "Super Kick Off is a football game for the Sega Mega Drive, Sega Master System and Sega Game Gear, released exclusively in Europe and Brazil. It is considered by many to be the watered-down version of Kick Off 2, previously released for the Commodore Amiga (and ported to the Amstrad CPC, Atari ST and Commodore 64). Kick Off 2 was originally programmed by Dino Dini for Anco Games, with the console adaptions being handled by Tiertex. \n \nFrom a franchise perspective, Super Kick Off would be followed by the controversial Kick Off 3: European Challenge. However, Dino Dini, who had no involvement in Kick Off 3 would go on to form his own company and produce the Amiga/IBM PC game Goal!, which shares similar gameplay. Goal! also arrived on the Mega Drive, in the updated form of Dino Dini's Soccer.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/raxjqdhitrk7lnlgrnid.jpg", "width": 1530, "cloudinary_id": "raxjqdhitrk7lnlgrnid", "height": 1370}, "id": 45797, "name": "Super Kick-Off"}, {"genres": [12], "summary": "This is a side-story, set in the same world as the famous Lunar RPGs: Silver Star and Eternal Blue. The town of Burg is populated by harvesters, and you take control of two girls, Ellie and Lena. One day, they are sent to the island of Ien where they should study magic, and there begins their adventure. \n \nThe game is a traditional Japanese-style RPG. You navigate your party through a top-down world, visiting towns and hostile areas. Enemy encounters are random, the battles are turn-based and are viewed from first-person perspective. \n \nWhilst not officially released in English, there is now a completed fan-translation of this game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/uyqr19fijggjkvsnmle5.jpg", "width": 960, "cloudinary_id": "uyqr19fijggjkvsnmle5", "height": 720}], "id": 46354, "name": "Lunar: Sanposuru Gakuen"}, {"genres": [8], "summary": "The Ottifants is a 2D platformer released for the Sega Genesis, Master System and Game Gear in 1993. It was only released in Europe and Brasil. The Ottifant is a creation of German comedian and actor Otto Waalkes. The name is a portmanteau of Waalkes' nickname Otti and the German word for elephant. \n \nGame description: \n \n \"All is not well for Bruno, the baby Ottifant. A father captured by Aliens! Or so our Otti-infant imagines as he follows the trail of sweets that will lead him to his abducted parent. It's a trail of peril and adventure--- terrifying toys, a blood-chilling basement and an office of hi-tech horror.\"", "id": 46355, "name": "The Ottifants"}, {"summary": "Yu Yu Hakusho: Horobishi Mono no Gyakushuu (幽遊白書 － 滅びし者の逆襲) is an action game for the Sega Game Gear. It is based upon the YuYu Hakusho manga and anime series.", "id": 46357, "name": "Yu Yu Hakusho: Horobishi Mono no Gyakushuu"}, {"genres": [12], "summary": "Eternal Legend: Eien no Densetsu (エターナルレジェンド 永遠の伝説?, \"Eternal Legend\")[1] is a Japan-exclusive Game Gear role-playing video game. While the \"Eternal Legend\" name was used in both game packaging and advertising materials, the subtitle \"Eien no Densetsu\" (永遠の伝説) was only used to advertise the game for the Japanese market.", "id": 45794, "name": "Eternal Legend"}, {"genres": [15], "summary": "Zan Gear (斬ギア) is a simulation game for the Sega Game Gear.", "id": 46553, "name": "Zan Gear"}, {"genres": [10], "summary": "In Formula One, your car could reach a blistering 200mph - and it's speed you can feel. And if that's not fast enough for your lead foot, check out our Turbo Mode - kick in the afterburners and scream past the grandstands at a cool 220! Only Formula One by Domark can give you that rush. Strap on your helmet and buckle-up 'cause you're gonna race against the real pros of Formula One World Championship - on 12 international circuits including England's super-fast Silverstone raceway and the world famous Monaco track at Monte Carlo.", "id": 46551, "name": "Formula One"}, {"genres": [10], "summary": "Sonic Drift is a racing game whose gameplay style and controls are heavily based on Sega's arcade game Out Run. Here, the players race around a race course against the other three characters for a top position in the race. The game's single player mode is Chaos GP, where the player's goal is to win three different circuits (green, yellow and red). Each circuit is made of six different race courses that the player is taken through in succession. \n \nEach race course is composed of a circuit which needs to be completed thrice. The playable characters have rather simple controls, their basic actions being accelerating to move forward, breaking, and moving left or right on the tracks. In tight corners, the player can break while turning in a specific direction, allowing them to drift through the corners. If the player overuses this method though, the playable character starts spinning out of control. Should the player move outside the race tracks, the racer's acceleration will decreases noticeably on the rough terrain. The race track's sidelines also have obstacles that will stop the player altogether if the playable characters crash into them. The player can as well collect Rings along the race tracks to perform special moves unique to each character.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/blap4om9mflfnjcgoi9a.jpg", "width": 350, "cloudinary_id": "blap4om9mflfnjcgoi9a", "height": 400}, "id": 45798, "name": "Sonic Drift"}, {"summary": "Yu Yu Hakusho II: Gekitou! Nanakyou no Tatakai (幽遊白書ＩＩ － 激闘！七強の戦い) is an action game for the Sega Game Gear. It is based upon the YuYu Hakusho manga and anime series.", "id": 46552, "name": "Yu Yu Hakusho II: Gekitou! Nanakyou no Tatakai"}, {"summary": "The Berenstain Bears: Camping Adventure is an Action game, developed by Realtime Associates and published by Sega, which was released in 1994.", "id": 46539, "name": "The Berenstain Bears: Camping Adventure"}, {"summary": "Break out your Batarang! When the scum of Gotham City decide they want to take over, it's no joke... Or is it? The Joker and his cohorts kidnap Robin as the perfect bait to lure Batman. You can bet that the Dark Knight is going to be up to his ears \nin hard-hitting combat before this episode is over!", "id": 45203, "name": "Adventures of Batman & Robin"}, {"genres": [4, 14], "summary": "Evander 'Real Deal' Holyfield's Boxing is a Sports game, developed by Novotrade and published by Sega, which was released in 1992.", "id": 46545, "name": "Evander Holyfield's 'Real Deal' Boxing"}, {"genres": [8], "name": "Sonic the Hedgehog Chaos", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eg4vvlrup8ti5mxjgbk6.jpg", "width": 1530, "cloudinary_id": "eg4vvlrup8ti5mxjgbk6", "height": 2100}, "summary": "Dr. Robotnik's stolen the red Chaos Emerald, and it's up to Sonic The Hedgehog to get it back! As Sonic or \"Tails\" the two-tailed fox, you'll zip through the Zones, using your quick moves and quicker thinking to collect rings and evade Robotnik's latest batch of badniks!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pegurjpzckfhinsi7vcu.jpg", "width": 1080, "cloudinary_id": "pegurjpzckfhinsi7vcu", "height": 720}], "id": 43322}, {"genres": [12], "summary": "Shining Force Gaiden: Final Conflict (シャイニング・フォース外伝 FINAL CONFLICT) is an RPG for the Sega Game Gear. It was only released in Japan.", "id": 46359, "name": "Shining Force III: Final Conflict"}, {"genres": [14], "summary": "The Majors: Pro Baseball is a Sports game, developed and published by Sega, which was released in 1992.", "id": 45795, "name": "The Majors Pro Baseball"}, {"genres": [14], "summary": "Step up to the plate with the premiere video game in baseball: World Series Baseball. Saturn technology delivers unbelievable color, 3D graphics and ultra-smooth perspective tracking. Enjoy incredible detail from 5 different ballpark perspectives. Swing for the fences at Fenway or another one of the game's ultra-realistic major league ballparks. Choose among play modes including 162-game pennant race, All-Star and Play-Off modes as well as a power hitter duel in Home Run Derby. Play as any one of the 28 major league teams, complete with high resolution player photos.", "id": 46546, "name": "World Series Baseball"}, {"genres": [10], "summary": "Join the legendary Kawasaki \"Team Green\" racing around the most exhilarating circuits in the world on the ZXR750R in the World 750cc Superbikes Championship. Developed in close association with Kawasaki to ensure total accuracy and realism, Kawasaki Superbikes is the motorboke racing game to leave all others standing.", "id": 46540, "name": "Kawasaki Superbike Challenge"}, {"genres": [10], "summary": "Start your engines and prepare for the race of your life! Choose from 7 of your favorite characters including Sonic, Knuckles and Robotnik, each with his own special powers. Plug in your Gear to Gear connector and take on a friend through over 17 courses in the ultimate Chaos Grand Prix!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/njyeo7fgk5wfivuzia4t.jpg", "width": 350, "cloudinary_id": "njyeo7fgk5wfivuzia4t", "height": 489}, "id": 46358, "name": "Sonic Drift 2"}, {"genres": [8], "summary": "While flying his plane, Tails discovers a small island and lands to investigate. While initially appearing to be uninhabited, he eventually comes upon an old woman. She declares herself to be the great Wendy Witchcart, and claims the island and everything on it as her own, threatening to transform any dissidents into crystal. She then heads off with her henchmen, and Tails, determined to stop her, chases after them. \n \nIt is one of two handheld games on the Game Gear to feature Sonic's sidekick Miles \"Tails\" Prower as the main character. The game follows the adventures of Tails as he tries to save an island from Witchcart, who claims to be able to turn dissenters into crystals with her magic. \n \nIt was originally released on 28 April 1995 as an exclusive game to the Japanese market. However, Tails' Skypatrol later saw an overseas release as it was included as an unlockable minigame in the Nintendo GameCube's Sonic Adventure DX: Director's Cut, and was re-released as one of the featured games in Sonic Gems Collection.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zsk8qtbzmcdn13exu6yz.jpg", "width": 2241, "cloudinary_id": "zsk8qtbzmcdn13exu6yz", "height": 2540}, "id": 45796, "name": "Tails' Skypatrol"}, {"summary": "A prince and princess were in love with each other until a jealous demon turned the happy couple into a set of stone paddles; resembling that of the pinball kind.Suddenly, a ball came into existence that could use the prince and princess in order to defeat the demons that now rule over the kingdom. Players have to use two paddles; the upper one is used to defeat demons while the lower one helps to prevent the player from dropping to its demise at the bottom of the board. By defeating bad guys and smashing through breakable blocks, the player advances towards the boss of each level. \nResembling a harder version of Arkanoid, the vertically scrolling screen forces the ball to move constantly forward in an attempt to reach the boss. \nOnly the Sega Mega Drive version has a two-player option. Players can choose between three difficulty levels in the Game Gear version and can also select an option to do a time trial.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/r8wjbeul866is2mh7obz.jpg", "width": 480, "cloudinary_id": "r8wjbeul866is2mh7obz", "height": 748}], "id": 21546, "name": "Devilish"}, {"genres": [5], "summary": "Griffin (グリフォン) is a shoot-'em-up game developed by Telenet Japan's \"Renovation Game\" division (which is not the same as Renovation Products) and published by Telenet Japan's RIOT division for the Sega Game Gear. It was only released in Japan.", "id": 46356, "name": "Griffin"}, {"genres": [12], "summary": "As the Prince, you must defend the world of Oasis from the dark forces in this challenging real-time role-playing game!", "id": 45793, "name": "Defenders of Oasis"}, {"genres": [15], "summary": "The peaceful kingdom of Cypress has suddenly been disrupted by the corrupt ambition of the evil King Iom. Terror rampages across the land. The Castle of Cypress is invaded and the magical Sword of Hajya is taken! It will take strength, courage, agility and your keen sense of strategy to defy this ominous power.", "id": 46360, "name": "Shining Force II: The Sword of Hajya"}, {"summary": "Greendog is one unlucky surfer. He lost his board and got stuck with a cursed necklace. Greendog has to fight his way past a lot of crazed creatures and monsters to find the Aztec treasure or he'll never get rid of the curse!", "id": 45792, "name": "Greendog: The Beached Surfer Dude!"}, {"genres": [14], "summary": "Batter Up is a Sports game, developed and published by Namco, which was released in Japan in 1991.", "id": 46353, "name": "Batter Up"}, {"summary": "The X-Men face their most brutal adventure ever. Spiral a beautiful 6-armed television producer and denizen of Mojo World pits the X-Men against their all-time toughest foes in the ultimate televised slugfest, \"The Greatest Battles of the X-Men\"! If her scheme works the citizens of Mojo World will tune-in and she will become their new ruler.", "id": 46326, "name": "X-Men: Mojo World"}, {"genres": [8], "summary": "Ronald McDonald in Magical World is an Action game, developed by Sims and published by Sega, which was released in Japan in 1994.", "id": 46544, "name": "Ronald McDonald in Magical World"}, {"summary": "Maddening... \n \nYour sister has been abducted by mutants. But where have they taken her? And why? \nTravel through four fantastic worlds of fire and ice to find her. Call on your basic psychic powers to overcome dangerous monsters and deadly machines. \n \nAlong the way, you’ll pick up ESP skills. Use them to wrench your sister from the clutches of the evil mutants. And use them \nwell. Your life - and your sister’s depend on it! \n \nCan the powers of ESP overcome the powers of Evil?", "id": 46338, "name": "Psychic World"}, {"summary": "Kaitou Saint Tail (怪盗セイント・テール) is an action game for the Sega Game Gear. It is based upon the 1994 Kaitou Sait Tail anime series.", "id": 45273, "name": "Kaitou Saint Tail"}, {"genres": [12], "summary": "Magic Knight Rayearth 2: Making of Magic Knight (魔法騎士レイアース２ ～making of magic knight～) is an RPG for the Sega Game Gear. It is based upon the Magic Knight Rayearth manga and anime series.", "id": 45265, "name": "Magic Knight Rayearth 2: Making of Magic Knight"}, {"genres": [9], "summary": "Tarot no Yakata is a Miscellaneous game, developed by Japan System Supply and published by Sega, which was released in Japan in 1991.", "id": 46313, "name": "House of Tarot"}, {"summary": "Buster Fight is an Action game, developed by Sims and published by Sega, which was released in Japan in 1994.", "id": 46323, "name": "Buster Fight"}, {"genres": [13], "summary": "Pet Club: Inu Dai Suki! is a Strategy game, developed and published by Sega, which was released in Japan in 1996.", "id": 46296, "name": "Pet Club: Inu Dai Suki!"}, {"genres": [14], "summary": "Hyper Pro Yakyuu '92 is a Sports game, developed and published by Sega, which was released in Japan in 1992.", "id": 46297, "name": "Hyper Chou Pro Yakyuu '92"}, {"summary": "Chicago 1920: Corruption and violence have taken hold of the city. Six gangster bosses control the streets. Larcen Tyler must singlehandedly take control of Chicago, or die trying! \n \n-Presenting Larcen Tyler, from Eternal Champions, in his best role ever - from expert gangster to clean-up crusader! \n \n-Use Larcen's full range of weapons, and 60 different fighting moves to fight Chicago's toughest gangsters in six territories of the city! \n \n-Your attack plan depends on what's currently happening in each territory. Stay on top of the syndicates next moves through informants and local events to plan your attack strategically! \n \nNo game will ever be the same!", "id": 46352, "name": "Chicago Syndicate"}, {"genres": [10], "summary": "R.C. Grand Prix is a Driving game, developed by Imagineering Inc and published by Absolute Entertainment, which was released in 1992.", "id": 46336, "name": "R.C. Grand Prix"}, {"genres": [15], "summary": "Poker Face Paul's Poker is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1994.", "id": 46339, "name": "Poker Face Paul's Poker"}, {"genres": [15], "summary": "Poker Face Paul's Gin is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1994.", "id": 46341, "name": "Poker Face Paul's Gin"}, {"genres": [9], "summary": "Puzzle & Action: Ichidant-R (イチダントアール) is the sequel to Puzzle & Action: Tant-R, and like its prequel is an arcade game released for Sega System C arcade hardware. The game later brought to Sega Mega Drive and Sega Game Gear, with the latter being renamed Puzzle & Action: Ichidant-R GG (イチダントア～ルＧＧ). So far the game has never been released outside of Japan (and South Korea). \n \nLike Tant-R, Ichidant-R is a series of timed minigames, represented in the graphical style seen in Bonanza Bros.. Ichidant-R was bundled with Quiz Rouka ni Tattenasai! in Sega Ages Rouka ni Ichidant-R for the Sega Saturn, and it was also bundled with Tant-R as part of volume 6 in the Sega Ages 2500 series for the PlayStation 2. It was also released for the Wii's Virtual Console service in 2007. \n \nOne final game in the Puzzle & Action series, Puzzle & Action: Treasure Hunt was released for Sega Titan Video arcade hardware in 1997.", "id": 46311, "name": "Puzzle & Action: Ichidant-R GG"}, {"genres": [12], "summary": "Madou Monogatari I: 3tsu no Madoukyuu (魔導物語Ｉ ~３つの魔導球~) is a role-playing game for the Sega Game Gear released as part of Compile's Madou Monogatari series, specifically in the first \"1-2-3\" entry. A different version of this game was released on the Mega Drive Madou Monogatari I.", "id": 45268, "name": "Madou Monogatari I: 3tsu no Madoukyuu"}, {"genres": [15], "summary": "Head Buster (ヘッドバスター?, Headbuster) is a Game Gear video game that involves robots fighting in combat sequences. \n \nThe object is to earn more gold by winning matches and spending that money on better weapons like rifles, missile launchers, and flamethrowers. Robots can be traded in for money (gold) if updating them is impossible. At the center of each starting point is a base (circle). Either the base must be destroyed or all the opponent's robots must be destroyed in order to clear the battlefield. There is a certain range to each weapon; opponents cannot be attacked if they are too close or too far away from the weapon's firing range. \n \nThere are ten different maps in the game. Each level has its own password. Players must deliver newspapers for a tiny stipend in order to resume competing after a loss.", "id": 46314, "name": "Head Buster"}, {"summary": "The Berlin Wall is an Action game, developed by Inter State and published by Kaneko, which was released in Japan in 1991.", "id": 46322, "name": "Berlin no Kabe"}, {"summary": "Ninku (忍空) is a Sega Game Gear action game based on the anime series of the same name.", "id": 45256, "name": "Ninku"}, {"genres": [9], "summary": "The Quiz Gear Fight!! is a Miscellaneous game, developed by Minato Giken and published by Sega, which was released in Japan in 1995.", "id": 46601, "name": "The Quiz Gear Fight!!"}, {"genres": [14], "summary": "Ernie Els Golf is a golf game for the Sega Game Gear released exclusively in Europe.", "id": 46351, "name": "Ernie Els Golf"}, {"genres": [14], "summary": "NBA Action starring David Robinson is a Sports game, published by Sega, which was released in 1994.", "id": 46344, "name": "NBA Action starring David Robinson"}, {"genres": [13], "summary": "Star Trek: Generations: Beyond the Nexus is a Simulation game, developed and published by Absolute Entertainment, which was released in 1995.", "id": 46335, "name": "Star Trek: Generations: Beyond the Nexus"}, {"genres": [8], "summary": "The warrior returns with a vengeance in his ultimate fight for freedom! A flash of steel, a blast from his devastating laser Gyro gun - Strider's back in action, pulverizing the enemy and striving for justice. This time, there will be NO LIMITS... NO MERCY... NO SURRENDER!", "id": 46334, "name": "Strider Returns: Journey From Darkness"}, {"genres": [9], "summary": "Kuni Chan no Game Tengoku (クニちゃんのゲーム天国) is a table game for the Sega Game Gear.", "id": 45271, "name": "Kuni Chan no Game Tengoku"}, {"summary": "Doraemon Nora no Suke no Yabou (ドラえもん ノラのすけの野望) is an action game for the Sega Game Gear. It is based upon the 1979 Doraemon anime.", "id": 46316, "name": "Doraemon Nora no Suke no Yabou"}, {"genres": [9], "summary": "Gamble Panic (ぎゃんぶるぱにっく) is a gambling game for the Sega Game Gear.", "id": 46318, "name": "Gamble Panic"}, {"genres": [14], "summary": "Dunk Kids (ダンクキッズ) is a basketball game for the Sega Game Gear. It was only released in Japan.", "id": 46319, "name": "Dunk Kids"}, {"summary": "Doraemon Waku Waku Pocket Paradise (ドラえもん ワクワクポケットパラダイス) is an action game for the Sega Game Gear. It is based upon the 1979 Doraemon anime series.", "id": 46320, "name": "Doraemon Waku Waku Pocket Paradise"}, {"summary": "Crayon Shin-chan: Taiketsu! Kantamu Panic!! (クレヨンしんちゃん 対決！カンタムパニック！！) is an action game for the Sega Game Gear released only in Japan. It is based upon the Crayon Shin-chan anime.", "id": 46321, "name": "Crayon Shin-chan: Taiketsu! Quantum Panic!!"}, {"summary": "Accused of a crime he did not commit - CJ Elephant is imprisoned in a Zoo. Using advanced peanut propelling weaponry, an uncanny ability to find explosive charges and a handy umbrella he promptly escapes. \n \nNow he must flee London, push on to Paris, across the Alps and career through Cairo until he finally makes it home to Africa.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/of91gfcsxrfhrrcuwibf.jpg", "width": 768, "cloudinary_id": "of91gfcsxrfhrrcuwibf", "height": 576}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hjemvflmlahbhzckzhzr.jpg", "width": 768, "cloudinary_id": "hjemvflmlahbhzckzhzr", "height": 576}], "id": 46303, "name": "CJ Elephant Fugitive"}, {"genres": [8], "summary": "Your girlfriend... She's gone! Kidnapped by the notorious King Drancon. \nBut this is no ordinary rescue mission. Because King Drancon is no ordinary adversary. \nEnter the deepest of deep dark forests. And trek across the burning deserts of 10 different lands. Discover supplies that give you speed and strength. Then fend for yourself against nature's nastiest enemies - cobras, piranhas, bats, spiders and finally, King Drancon's lightning-speed fireballs.", "id": 46304, "name": "Revenge of Drancon"}, {"genres": [9], "summary": "Shikinjoh or Shi Kin Joh or Shi-Kin-Joh or Shikinjou (or likewise) (紫禁城) is a 1989/1990 puzzle game by Scap Trust for the NEC PC-88 and NEC PC-98. Sunsoft ported it to the Sega Mega Drive and Sega Game Gear in 1991, with the Mega Drive version having added Sega Mega Modem capabilities. No version has left Japan. A version was later included with Sunsoft's Game no Tetsujin The Shanghai for the Sega Saturn.", "id": 46308, "name": "Shikinjoh"}, {"genres": [13], "summary": "Neko Dai Suki! (ねこ大好き！) is a virtual pet game for the Sega Game Gear.", "id": 45257, "name": "Neko Dai Suki!"}, {"genres": [9], "summary": "Magical Puzzle Popils (マジカルパズル・ポピルズ), known as Popils: The Blockbusting Challenge in Europe, is a puzzle game for the Sega Game Gear.", "id": 45262, "name": "Magical Puzzle Popils"}, {"genres": [15], "summary": "GG Portrait: Pai Chan is a Miscellaneous game, developed and published by Sega, which was released in Japan in 1996.", "id": 46602, "name": "GG Portrait: Pai Chan"}, {"genres": [4], "summary": "Street Hero is a Streets of Rage style side scrolling beat-em-up, offering plenty of action for Sega's handheld. Although the Sega Master System version of the game saw release in Korea, it is one considerable rarity that very few have actually seen. This fact is only strengthened by the knowledge that until February 2012, no ROM of the game existed online in any form. A real shame given the high level of quality of gameplay which has come from the usually disappointing array of 8-bit Korean developers.", "id": 46300, "name": "Street Hero"}, {"summary": "Three complete games starring game superstar Dizzy! Enjoy the thrill of an arcade action game, a puzzle game and a complete adventure game all in one pack! \n \n1. Dizzy the Adventurer - Adventure Game \nHere's Dizzy - in an amazing magical quest packed with action, mystery, surprises and lots of new interesting characters. Escape from an underground cave and wake Daisy from the endless sleep caused by pricking her finger on a cursed spinning wheel! The spell can only be broken by a kiss from a Prince! A great sense of humour and brilliant fun! A superbly crafted cartoon adventure set in a magical kingdom! \nBrilliant graphics, music and a magical quality that will enchant players. \n\"A magical quest to wake Daisy from her endless sleep\" \n \n2. Panic Dizzy - Puzzle Game \nIt's puzzling, challenging and mega playable! Play any of the Yolfolk and challenge friends to a choice of 3 brilliant, original puzzle games. There's shape shifter, dizzy dice and picture puzzler to boggle your mind and blow your brain. Push and shoot the descending shapes in a race against time! Fantastic fun! \n\"Put your brain & reflexes in to top gear for 3 original puzzle games!\" \n \n3. Go Dizzy Go! - Action Game \nIt's Dizzy and Daisy to the rescue in this zany arcade challenge. Zaks' treacherous worlds are jam packed with all sorts of nasties. Power-Ups and Special secrets! Take up the challenge in single mode or two player mode. \nClassic maze style game with 5 worlds each containing 5 levels. Superb graphics, funky music and exciting gameplay! \n\"Dash around weird and wonderful worlds to free the yolkfolk!\"", "id": 46350, "name": "The Excellent Dizzy Collection"}, {"summary": "So you tthought footballs were for playing with... think again! Embark on rollercoaster journey in this platform adventure through eerie mining towns, terrifying, deadly forests and infested jungles. All this to search the stadium - and your only weapon - a football!", "id": 46347, "name": "Hurricanes"}, {"genres": [14], "summary": "J. League Soccer Dream Eleven (Ｊリーグサッカードリームイレブン) is a football game for the Sega Game Gear.", "id": 45274, "name": "J. League Soccer Dream Eleven"}, {"genres": [9], "summary": "Kinetic Connection (キネティック コネクション) is a Sega Game Gear puzzle game released only in Japan. It appears to be part of a series of games by Sadato Taneda but the relationship is unknown. In the game, you must reconstruct a scrambled video loop by swapping and rotating tiles. \n \nThe game has numerous cameos from Opa-Opa of Fantasy Zone fame.", "id": 45272, "name": "Kinetic Connection"}, {"genres": [12], "summary": "Madou Monogatari A: Doki Doki Vacation (魔導物語Ａ － ドキドキばけ～しょん) is a Sega Game Gear RPG released as part of Compile's Madou Monogatari series.", "id": 45269, "name": "Madou Monogatari A: Doki Doki Vacation"}, {"genres": [12], "summary": "Madou Monogatari III: Kyuukyoku Joou-sama (魔導物語ＩＩＩ ~究極女王様~) is a Sega Game Gear sequel to Madou Monogatari II: Arle 16-Sai.", "id": 45266, "name": "Madou Monogatari III: Kyuukyoku Joou-Sama"}, {"summary": "Ninkuu Gaiden: Hiroyuki Daikatsugeki (忍空外伝 － ヒロユキ大活劇) is a Sega Game Gear top-down action game based on the Ninkuu franchise.", "id": 45254, "name": "Ninku Gaiden: Hiroyuki Daikatsugeki"}, {"genres": [14], "summary": "Fred Couples Golf is a Sports game, developed by Sims and published by Sega, which was released in 1994.", "id": 46349, "name": "Fred Couples Golf"}, {"summary": "Sneak into the factories owned by a vicious tycoon and get the quality products to the people who rightfully deserve them!", "id": 46348, "name": "Factory Panic"}, {"genres": [14], "summary": "Never before has a baseball game been created that captures the details of the sport like MLBPA Baseball. Realistic run-downs, accurate cut-off plays, the double switch, multiple defensive alignments, snap throws, even bad hops and booted balls. Throw in every player from Alamar to Zeile and you've got the only baseball game worth playing for the Super NES.", "id": 46345, "name": "MLBPA Baseball"}, {"summary": "VR Troopers is an Action game, developed by Syrox Developments and published by Sega, which was released in 1995.", "id": 46332, "name": "VR Troopers"}, {"genres": [15], "summary": "Poker Face Paul's Solitaire is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1994.", "id": 46340, "name": "Poker Face Paul's Solitaire"}, {"genres": [15], "summary": "SD Gundam Winner's History (ＳＤガンダム ウィナーズ ヒストリー) is a Sega Game Gear game based on the Gundam series.", "id": 46309, "name": "SD Gundam Winner's History"}, {"genres": [9], "summary": "Nazo Puyo (なぞぷよ) is a 1993 game for the Sega Game Gear by Compile spinning off Puyo Puyo. It was released exclusively in bundles with specially marked Game Gears in Japan (hence its price tag) and would go on to receive two sequels on the Game Gear (the latter receiving two sequels on the Super Nintendo Entertainment System) and many PC-98 games (one retail, the others as part of the DiscStation series) and would be retooled as the Puzzle Mode of the 8-bit version of Dr. Robotnik's Mean Bean Machine.", "id": 45260, "name": "Nazo Puyo"}, {"genres": [12], "summary": "Megami Tensei Gaiden: Last Bible Special (女神転生外伝 ラストバイブル スペシャル) is an RPG for the Sega Game Gear.", "id": 45263, "name": "Megami Tensei Gaiden: Last Bible Special"}, {"genres": [14], "summary": "Taisen Mahjong Haopai is a Miscellaneous game, developed by Arc System Works and published by Sega, which was released in Japan in 1990.", "id": 46295, "name": "Taisen Mahjong Haopai"}, {"genres": [15], "summary": "Daisenryaku G is a Strategy game, developed and published by SystemSoft, which was released in Japan in 1991.", "id": 46293, "name": "Daisenryaku G"}, {"genres": [8], "summary": "The sinister Dr. Maybe is back and only our slickest Special Agent, James Pond, can stop him. Special Agent Finnius Frog can help you get to those hard to reach places with his powerful jumping abilities. Explore more than 100 levels of outrageous fun! Win using an ocean of FI5H gadgets: suction boots, the fruit gun, X-ray specs, a thruster unit, spring boots and a clever fruit suit disguise. Use a special FI5H rocket pack to defeat Dr. Maybe! Fry over 40 different enemies under Dr. Maybe's control and avoid Maybe's mounted guns and missile launchers!", "id": 46346, "name": "James Pond 3: Operation Starfi5h"}, {"genres": [14], "summary": "Super Golf is a Sports game, published by Sigma Ent. Inc., which was released in Japan in 1991.", "id": 46333, "name": "Super Golf"}, {"genres": [14], "summary": "Choose from three of the world's most challenging courses. Like St. Andrews, the most revered course in golf and Doral Country Club, Florida's \"Blue Monster.\" Or play Cypress Creek, the largest and finest in Texas.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hb1yajgltbhwcf8befec.jpg", "width": 867, "cloudinary_id": "hb1yajgltbhwcf8befec", "height": 1200}, "id": 46328, "name": "World Class Leaderboard Golf"}, {"genres": [14], "summary": "The game has an unusual naming scheme. In Japan there were no issues, as the game was published by SIMS themselves. In North America and PAL regions however, publishing rights were given to Tengen, who altered many of the in-game banners and renamed the game Tengen World Cup Soccer, even though the majority of the work was done by SIMS. \n \nThe game offers 24 different national teams from across the world, although the choices aren't based on any official tournament from the era. For 1993 the list is quite out of date; the Federal Republic of Germany (more commonly known as West Germany) had not existed since 1990 after the fall of the Berlin Wall, Russia is represented with the flag of the Soviet Union which dissolved in late 1991, and Yugoslavia had ceased to exist by mid-1992.", "id": 46329, "name": "Tengen World Cup Soccer"}, {"genres": [14], "summary": "Scratch Golf is a Sports game, developed by Electronics Application and published by Vic Tokai, which was released in Japan in 1994.", "id": 46542, "name": "Scratch Golf"}, {"summary": "Power Strike II is an Action game, developed by Compile and published by Sega, which was released in Europe in 1994.", "id": 46337, "name": "Power Strike II"}, {"genres": [12], "summary": "Madou Monogatari II: Arle 16-Sai (魔導物語ＩＩ ~アルル１６才~) is a Sega Game Gear sequel to Madou Monogatari I: 3tsu no Madoukyuu.", "id": 45267, "name": "Madou Monogatari II: Arle 16-Sai"}, {"genres": [5], "summary": "GG Aleste (ＧＧアレスタ) is a game in Compile's Aleste series of shoot-'em-ups for the Sega Game Gear. It was only released in Japan and is one of the few Compile Game Gear games published by Compile rather than Sega.", "id": 46317, "name": "GG Aleste"}, {"genres": [8], "summary": "Cokey must hit the streets and take on Team Evil who just went and kidnapped his teacher, Ms. Sakurako. Skate through the city and be brave!", "id": 46325, "name": "Sassou Shounen Eiyuuden: Coca Cola Kid"}, {"summary": "Ninku 2: Tenkuryu-e no Michi (忍空２ ～天空龍への道～) is a Sega Game Gear sequel to Ninku.", "id": 45255, "name": "Ninku 2: Tenkuuryuu e no Michi"}, {"genres": [12], "summary": "Moldorian is a Role-Playing game, published by Sega, which was released in Japan in 1994.", "id": 45261, "name": "Moldorian: Hikari to Yami no Shisutaa"}, {"genres": [14], "summary": "The Pro Yakyuu '91 is a Sports game, developed and published by Sega, which was released in Japan in 1991.", "id": 46527, "name": "The Pro Yakyuu '91"}, {"genres": [15], "summary": "Pet Club: Inu Dai Suki! is a Strategy game, developed and published by Sega, which was released in Japan in 1996.", "id": 46604, "name": "Inu Dai Suki!"}, {"summary": "Enno Ozuno, Master of the Enno temple used the demon guardian spirit Zenki to defeat the demon goddess Karuma. After defeating Karuma, he later sealed Zenki away in a pillar until needed again. \n \nCenturies later, his descendant, a school girl named Chiaki Enno is able to free Zenki, although the demon currently has the form of a brattish demon child. To transform this extremely defiant demon into the form that made him useful by her ancestor, she uses a bracelet that appeared on her wrist when servants of Karuma broke the seal that imprisoned a seed of Karuma. Zenki appears because the seeds of Karuma start appearing and turning people into monsters and Zenki needed again to eradicate this menace", "id": 46692, "name": "Kishin Douji Zenki"}, {"genres": [14], "summary": "PGA Tour Golf II is a Sports game, developed by Polygon Games and published by Time Warner Interactive, which was released in 1995", "id": 46343, "name": "PGA Tour Golf II"}, {"summary": "Sports Trivia is a Miscellaneous game, developed by Adrenalin Entertainment and published by Sega, which was released in 1995.", "id": 46541, "name": "Sports Trivia: Championship Edition"}, {"genres": [4], "summary": "WWF Wrestlemania: Steel Cage Challenge is a Sports game, developed by Teeny Weeny Games and published by Flying Edge, which was released in 1993.", "id": 46331, "name": "WWF Wrestlemania: Steel Cage Challenge"}, {"genres": [14], "summary": "700 MAJOR LEAGUE PLAYERS \nINCLUDING SANDERS, BONDS, BELLE, GWYNN, BAGWELL, PIAZZA, MCGRIFF, AND PUCKETT. \n \n-Improved sound effects, music, and announcers put you in the ballpark. \n-32 bit technology allows for a gradual zoom to the outfield, for better views of players making diving catches, and climbing the walls to rob home runs. \n-The power of 32X allows for enhanced colors of all stadiums and logos. \n-Put together the greatest team in history with 50 all time great Legend players. \n-Multi-player option allows you and your friends to battle it out! \n-Mid-season All-Star game with your season's best players. \n-Track stats for individuals, teams and league leaders. \n-Play in Exhibition, Full Season, and Playoff modes plus 2 Home Run Derby Modes. \n-Draft and Trade players to create your own dream squad.", "id": 46327, "name": "World Series Baseball '95"}, {"genres": [9], "summary": "Kuni Chan no Game Tengoku Part 2 (クニちゃんのゲーム天国ＰＡＲＴ２) is a table game for the Sega Game Gear and sequel to Kuni Chan no Game Tengoku.", "id": 45270, "name": "Kuni Chan no Game Tengoku Part 2"}, {"genres": [14], "summary": "Gear Stadium Heiseiban (ギアスタジアム 平成版) is a baseball game for the Sega Game Gear. It is an updated version of Gear Stadium with a Nippon Professional Baseball license and the names of real NPB players.", "id": 46605, "name": "Gear Stadium Heiseiban"}, {"summary": "A Japanese derby stallion racing game/betting simulator for the Game Gear handheld.", "id": 46305, "name": "World Derby"}, {"summary": "Tama & Friends: 3 Choume Kouen Tamalympic (タマ＆フレンズ ３丁目公園 タマリンピック) is an action game for the Sega Game Gear. It is based upon the 1994 Tama and Friends anime series.", "id": 46306, "name": "Tama & Friends: 3 Choume Kouen Tamalympic"}, {"genres": [12], "summary": "Shining Force Gaiden: Ensei Jashin no Kuni e (シャイニング・フォース外伝 ～遠征・邪神の国へ～) is a Sega Game Gear entry in the Shining series of games.", "id": 46307, "name": "Shining Force Gaiden: Ensei Jashin no Kuni e"}, {"genres": [12], "summary": "Royal Stone: Hirakareshi Toki no Tobira (ロイアル・ストーン ～開かれし時の扉～) is an RPG for the Sega Game Gear.", "id": 46310, "name": "Royal Stone: Hirakareshi Toki no Tobira"}, {"genres": [14], "summary": "He's Popeye the Sailor, but he's not out at sea this time. Popeye and his friends have decided to take a break and enjoy the beach, but Brutus wants the attention of Olivia, and challenges Popeye to a game of Volleyball!", "id": 45250, "name": "Popeye Beach Volleyball"}, {"genres": [5], "summary": "Pop Breaker (ポップブレイカー) is a shoot-'em-up game for the Sega Game Gear. It was only released in Japan.", "id": 45251, "name": "Pop Breaker"}, {"genres": [12], "summary": "Phantasy Star Gaiden (ファンタシースター外伝) is a Sega Game Gear released as part of the Phantasy Star franchise. It was only released in Japan.", "id": 45252, "name": "Phantasy Star Gaiden"}, {"genres": [12], "summary": "Megami Tensei Gaiden: Last Bible (女神転生外伝 ラストバイブル) is an RPG for the Sega Game Gear. It was followed by Megami Tensei Gaiden: Last Bible Special.", "id": 45264, "name": "Megami Tensei Gaiden: Last Bible"}, {"genres": [14], "summary": "Taisen Mahjong Haopai 2 is a Miscellaneous game, developed by Arc System Works and published by Sega, which was released in Japan in 1993.", "id": 46294, "name": "Taisen Mahjong Haopai 2"}, {"summary": "Puzzle & Action: Tant-R is a Miscellaneous game, developed by CRI and published by Sega, which was released in Japan in 1994.", "id": 46292, "name": "Puzzle & Action: Tant-R GG"}, {"genres": [15], "summary": "Now you can play your favorite TV Game Show on the go anytime! Press the button, hear the theme music; spin the wheel and win a fortune; hit bankrupt and lose it all. You get everything you see on TV - great graphics and animation, a colorful spinning wheel, and our very own blonde hostess to turn the letters. Even the music is authentic. There are dozens and dozens of challenging puzzles to keep you guessing, and if you're stuck you can always buy a vowel. Get set to spin... it's time to play WHEEL OF FORTUNE!", "id": 46330, "name": "Wheel of Fortune: Featuring Vanna White"}, {"genres": [8], "summary": "You've really been dropped in the deep end this time. The Steam Ship is on a oneway trip to the seabed after a collision with an iceberg. It's jam packed with panic stricken passengers waiting for their hero, Kevin, to come to the rescue. Playing the part of Kevin, you have to guide the Passengers through some of the worst hazards encountered in modern games playing before the compartments become flooded and time runs out.", "id": 46543, "name": "Man Overboard! S.S. Lucifer"}, {"genres": [15], "summary": "Poker Face Paul's Blackjack is a Miscellaneous game, developed by Spidersoft and published by Adrenalin Interactive, which was released in 1993.", "id": 46342, "name": "Poker Face Paul's Blackjack"}, {"summary": "Hyokkori Hyoutanjima: Hyoutanjima no Daikoukai (ひょっこりひょうたん島 ひょうたん島の大航海) is a 1992 action game by Sega for the Sega Game Gear tying into the Hyokkori Hyoutanjima Japanese puppet show.", "id": 46312, "name": "Hyokkori Hyoutanjima: Hyoutanjima no Daikoukai"}, {"genres": [15], "summary": "Godzilla: Kaijuu no Daishingeki is a turn based strategy game, with some arcade elements. A player can play as Godzilla or similar monsters (kaiju), like Anguirus, and Fire Rodan. Should players want to support humanity they can play as the G-Force, a human defense force. Humans have monster killing tools such as, tanks, artillery and planes. Some monsters are unplayable enemies and both sides will have the chance to fight against them. \n \nOn the map, the game is a typical war strategy. The player can move units on the map, and attack enemies. Battles have their own screen and animations. The fighting is quite arcade-like and simple, functioning similarly to fighting games. When all units have used their actions points a turn ends. \n \nGodzilla: Kaijuu no Daishingeki has four maps, and an extra secret level.", "id": 46315, "name": "Godzilla: Kaijuu no Daishingeki"}, {"summary": "Buster Ball is an Action game, published by Riverhillsoft, which was released in Japan in 1992.", "id": 46324, "name": "Buster Ball"}, {"genres": [31], "summary": "Phantasy Star Adventure (ファンタシースターアドベンチャー) is a Sega Game Gear released as part of the Phantasy Star franchise. It was only released in Japan.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lu1abs5kowa2cs5vuicc.jpg", "width": 886, "cloudinary_id": "lu1abs5kowa2cs5vuicc", "height": 1024}, "id": 45253, "name": "Phantasy Star Adventure"}, {"genres": [9], "summary": "Nazo Puyo Arle no Roux (なぞぷよ アルルのルー; also mistakenly referred to as transliterations Nazo Puyo: Aruru no ruuu and Nazo Puyo: Aruru no Ru) is a puzzle game developed by Compile for the Sega Game Gear and released exclusively in Japan in 1994. Despite being the third game in the Nazo Puyo subseries, it is drastically different from its prequels, taking a combined RPG/puzzle approach to its (now existent) storyline. It would receive two sequels, both on the Super Nintendo Entertainment System (Super Nazo Puyo Rulue no Roux, combining a retooled version of this game with a new story mode focusing on Rulue, and Super Nazo Puyo Tsu: Rulue no Tetsuwan Hanjouki, a new game focusing exclusively on Rulue).", "id": 45258, "name": "Nazo Puyo Arle no Roux"}, {"genres": [9], "summary": "Nazo Puyo 2 is a Puzzle game, developed by Compile and published by Sega, which was released in Japan in 1993.", "id": 45259, "name": "Nazu Puyo 2"}, {"genres": [13], "summary": "GG Portrait: Akira Yuki is a Miscellaneous game, developed and published by Sega, which was released in Japan in 1996.", "id": 46528, "name": "GG Portrait: Akira Yuki"}, {"summary": "Torarete Tamaruka!? is an Action game, developed and published by Sega, which was released in Japan in 1994.", "id": 46291, "name": "Torarete Tamaruka!?"}, {"genres": [14], "summary": "Pocket Jansou is a Miscellaneous game, developed and published by Namco, which was released in Japan in 1992.", "id": 46603, "name": "Pocket Jansou"}, {"genres": [8], "summary": "Yogi Bear has to save Jellystone National Park from an evil ghost named Jake; who stole the funds needed to keep the park operating. There are six different stages in the game that range from a large city to the Wild West. There are no-powerups in the traditional sense; players must collect 100 picnic baskets for an extra life. Hidden doors and areas must be found in order to crack open the safes. Once inside a safe, Yogi must collect 25 gold coins to make a bar. In order to unlock the best ending, Yogi needs to convert 300 gold coins into 12 gold bars that will provide the park with the money to continue operations. \n \nThe player has the ability to jump on most enemies to kill them, just like in Super Mario Bros..Some enemies must be left alone due to the lack of ability to wield a weapon. Falling down into bottomless pits or navigating into dangerous hazards will cause Yogi to lose a life. By default, the player gets three lives and one additional continue.", "id": 46299, "name": "Yogi Bear in Yogi Bear's Goldrush"}, {"genres": [8, 33], "name": "Rastan", "videos": [{"video_id": "iz5rgV56kdU", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hbswezr2xgeodpfreyij.jpg", "width": 640, "cloudinary_id": "hbswezr2xgeodpfreyij", "height": 824}, "summary": "Rastan, originally released as Rastan Saga (ラスタンサーガ?) in Japan, is a fantasy-themed side-scrolling action game originally released for the arcades in 1987 by Taito and later ported to various platforms. \n \nThe controls of Rastan consists of an eight-way joystick and two buttons for attacking and jumping. By using the joystick in combination with either buttons, the player can determine the height of Rastan's jumps, as well as the direction where he swings his weapon (including downwards while jumping). The game uses a health gauge system along with limited lives, although certain obstacles (such as falling into a body of water or being crushed by a spiked ceiling) will instantly kill Rastan regardless of how much health he has left. \n \nThere are a total six rounds, each consisting of three areas: an outdoor scene, a castle scene and a throne room where the player must confront the stage's boss. The backgrounds of the outdoor areas feature broad landscapes with changing sunlight effects with detail. The game's bosses (names according to the MSX2 version) consists of Graton (a skeletal warrior who wields a halberd), Slay (a demonic swordsman who can sprout wings), Symplegades (a wizard), Laios (a dragon knight), the Hydra (a five-headed snake) and the final boss, the Dragon. \n \nThe player can pick up any item by touching them, as well as new weapons by striking them with his current one. All the weapons and power-ups picked by Rastan will be equipped only for a limited time. When Rastan picks up any equipable item, an icon will appear on the lower right corner of the screen as an indicator of the item's effect until it wears out. Rastan can only wield one weapon at a time (which consists of a mace, an axe and a fireball-shooting sword in addition to his standard sword), as well as only one type of protector (a shield, a mantle or a body armor), but other items (such as the necklace and ring) can be worn at the same time. There are also jewels that gives out bonus points, as well potion bottles that will restore or deplete the player's health depending on the color. The rare golden sheep's head will restore Rastan's health completely.", "storyline": "The player controls a barbarian warrior who has embarked on a quest to slay a dragon. While on his way to the dragon's lair, Rastan must fight hordes of enemy monsters based on mythical creatures such as chimeras and harpies.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/eogfnftt5nsex6nssqgm.jpg", "width": 256, "cloudinary_id": "eogfnftt5nsex6nssqgm", "height": 177}], "id": 6875}, {"genres": [8], "name": "Spider-Man and the X-Men in Arcade's Revenge", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/o8ocrqcw7qupnpdfh623.jpg", "width": 640, "cloudinary_id": "o8ocrqcw7qupnpdfh623", "height": 884}, "summary": "Spider-Man and members of the X-Men have teamed up in this side-scrolling action game to fight against Arcade, who has built a giant amusement park for the sole purpose of trapping and destroying the super-heroes. You first play as Spider-Man, who sees the X-Men get kidnapped by Arcade and follows them. Once you make it inside Arcade's park you can choose to play as Spider-Man, Cyclops, Storm, Gambit, or Wolverine, each of whom are trapped in a different part of Arcade's maze of deadly traps. You must navigate all five of them safely out, using their different skills and abilities while defeating baddies and bosses along the way.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/v0mennm25l7iy70yafji.jpg", "width": 800, "cloudinary_id": "v0mennm25l7iy70yafji", "height": 700}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gwsalt0ukr2gqc6jwapp.jpg", "width": 256, "cloudinary_id": "gwsalt0ukr2gqc6jwapp", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sa08uzfqrx41glfp5neh.jpg", "width": 256, "cloudinary_id": "sa08uzfqrx41glfp5neh", "height": 224}], "id": 4389}, {"genres": [16], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oedaovxhc2jj7iq411gn.jpg", "width": 465, "cloudinary_id": "oedaovxhc2jj7iq411gn", "height": 640}, "id": 46437, "name": "Battleship: The Classic Naval Warfare Game"}]