[{"genres": [31], "name": "The Spy Who Loved Me", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nzopwimvvt7icnbrjchg.jpg", "width": 464, "cloudinary_id": "nzopwimvvt7icnbrjchg", "height": 640}, "summary": "James Bond: The Spy Who Loved Me was Domark's penultimate Bond game, and is widely considered to be a rip-off of the arcade classic Spy Hunter. Both titles feature gadget laden cars in a vertical-scrolling racing and shooting game. The problem with The Spy Who Loved me is the bad controls, and the low production values. For instance, the boat sections have a little map to indicate where ramps and dead-ends are, but they are sometimes incorrect, causing frustrating deaths. On the plus side, the graphics and music are good on the Amiga and Commodore 64 versions.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/trdtenalaiyexy2pxqej.jpg", "width": 640, "cloudinary_id": "trdtenalaiyexy2pxqej", "height": 400}], "id": 1635}, {"genres": [10], "summary": "Strap yourself in for a life or death ride. In hot pursuit of enemy agents, blaze a trail across Europe in the world's most powerful vehicles. Only your skill and determination will get you all the way to your destination - Berlin!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fybhgznxqmxhhvf0zsfn.jpg", "width": 250, "cloudinary_id": "fybhgznxqmxhhvf0zsfn", "height": 319}, "id": 2055, "name": "Out Run Europa"}, {"genres": [10], "name": "Turbo Outrun", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p71jlqurkchomikzir9x.jpg", "width": 850, "cloudinary_id": "p71jlqurkchomikzir9x", "height": 1099}, "summary": "The sequel to OutRun features similar basic gameplay to the original, with the action viewed from behind the car, and the challenge being to complete each stage within the time limit. Contact can cause the car to spin, slow down or even flip; in each case you will lose time. \n \nThere are 16 stages set across the US, gradually moving from east to west, all depicted differently visually. After every 4 levels, you go into a shop screen, with a choice of upgrades. As the title implies, you now have a turbo booster installed, which speeds up the car, although over-use can cause the engine to overheat, and it is not recharged until each shop section. You have 5 continues, and failure to complete the course within the time limit costs you one.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bepq6pv2rsysmkx4io8p.jpg", "width": 320, "cloudinary_id": "bepq6pv2rsysmkx4io8p", "height": 256}], "id": 2053}, {"genres": [25], "name": "Altered Beast", "videos": [{"video_id": "A57GZEJlxrc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s4sb9fhddx31kd7rfhcq.jpg", "width": 220, "cloudinary_id": "s4sb9fhddx31kd7rfhcq", "height": 307}, "summary": "Unleash metamorphic power. \"Awaken, dead warrior!\" cries Zeus, God of Thunder. And you rise. Called upon to live again, you kick, punch, grapple and tear at the inhuman and monstrous flesh of horrible, dangerous underworld henchmen out to do you wrong. Savagely intent upon rescuing Athena, daughter of Zeus, from the demon god Neff, you stalk the bowels of Hades and beyond. \n \nWhat you are now you will not be. You are the Altered Beast - bestowed with five formidable forces of transformation - each more ferocious, more overwhelming, than the last. By battling, conquering and capturing spirit balls, your metamorphic powers will grow. But to what end? \n \nThe final confrontation. Your triumph over crocodile worms, hammer demons and grave masters brings on the horror of Neff himself. But boldness and cunning will be rewarded - in the ultimate Altered Beast! \n \nTransformation is the ultimate power.", "storyline": "A Roman centurion who had died in battle is resurrected from the dead by Zeus. The centurion is ordered by Zeus to save his daughter Athena from a Demon God called Neff in the Underworld. To become able to withstand the perils, the warrior gets the ability to absorb spirit balls which transform him into an Altered Beast, a part animal, part human creature of formidable force. Between each level are small animations giving the player glimpses of Athena's peril. He first travels through the graveyard fighting past zombies and winged demons. The centurion becomes a werewolf in order to fight Neff in the form of Aggar. The centurion defeats him, but Neff escapes. \nThe centurion travels through the Underworld where he fights through giant leeches, Chinese dragon-headed rattlesnakes, and ferocious Chicken Stingers (resembling the ones from Golden Axe). The centurion turns into a humanoid thunder dragon in order to fight Neff in the form of Octeyes. The centurion defeats him, but Neff escapes. \nThe centurion travels through the Cavern of Souls where he fights through Cave Needles (which resemble giant ants), turtle/snail hybrids, and zombies known as Grave Masters. The centurion turns into a humanoid bear in order to fight Neff in the form of Mouldy Snail. The centurion defeats him, but Neff escapes. \nThe centurion arrives at Neff's palace where he fights through zombies, Chicken Stingers, and Hammer Demons. The centurion turns into a humanoid tiger in order to fight Neff in the form of Crocodile Worm. The centurion defeats him, but Neff escapes. \nAfter the centurion arrives in Dis, he fights through winged demons, Goat Men, Boar Men, saw fishes, and purple Unicorn Men to get to Neff. When the centurion confronts Neff, the centurion becomes a golden werewolf while Neff transforms into a Rhinoceros-Man. After he is defeated, a blue bird comes out of the ground and transforms back to Athena. Afterwards she is shown holding arms with her lycanthropic hero, thanking him for rescuing her. \nIn the original arcade, the end credits are interspersed with images of actors in costumes for the different characters and monsters of the game, implying the whole game was a film production.[2]", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vtlhfdns3rjjdvl4mxhu.jpg", "width": 500, "cloudinary_id": "vtlhfdns3rjjdvl4mxhu", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tbzuwigixfgztnoqpudo.jpg", "width": 500, "cloudinary_id": "tbzuwigixfgztnoqpudo", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vhqdmh85lztldctpucpb.jpg", "width": 480, "cloudinary_id": "vhqdmh85lztldctpucpb", "height": 320}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mmtjq8nfwvhrjtscei7n.jpg", "width": 640, "cloudinary_id": "mmtjq8nfwvhrjtscei7n", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ylhhtzgxtht6ahnjq86z.jpg", "width": 320, "cloudinary_id": "ylhhtzgxtht6ahnjq86z", "height": 224}], "id": 2604}, {"genres": [8], "name": "Cool Spot", "videos": [{"video_id": "0iMM2vqrE08", "name": "Game intro"}, {"video_id": "nsbwXl-EuHw", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lq7ydlvreddtkl8xjpmq.jpg", "width": 220, "cloudinary_id": "lq7ydlvreddtkl8xjpmq", "height": 310}, "summary": "Cool Spot is a mascot for 7 Up, introduced in 1987. During this time, the red spot in the 7 Up logo was anthropomorphized: given arms, legs, a mouth, and sunglasses. British video games developer Virgin Interactive's American studio produced a platform game starring the 7 Up Spot, entitled Cool Spot.", "storyline": "In each level the player must rescue other cool spots, who look exactly alike, from cages at the end of that level, which is not necessarily the point at the far right of the level map. In order to do so, the player is required to collect a certain number of \"spots\" that would change (usually increase) as the game progressed. \"Spots\" were placed across the level in large quantities, and were the game's substitute for items such as the coins in Super Mario Bros", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zntmpoa2eslja0dyqixr.jpg", "width": 800, "cloudinary_id": "zntmpoa2eslja0dyqixr", "height": 700}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vu4kn00wfnzjwbpwvzf7.jpg", "width": 800, "cloudinary_id": "vu4kn00wfnzjwbpwvzf7", "height": 700}], "id": 2621}, {"genres": [9], "name": "Krusty's Fun House", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dmvpmjnngwzhgfhbbytn.jpg", "width": 200, "cloudinary_id": "dmvpmjnngwzhgfhbbytn", "height": 275}, "summary": "Krusty the Clown's Fun House has been overrun by rats. You must help him to herd the rats into trap machines to clear them out. In order to do so, Krusty must manipulate his environment to set up pathways so that the rats are headed in the right direction. Objects that Krusty move around include blocks, fans, and pipe pieces.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/aldghjzj6pi4uzdlpox7.jpg", "width": 320, "cloudinary_id": "aldghjzj6pi4uzdlpox7", "height": 256}], "id": 2740}, {"genres": [8], "name": "The Simpsons: Bart vs. The Space Mutants", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rjsi8cbmcdbhkqm7ohiu.jpg", "width": 220, "cloudinary_id": "rjsi8cbmcdbhkqm7ohiu", "height": 302}, "summary": "Bart vs. The Space Mutants is a platform game where the player goes into the role of Bart Simpson (from the TV show The Simpsons) and must stop the Space Mutants from invading Springfield. On each of the five levels, Bart must collect (or get rid of) the ingredients that the Space Mutants are planning to use to build their machine, such as purple objects or balloons. He also has to collect enough \"proof\" of the aliens existence (brown coins left behind when they are jumped on), so his family members will help him when he meets a boss (characters such as Nelson and Sideshow Bob). This won't be easy since the Space Mutants are \"using\" human bodies as disguise. In order to discover who are the real Space Mutants, Bart must use his X-ray Specs.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bz4r1io2mnlondyl57dv.jpg", "width": 320, "cloudinary_id": "bz4r1io2mnlondyl57dv", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/g0rdvcbvksupgdoywwcl.jpg", "width": 320, "cloudinary_id": "g0rdvcbvksupgdoywwcl", "height": 256}], "id": 2827}, {"genres": [8], "name": "The Simpsons: Bart vs. the World", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fkoabwhqga3cvvdbbwmv.jpg", "width": 209, "cloudinary_id": "fkoabwhqga3cvvdbbwmv", "height": 300}, "summary": "Yo! Here's the deal! I won the Krusty the Clown art contest so my family and I get to go on this really cool Worldwide Treasure Hunt to China, Egypt, the North Pole and Hollywood. And I need you to help to collect Krusty faces and Krusty products if I want to reach my final destination: a guest appearance on the Itchy & Scratchy Show! Any questions? Good. I'm outta here. Your friend, Bart Simpson.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hhueubwnftzwzlxflqsq.jpg", "width": 320, "cloudinary_id": "hhueubwnftzwzlxflqsq", "height": 256}], "id": 2830}, {"genres": [4, 8], "name": "Prince of Persia", "videos": [{"video_id": "Xv20j8ChtRY", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lnbjgbihgekwzunqidk8.jpg", "width": 250, "cloudinary_id": "lnbjgbihgekwzunqidk8", "height": 320}, "summary": "The game is set in ancient Persia. While the sultan is fighting a war in a foreign land, his vizier Jaffar, a wizard, seizes power. Jaffar's only obstacle to the throne is the Sultan's daughter (although the game never specifically mentions how). Jaffar locks her in a tower and orders her, under threat of execution, to become his wife. The game's nameless protagonist, whom the Princess loves, is thrown into the palace dungeons. The player must lead the protagonist out of the dungeons and to the palace tower, defeating Jaffar and freeing the Princess in under 60 minutes. In addition to guards, various traps and dungeons, the protagonist is further hindered by his own doppelgänger, an apparition of his own self that is conjured out of a magic mirror.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zomj1uaygbo2zdhkkyjl.jpg", "width": 1919, "cloudinary_id": "zomj1uaygbo2zdhkkyjl", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xhjyq1rronkr1g5uituf.jpg", "width": 1919, "cloudinary_id": "xhjyq1rronkr1g5uituf", "height": 1079}], "id": 2472}, {"genres": [8, 31, 33], "name": "The Lion King", "videos": [{"video_id": "nGbanhZRxgc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aeygysu5ksdwlydzi1yi.jpg", "width": 4283, "cloudinary_id": "aeygysu5ksdwlydzi1yi", "height": 5547}, "summary": "The Lion King brings to life the majesty and mystery of Africa thruogh the tale of Simba, a lion cub faced with the challenging transition to maturity. Believing himself to be responsible for his father's death, Simba enters the wilderness - where he finds salvation with Pumbaa the warthog and Timon the meerkat, and his education begins. \n \nTake control of the youg cub Simba and, through interaction as detailed as the lust terrain, guide him safely through.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hchxtr1ys2q0g1nvy6ze.jpg", "width": 1280, "cloudinary_id": "hchxtr1ys2q0g1nvy6ze", "height": 720}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ctpszxvzrtr4cgco0r9v.jpg", "width": 1280, "cloudinary_id": "ctpszxvzrtr4cgco0r9v", "height": 720}], "id": 3166}, {"genres": [8], "name": "Sonic The Hedgehog", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dvfifwj5ifzqhagayami.jpg", "width": 640, "cloudinary_id": "dvfifwj5ifzqhagayami", "height": 894}, "summary": "Sonic the Hedgehog is a 2D, side-scrolling platformer, whose gameplay centers around Sonic's ability to run at high speed through levels incorporating springs, slopes, high falls, and loop-the-loops. The levels contain hazards in the form of robots (\"badniks\" in the Western game manuals) in which Dr. Robotnik has trapped animals. Although destroying a robot frees the animal within, this is not required to complete the game. The player must avoid rows of sharp spikes, falling into bottomless pits, being crushed by moving walls or platforms, and drowning (which can be avoided by breathing air bubbles periodically released from vents). Sonic's main attack is his spin, where he curls into a ball and rotates rapidly (damaging enemies and some obstacles). This can be performed by jumping in the air or rolling on the ground. \n \nScattered around each level map are gold rings and collecting 100 rings rewards the player with an extra life. Rings are a layer of protection against hazards; if Sonic has at least one ring when he collides with an enemy, he will survive. However, all his rings will be scattered; they will flicker and disappear in a few seconds if they are not picked up again. If Sonic is hit without any rings, he loses a life. Although shields and temporary invincibility may be collected to provide additional protection, certain hazards (such as drowning, being crushed, falling down a bottomless pit or running out of time) will cost Sonic a life regardless of rings or other protection. \n \nThe game is divided into six zones (Green Hill, Marble, Spring Yard, Labyrinth, Star Light, and Scrap Brain), each with its own visual style and enemies. A player must navigate through each zone (subdivided into three acts) to progress. \n \nAt the end of each zone's third act, the player confronts Dr. Robotnik (who pilots a different vehicle each time) in a boss fight. After the sixth zone, the player continues directly to the Final Zone for a last encounter with Robotnik. They begin with three lives (power-ups and rings add more), which are lost when Sonic collides with hazardous enemies (or objects) without rings, falls off-screen or exceeds an act's ten-minute time limit. Lampposts acting as checkpoints allow Sonic to return to the most-recently activated post when he loses a life. If he loses a life as a result of time running out but has another life, the timer will reset to 0:00 when he returns to the checkpoint. If all lives are lost at any point in the game, the game over screen will appear (when the player can return to the beginning of the act with three lives, if they have any continues). \n \nWhen Sonic reaches the end of act one or act two of a zone with at least fifty rings, a large ring appears through which he can jump to enter a Special Stage (a \"Secret Zone\" in the original Genesis manual). In each of six Special Stages, Sonic bounces off the bumpers and walls of a rotating maze in spin attack. Although the player earns a continue with each 50 rings found, their main goal is to obtain the Chaos Emerald at the end of the maze without colliding with a \"goal block\" (which ends the level).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nf1iu9lmtr4nzdz2a2mh.jpg", "width": 480, "cloudinary_id": "nf1iu9lmtr4nzdz2a2mh", "height": 270}], "id": 3192}, {"genres": [8, 31], "name": "Disney's Aladdin", "videos": [{"video_id": "bp1XvV8BBfQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/os2dwbnbh9v8gwkeipmd.jpg", "width": 800, "cloudinary_id": "os2dwbnbh9v8gwkeipmd", "height": 582}, "summary": "Disney's Aladdin is a 1993 video game developed by Capcom for the Super Nintendo Entertainment System (SNES). Based on the film of the same name, Disney's Aladdin is a 2D side-scrolling video game in which the player characters are Aladdin and his monkey Abu. The game was released in November 1993, the same month that another game with the same title was released by Virgin Games for Sega Genesis. The two games vary in several respects, including the fact that Aladdin carries a sword in the Virgin game but does not in the Capcom game, a fact that Shinji Mikami, the Capcom game's designer, said made the Virgin game better. The Capcom game was ported to Game Boy Advance (GBA) on March 19, 2004.", "storyline": "Disney's Aladdin was loosely based after the movie of the same title. The storyline is fairly consistent with the movie, and the player controls Aladdin through a series of adventures that are able to maintain somewhat of the look and feel of the movie, despite the limitations of the format.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/soykamthrnmjunp9kydm.jpg", "width": 640, "cloudinary_id": "soykamthrnmjunp9kydm", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eyehvsviud47qiujn2er.jpg", "width": 610, "cloudinary_id": "eyehvsviud47qiujn2er", "height": 407}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mxyh0nxjrfygftpe9vte.jpg", "width": 640, "cloudinary_id": "mxyh0nxjrfygftpe9vte", "height": 468}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iadxkokzpiwyie6zvoyd.jpg", "width": 640, "cloudinary_id": "iadxkokzpiwyie6zvoyd", "height": 400}], "id": 2473}, {"genres": [5, 8, 31], "name": "Earthworm Jim", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sgpdlhpeaohxwr6ectsy.jpg", "width": 256, "cloudinary_id": "sgpdlhpeaohxwr6ectsy", "height": 358}, "summary": "A crow is chasing a worm named Jim while in outer space Psy-Crow is chasing a renegade ship. The ship's captain has stolen an ultra-high-tech-indestructible-super-space-cyber-suit and Queen Slug-for-a-Butt has ordered Psy-Crow to get it, since it can make her more beautiful than Princess-What's-Her-Name. Psy-Crow blasts the captain and the suit falls to Planet Earth. \n \nBack on earth Jim wonders if he is finally safe when an ultra-high-tech-indestructible-super-space-cyber-suit lands on him. Luckily Jim rests in the neck ring of the suit. Then the space particles begin interacting with Jim, causing a light-speed evolution. Jim soon realizes he is in control of the suit. \n \nJim overhears the Queen's plans for the suit and decides to meet this Princess...", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jsnh7thv2t0pp2tkqhpg.jpg", "width": 320, "cloudinary_id": "jsnh7thv2t0pp2tkqhpg", "height": 224}], "id": 3480}, {"genres": [5, 8], "name": "RoboCop Versus The Terminator", "videos": [{"video_id": "UJu0IeYb7AA", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bw98iwvrfc7crwbvkb7v.jpg", "width": 200, "cloudinary_id": "bw98iwvrfc7crwbvkb7v", "height": 287}, "summary": "In the crumbling ruins of a world under siege, man-machine meets machine-man as legendary cyborgs clash to decide the fate of the Earth. As Robocop, you must travel across time into a bloody future ruled by the mechanical forces of Skynet. You'll face attack from every angle, every moment. An unwavering army of Terminators, robotic dogs, spiders, Endoskeletons and a relentless arsenal of automated weapons await you in this veritable hell on earth. To destroy this enemy, free its hostages and finally pierce the dark heart of a killer computer. It will take something more powerful than plasma rifles and laser guns: the human mind that still burns within you.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/sntj1vonpscowfmcyfpo.jpg", "width": 600, "cloudinary_id": "sntj1vonpscowfmcyfpo", "height": 450}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vndmlzhwwx31no8qemvv.jpg", "width": 640, "cloudinary_id": "vndmlzhwwx31no8qemvv", "height": 480}], "id": 8195}, {"genres": [4, 33], "name": "Pit Fighter", "videos": [{"video_id": "o2Nq9JzWzMM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kmquxkdkhlwiajw2fwdx.jpg", "width": 1000, "cloudinary_id": "kmquxkdkhlwiajw2fwdx", "height": 1372}, "summary": "The gameplay is similar to Taito's Violence Fight and SNK's Street Smart. The player must jump, punch, and kick their opponent until his/her energy runs out. If the player presses all three of the buttons at a time, the character will perform a \"super move\". The player begins Pit-Fighter by choosing one of the three playable characters, who all have different moves, speed, and power.\n\nIn the player select screen in the arcade version, each player has a color to select the fighters with: for player one it's blue, for player two it's red and for player three it's yellow. As many as three people can play at a time, but there will be extra opponents to fight during any of this game's 15 different matches.\n\nEvery third fight is a bonus round known as a Grudge Match.[1] In a Grudge Match, the player must fight against a CPU controlled clone of his or her fighter (if playing alone) or the other players in a multiplayer game. Getting knocked down three times eliminates a player from the Grudge Match, the winner is the last man standing. Losing the Grudge Match does not eliminate a player, but the winner gets bonus money.\n\nThe final battle, the \"Championship Match\", is between the player and the mysterious entity that taunts between matches every once in a while, the Masked Warrior. If more than one person is playing the game before this match, they must fight each other to the death until only one becomes victorious and can fight him.\n\nSometimes during matches the player will come across foreign objects such as knives, crates, sticks, motorcycles, and bar stools that can be thrown at you or your opponent. The player may also come across a power-up known as the \"power pill\". If the player or the opponent grab this item, one will become temporarily stronger and take less damage from hits.\n\nAt times even the crowd will interfere in the fights. Two characters, known as Knife Man (Milt Loper) and Knife Woman (Dianne Bertucci), will come out of the crowd and stab the player with their daggers. The player can take these nuisances out with one hit. Sometimes there is also a fat bearded man with a stick. If the player knocks him down, the player can take the stick and use it against the current opponent.\n\nThe audience will also push any fighter that ends up among them, and stays there more than a few seconds. They will be forced back into the fighting area.", "id": 6824}, {"genres": [5], "name": "Galaxy Force II", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xralh2sflrdjdhnrx05e.jpg", "width": 540, "cloudinary_id": "xralh2sflrdjdhnrx05e", "height": 759}, "summary": "The peaceful and prosperous solar system Junos was located at the end of the Milky Way. Those who called its five planets home had no idea what was about to happen... \nHalcyon, ruler of the Fourth Empire, had Junos marked as its final target in the galactic massacre, and had sent the bulk of his attacking force in with a single purpose – the elimination of all life forms in the system, and the construction of a gigantic fortress on each of the five planets from which to rule the galaxy.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hsyv7sn22ncqgqjclsye.jpg", "width": 500, "cloudinary_id": "hsyv7sn22ncqgqjclsye", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ef0xbjkh2ryz3ugjzre8.jpg", "width": 500, "cloudinary_id": "ef0xbjkh2ryz3ugjzre8", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/texvdeltl4oveycmbm7q.jpg", "width": 500, "cloudinary_id": "texvdeltl4oveycmbm7q", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xvta7kxhtc6tvk2dns7t.jpg", "width": 320, "cloudinary_id": "xvta7kxhtc6tvk2dns7t", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/k1lwqmalgmjvr8sc7lfc.jpg", "width": 320, "cloudinary_id": "k1lwqmalgmjvr8sc7lfc", "height": 224}], "id": 6799}, {"genres": [9, 15, 33], "name": "Tetris", "videos": [{"video_id": "wbHdABxSGrk", "name": "Gameplay video"}, {"video_id": "Ql81jI4DpgQ", "name": "Teaser"}, {"video_id": "uRrTA8NqPpQ", "name": "Teaser"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ocrdnzywvyzcjow0jygv.jpg", "width": 223, "cloudinary_id": "ocrdnzywvyzcjow0jygv", "height": 320}, "summary": "Tetris is an electronic puzzle game that was created by Alexey Pajitnov in 1984, while working in the USSR as a computer programmer. Pajitnov often programmed games to test new equipment using simple tasks, and in his spare time, developed a computer game inspired by his favorite puzzle board game Pentominos. The objective of Pentominos was to fit 12 different geometric-shaped pieces formed out of five squares into a box.\n\nPajitnov’s vision was to create an electronic game where players arranged puzzle pieces in real time by having them “fall” faster and faster from the top of the screen. Pajitnov designed the game using seven distinctive playing pieces made from four squares. He called it Tetris, after “tetra,” the Greek word for four, and tennis, his favorite sport. After giving the game to his colleagues, it became an instant, hugely addictive hit, and shortly thereafter spread like wildfire throughout the Soviet Bloc’s computer literate. His subsequent friendship with game designer, Henk Rogers, now Blue Planet Software Chairman and Managing Director of The Tetris Company, brought the Tetris game out of the Soviet Union to become one of the most widely played electronic games of all time.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hcehoplgl03esbequtb2.jpg", "width": 360, "cloudinary_id": "hcehoplgl03esbequtb2", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cvhlnnx1clyczp444ipm.jpg", "width": 360, "cloudinary_id": "cvhlnnx1clyczp444ipm", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/egylbje6gmdjvuxrjtfr.jpg", "width": 511, "cloudinary_id": "egylbje6gmdjvuxrjtfr", "height": 464}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zu5jsg09hltplkuvrqrc.jpg", "width": 400, "cloudinary_id": "zu5jsg09hltplkuvrqrc", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lhnfpvszmgzpswavu0qm.jpg", "width": 360, "cloudinary_id": "lhnfpvszmgzpswavu0qm", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vg8hfhzqxhksotzgoqjv.jpg", "width": 360, "cloudinary_id": "vg8hfhzqxhksotzgoqjv", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ycgkctzmfbevocfflibf.jpg", "width": 400, "cloudinary_id": "ycgkctzmfbevocfflibf", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aejdaphpoi7s0wa1srhg.jpg", "width": 511, "cloudinary_id": "aejdaphpoi7s0wa1srhg", "height": 464}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q5tsvxn51l9vsasgztnw.jpg", "width": 400, "cloudinary_id": "q5tsvxn51l9vsasgztnw", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l5vjjtivyfrjrph0fvco.jpg", "width": 360, "cloudinary_id": "l5vjjtivyfrjrph0fvco", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/okl0v4tfan8njy1auqvr.jpg", "width": 360, "cloudinary_id": "okl0v4tfan8njy1auqvr", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nrminrrv8fmkwsnpeaiq.jpg", "width": 400, "cloudinary_id": "nrminrrv8fmkwsnpeaiq", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aqwt6anwzqzcj7pykyp8.jpg", "width": 511, "cloudinary_id": "aqwt6anwzqzcj7pykyp8", "height": 464}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zqqohs8fdgypjgakr81w.jpg", "width": 511, "cloudinary_id": "zqqohs8fdgypjgakr81w", "height": 464}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pa9uen7xef9o4jy2zxyk.jpg", "width": 360, "cloudinary_id": "pa9uen7xef9o4jy2zxyk", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/o2thjpnlbfdqockltm4s.jpg", "width": 360, "cloudinary_id": "o2thjpnlbfdqockltm4s", "height": 240}], "id": 8197}, {"genres": [8, 33], "name": "Shadow Dancer", "videos": [{"video_id": "be_Y2cwETF0", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/at0q4dpplayryhszzude.jpg", "width": 640, "cloudinary_id": "at0q4dpplayryhszzude", "height": 777}, "summary": "The play mechanics of Shadow Dancer are not much different from the arcade version of the original Shinobi. The controls and almost all of the player's moves from the original Shinobi are present here as well. The biggest change is the addition of a canine companion that follows the protagonist around. When the dog barks towards an enemy, the player can sic the dog on the enemy by holding down the attack button and releasing it, allowing the player an opportunity to attack the enemy while he's being bitten by the dog. However, if the player takes too long to attack the bitten enemy or the enemy has a strong defense, then the dog will be hurt and he will turn into a harmless pup and will remain in that form until the player acquires the next time bomb or finishes the stage. The dog does not appear during boss battles. \n \nThe player's weapons consists of an unlimited supply of shurikens and a sword which is used when adjacent to an enemy. When the player collects half of the time bombs in each stage, stronger weapons are granted until the player finishes the stage or loses a life. The player can also use from one of three random \"Ninja Magic\" spells that will clear the entire screen of enemies. Normally, these spells can only be used once per stage, but if the player inserts another credit after getting a Game Over and continues, the protagonist will restart with two units instead of one. If the player completes a stage without using shurikens or spells, bonus points are awarded. \n \nThere are four different missions, consisting of three stages for the first mission and four stages each for the remaining three. In the first few stages of each mission, the player must collect a certain amount of time bombs scattered throughout the stage in order to proceed to the goal. The final stage in each mission is a confrontation between the player and the boss. Between missions, the player will participate in a bonus stage where (from the character's perspective) an army of ninjas dropping down from a building must be shot down. If the player successfully completes a bonus round, an extra life is awarded.", "storyline": "A terrorist group is planting numerous time bombs throughout the city. The player, a ninja master accompanied by a canine partner, sets out on four missions to dismantle the bombs and destroy the criminal syndicate behind these acts.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rqn4vr5uzdwdblfutuen.jpg", "width": 748, "cloudinary_id": "rqn4vr5uzdwdblfutuen", "height": 560}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kj5n5opwnpg6fefpmiiq.jpg", "width": 748, "cloudinary_id": "kj5n5opwnpg6fefpmiiq", "height": 560}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qqcxg8vrkb0onsz8ujwd.jpg", "width": 748, "cloudinary_id": "qqcxg8vrkb0onsz8ujwd", "height": 560}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/baheiqxlnpgq7xihdrb2.jpg", "width": 748, "cloudinary_id": "baheiqxlnpgq7xihdrb2", "height": 560}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l3qqah05nivyg9z9wo9g.jpg", "width": 748, "cloudinary_id": "l3qqah05nivyg9z9wo9g", "height": 560}], "id": 6876}, {"genres": [8, 33], "name": "Strider (1989)", "videos": [{"video_id": "mnYHcX9T5p4", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ndebh8fkzyjffus7kpzy.jpg", "width": 446, "cloudinary_id": "ndebh8fkzyjffus7kpzy", "height": 576}, "summary": "The controls of Strider consist of an eight-way joystick and two action buttons for attacking and jumping. The player controls Hiryu himself, whose main weapon is a tonfa-like plasma sword known as \"Cypher\". He can perform numerous acrobatic feats depending on the joystick/button combination used. Pressing the jump button while Hiryu is standing still will cause him to do a regular vertical jump, while pressing the jump button while pushing the joystick left or right will enable him to do a cartwheel jump. Hiryu can also slide under or through certain obstacles and enemies by first crouching down and then pressing the jump button. As well as his sliding move, both jumps can also be used to destroy weaker opponents. Hiryu is able to latch onto certain platforms, and climb across walls and ceilings using a metallic hook. While running down a sloped surface, Hiryu can gain enough momentum to allow him to do a longer cartwheel jump than usual.\n\nNumerous power-ups can be obtained from item boxes carried by certain enemies. These includes an extension to Hiryu's attack range that lasts for one hundred slashes, two types of health aids (represented by the kanji used to write Hiryu's name: 飛 and 飛竜), a max health extension (represented by the kanji 竜, the second character in Hiryu's name), an extra life, and a power-up that not only makes Hiryu invulnerable to attack but also increases his own attack abilities via shadow images of himself for 15 seconds.[3] Hiryu can also summon robotic companions known collectively as \"options\" that help him fight enemies. These consist of up to two mushroom-like droids, a saber-toothed tiger and a hawk, known individually as Option A, B and C respectively.\n\nThe game has five stages: the Kazakh Soviet Socialist Republic (called \"St. Petersburg\" during the arcade game's attract sequence), the Siberian Wilderness, the Aerial Battleship Balrog (געלראב), the Amazonian Jungle, and the Grandmaster's lair itself, the Third Moon. Each of the stages is divided into a number of smaller sections, each with their own time limit and checkpoint location. The player has a three-point health gauge (which can be increased to five points with the health extensions. Hiryu will lose a life when either his health gauge is fully depleted, by moving him off the screen entirely (like falling into a bottomless pit) or when the game's timer reaches zero. It's Game Over when all of Hiryu's lives are lost, but the player can be given the opportunity to continue.", "storyline": "Strider is set in a dystopian future in the year 2048, where a mysterious dictator known as the \"Grandmaster\" rules over the world. Hiryu, the youngest ever Super A Ranked[2] member of an organization of high-tech ninja-like agents known as the \"Striders\", is alone tasked with the Grandmaster's assassination. Hiryu begins his mission by infiltrating the Grandmaster's capital at the Kazakh Soviet Socialist Republic.", "id": 6969}, {"genres": [10, 14], "name": "Hang-On", "videos": [{"video_id": "z2bIOJcDpYA", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/d8ot79hhl4fjfbi9hiz1.jpg", "width": 850, "cloudinary_id": "d8ot79hhl4fjfbi9hiz1", "height": 1192}, "summary": "Hang-On is an arcade game designed by Yu Suzuki and released by Sega in 1985. In the game, the player controls a motorcycle against time and other computer-controlled bikes. It was one of the first arcade games to use 16-bit graphics and Sega's \"Super Scaler\" technology that allowed pseudo-3D sprite-scaling at high frame rates. It also introduced a motion-controlled arcade cabinet, where the player's body movement on a large motorbike-shaped cabinet corresponds with the player character's movements on screen, inspiring arcade games that followed and anticipating the modern motion control trend.", "storyline": "Hang On is the 3-D motorcycle race game that's taken the arcades by storm. Race through grasslands, seasides, valleys, nighttime city scapes and, of course, motorcycle racecourses. This game is so fast it even gives you special techniques like Hang-on and Counter-steering for taking the corners.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/l7mxpeauhxprvappegoq.jpg", "width": 492, "cloudinary_id": "l7mxpeauhxprvappegoq", "height": 382}], "id": 6110}, {"summary": "Flicky is an arcade game made by Sega. First released in arcades in 1984, Flicky was also released at the time for the SG-1000, and then ported to the MSX and Japanese computers Sharp X1, Fujitsu FM-7 and NEC PC-8801. It was later ported to the Sega Mega Drive/Genesis in 1991. Flicky was designed by Yoji Ishii, who was with Sonic Team until August 1999, when he formed Artoon, his own company.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iotyrvzft2qsinqumbj5.jpg", "width": 400, "cloudinary_id": "iotyrvzft2qsinqumbj5", "height": 559}, "id": 6105, "videos": [{"video_id": "RE4VSdJRCCM", "name": "Trailer"}], "name": "Flicky"}, {"genres": [9, 33], "summary": "In 1982, a sequel to the incredibly popular Pac-Man was introduced in the form of his girlfriend, Ms. Pac-Man. This sequel continued on the \"eat the dots/avoid the ghosts\" gameplay of the original game, but added new features to keep the title fresh. \n \nLike her boyfriend, Ms. Pac-Man attempts to clear four various and challenging mazes filled with dots and ever-moving bouncing fruit while avoiding Inky, Blinky, Pinky and Sue, each with their own personalities and tactics. One touch from any of these ghosts means a loss of life for Ms. Pac-Man. \n \nMs. Pac-Man can turn the tables on her pursuers by eating one of the four Energizers located within the maze. During this time, the ghosts turn blue, and Ms. Pac-Man can eat them for bonus points. The Energizer power only lasts for a limited amount of time, as the ghost's eyes float back to their center box, and regenerate to chase after Ms. Pac-Man again. \n \nSurvive a few rounds of gameplay, and the player will be treated to humorous intermissions showing the growing romantic relationship between Pac-Man and Ms. Pac-Man, leading all the way up to the arrival of \"Junior\".", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/f2udbehhzgoixmo9awsk.jpg", "width": 800, "cloudinary_id": "f2udbehhzgoixmo9awsk", "height": 279}, "id": 7452, "name": "Ms. Pac-Man"}, {"genres": [8], "name": "Asterix", "videos": [{"video_id": "aIUDjXmVJSo", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/csxctel73oavxy9exblg.jpg", "width": 350, "cloudinary_id": "csxctel73oavxy9exblg", "height": 256}, "summary": "Asterix was developed by Bit Managers and Infogrames for a number of different consoles. It was based after the comic book series Asterix, which maintained a high level of popularity in Europe, but never took off in North America. For this reason, the game was only released in PAL format, and was never released in North America.", "storyline": "The game takes place in 50 B.C.-the main character, a mustached Gaul named Asterix must fight his way across Europe, fighting Romans and animals along the way to rescue his friend Obelix before Caesar throws Obelix to the lions.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jsiutd80pmdl64zvmakd.jpg", "width": 512, "cloudinary_id": "jsiutd80pmdl64zvmakd", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mcq41ea129bvcsewniwd.jpg", "width": 885, "cloudinary_id": "mcq41ea129bvcsewniwd", "height": 798}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/krqjvokcq4nm2jje2nh4.jpg", "width": 320, "cloudinary_id": "krqjvokcq4nm2jje2nh4", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vvdj7qhhekzl62q4dqcs.jpg", "width": 256, "cloudinary_id": "vvdj7qhhekzl62q4dqcs", "height": 224}], "id": 7757}, {"genres": [5], "summary": "Sega-Galaga is the SG-1000 port of Galaga, and is strangely the only port to receive a name change. \n \nThe player pilots a starship and must destroy all the on-screen enemies, similar to Space Invaders and Galaxian. However, the enemies in Galaga have the power to steal your ship to use as reinforcements (meaning the player loses a life). However, if you are able to destroy the enemy who has captured your ship, you are able to pilot both ships at once, doubling your firepower at the expense of being a bigger target. \n \nThough Sega-Galaga is essentially the same game as the arcade original, the limitations of the SG-1000 means the graphics and sound are not quite as advanced. Also the \"challenging stages\" have been omitted, meaning each stage is identical to the last.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yhvn3btrfkikf6vkxmka.jpg", "width": 400, "cloudinary_id": "yhvn3btrfkikf6vkxmka", "height": 553}, "id": 6131, "name": "Sega-Galaga"}, {"genres": [4, 8], "name": "Battletoads In Battlemaniacs", "videos": [{"video_id": "gsMyqV09wok", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lstcofl1cyizktx8cagn.jpg", "width": 525, "cloudinary_id": "lstcofl1cyizktx8cagn", "height": 380}, "summary": "Battletoads in Battlemaniacs is a 1993 platforming beat 'em up video game developed by Rare and published by Tradewest for the Super Nintendo Entertainment System. The game was released in North America in June 1993, in Europe in October 1993 and in Japan on January 7, 1994. It was also ported for the Sega Master System and released exclusively in Brazil. Released around the same time as Battletoads & Double Dragon, Battletoads in Battlemaniacs is an installment in the Battletoads series.\nThe game follows two Battletoads, Rash and Pimple, on a quest to stop Silas Volkmire and the evil Dark Queen from ruling over the world. Many of its levels are enhanced or remixed versions of levels from the original Battletoads, featuring similar mechanics and gameplay styles. Battletoads in Battlemaniacs received mostly positive response from critics, receiving an aggregate score of 78% from GameRankings. The game was praised for its varied gameplay and music, but criticized for its lack of originality and high difficulty.", "storyline": "The story begins with the Battletoads visiting the Gyachung-La fortress in northern Tibet. Professor T. Bird has invited them there to witness the Psicone Corporation's first demonstration of their new virtual reality game system, T.R.I.P.S (Total Reality Integrated Playing System). While showing off the system's artificial world (entitled \"The Gamescape\"), a pig of the apocalypse leaps out of the screen and kidnaps Michiko Tashoku (daughter of Psicone Corporation's CEO, Yuriko Tashoku). Zitz attempts to rescue her, but gets knocked out by the pig and captured as well. The pig escapes back into the Gamescape and Silas Volkmire appears on the screen, announcing his plans to turn the real world into his own Gamescape, and that Michiko and Zitz are being held captive under the evil Dark Queen. With nothing left to lose, Rash and Pimple enter the Gamescape to rescue their friends and stop Volkmire and the Dark Queen from fulfilling their plans.\nAlong the way, they fight Rocky, a giant stone pig, and race against Scuzz, a rat that challenges them all throughout the final level. The Battletoads finally reach the Dark Queen in her tower and defeat her, but she manages to escape again. Bird picks up Volkmire on his scanners and finds out that he is trying to escape using a teleporter, so the Battletoads leave the Gamescape and hop into the Battlecopter to chase after him.\nDepending on the player's actions during this final gameplay segment, there are two possible endings that may occur. If the player is unable to shoot three missiles at Volkmire's teleporter, he gets away, and the Battletoads feel dejected knowing that Volkmire is free and the Dark Queen wants revenge. If the player successfully shoots three missiles at Volkmire's teleporter, the ship crashes in the Himalayas and is recovered, but Volkmire is nowhere to be found. Similarly to the first ending, it is alluded to that Volkmire and the Dark Queen will want revenge.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/tbbnbod3n4pxsx5yjloy.jpg", "width": 640, "cloudinary_id": "tbbnbod3n4pxsx5yjloy", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/c631qu1mqi8xa2sykfru.jpg", "width": 480, "cloudinary_id": "c631qu1mqi8xa2sykfru", "height": 360}], "id": 18577}, {"genres": [8], "name": "The Jungle Book", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vx4nojbychdmjmxjcpy8.jpg", "width": 256, "cloudinary_id": "vx4nojbychdmjmxjcpy8", "height": 357}, "summary": "The Jungle Book game is based on a Disney movie hero Mowgli. It's a scrolling arcade action game. You play as Mowgli and your goal is to gather all gems and return to one of your friends or your mother. The jungle is full of the nasty animals and you have to make your way through it safely.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xz8kjleuedi6utdpmmne.jpg", "width": 768, "cloudinary_id": "xz8kjleuedi6utdpmmne", "height": 576}], "id": 6480}, {"summary": "Enter a vicious web of danger and disaster! The Kingpin of Crime frames Spider-Man for planting a bomb in New York; and Spidey's only hope is to find the keys to the bomb's location before it explodes. Help Spider-Man stick it to the Kingpin and his horde of vicious assassins along the way. Enter hand-to-hand combat with Dr. Octopus! Put the Sandman to sleep! Use dazzling acrobatics to take on the Lizard, Hobgoblin and Venom! Dodge Electro's amped-up charge! Don't be fooled by the new trickery of Mysterio and the villainy of the Vulture! Take aim with Spidey's gadgets. Shoot webs! Stick to walls and ceilings! Swing from skyscrapers!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qsasjl0h7rfmag51gd99.jpg", "width": 257, "cloudinary_id": "qsasjl0h7rfmag51gd99", "height": 196}, "id": 5357, "name": "The Amazing Spider-Man vs. The Kingpin"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vbuxjjnsxbbgjrzsjrvo.jpg", "width": 220, "cloudinary_id": "vbuxjjnsxbbgjrzsjrvo", "height": 314}, "genres": [8], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nmqhkvn29aphzq92lyso.jpg", "width": 320, "cloudinary_id": "nmqhkvn29aphzq92lyso", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ucvldelvo1a4ytd1nfeo.jpg", "width": 286, "cloudinary_id": "ucvldelvo1a4ytd1nfeo", "height": 240}], "id": 4516, "name": "Chuck Rock"}, {"genres": [31], "name": "Ecco the Dolphin", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/atl65klbsns5gwzasbsv.jpg", "width": 256, "cloudinary_id": "atl65klbsns5gwzasbsv", "height": 358}, "summary": "Life was an adventure for Ecco, the young dolphin. The ocean seemed endless with rolling breakers to race through! At high speed Ecco could burst through the waves leaping through the air – almost flying! Until one day, all of that changed. A freak whirlpool of air and water tore the life from Ecco’s home leaving Ecco all alone. Now he must fight to stay alive, while traversing the vast ocean in search of clues that will help him save his family and return them to the bay.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/b0fdf2zhtbuksfkbblfb.jpg", "width": 500, "cloudinary_id": "b0fdf2zhtbuksfkbblfb", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j2rye40bl5onzapxbkgh.jpg", "width": 220, "cloudinary_id": "j2rye40bl5onzapxbkgh", "height": 155}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uza6mh9br5hj0rmaqkn7.jpg", "width": 500, "cloudinary_id": "uza6mh9br5hj0rmaqkn7", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/e1b3gskkzrdenxpumwz3.jpg", "width": 500, "cloudinary_id": "e1b3gskkzrdenxpumwz3", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tav2hke9dnryynke5mqd.jpg", "width": 500, "cloudinary_id": "tav2hke9dnryynke5mqd", "height": 370}], "id": 5378}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ni9x1925sswpxnjsntd6.jpg", "width": 252, "cloudinary_id": "ni9x1925sswpxnjsntd6", "height": 434}, "genres": [8], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/w89iw4mihn6kxymcirav.jpg", "width": 320, "cloudinary_id": "w89iw4mihn6kxymcirav", "height": 256}], "id": 4371, "name": "Chuck Rock II: Son of Chuck"}, {"genres": [4], "summary": "In early Japan, a man named Shiro Tokisada Amakusa preaches a heretic religion. Little does anyone know that Amakusa is really a servant of the evil Ambrosia, who took over Amakusa's body. Ambrosia wishes to shroud the world in darkness. Now, choose between 12 warriors (and 3 bonus characters) to fight for the honor of destroying Amakusa, and fulfilling a mission.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dyeld0ai8x2hskftzdtk.jpg", "width": 1612, "cloudinary_id": "dyeld0ai8x2hskftzdtk", "height": 3083}, "id": 4260, "name": "Samurai Shodown"}, {"genres": [8], "name": "Shadow of the Beast", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/scrvui9yvfgf77xtsvus.jpg", "width": 250, "cloudinary_id": "scrvui9yvfgf77xtsvus", "height": 327}, "summary": "A game that takes your computer into a totally new dimension.\n\nShadow of the Beast is the most stunning 16-bit game you've ever played- a game that pushes your computer's features further than you ever thought they could go. Shadow of the Beast boasts the most incredible high-speed parallax scrolling ever seen. It will confront you with 132 different and vicious monsters, all as arcade quality fully animated sprites. You will be dazzled by the 128 colors appearing simultaneously on screen and rocked by the 900K of atmospheric soundtrack. And you'll be completely hooked by Shadow of the Beast's 350 screens of fast and furious action. So prepare for an experience you will never forget.\n\nKidnapped as a child by the evil Beast Mages, you have been transformed into a creature of fearsome power, agility and strength. In this guise you faithfully serve the Beast and its cohorts for many years as their warrior-messenger. Until one day you discover an awful secret- the truth about your past... a truth that drives you wild with anger and leads you on a trail of bloody revenge against your masters. Now the time has come to enter the Shadow of the Beast!\n\nYour task is to fight your way through hostile country to the heart of the enemy's stronghold, where you will face your ultimate adversary. Along the way you will encounter an awesome array of monsters and traps. Be ruthless, be quick... for only the strongest and toughest can hope to survive.\n\nPrepare to live by your wits, relying on split-second reactions and ingenuity. Combat the diabolical creatures. Dodge the deadly plant life. Overcome the devious traps. Find and use the long-lost artifacts. Feel the adrenalin pumping through your joystick hand as the blood pounds in your heart and the tension becomes almost unbearable...\n\nPrepare to enter Shadow of the Beast.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/arak1jmb6dgsqrbvts2e.jpg", "width": 320, "cloudinary_id": "arak1jmb6dgsqrbvts2e", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z6oucpuiascrkvdorfqq.jpg", "width": 320, "cloudinary_id": "z6oucpuiascrkvdorfqq", "height": 256}], "id": 5434}, {"genres": [14], "name": "World Cup USA '94", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x37aplzhupsxqlb95ogv.jpg", "width": 220, "cloudinary_id": "x37aplzhupsxqlb95ogv", "height": 313}, "summary": "Realistic gameplay with over 15 different moves. Customize gameplay to suit your own soccer style using pre-match options. Over 3000 frames of animation.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nteapw2hs6iryeqgnpwz.jpg", "width": 320, "cloudinary_id": "nteapw2hs6iryeqgnpwz", "height": 256}], "id": 5464}, {"genres": [8], "name": "Wolfchild", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yxmwtu8plxsuvnsbbsyp.jpg", "width": 220, "cloudinary_id": "yxmwtu8plxsuvnsbbsyp", "height": 277}, "summary": "The world's most renowned biogenetic scientist has been kidnapped and brainwashed into creating an army of bloodthirsty mutant warriors. \n \nSuddenly the fate of all mankind rests in the hands of his youngest son... and a top-secret mutating experiment known as \"Project Wolfchild.\" \n \n-10 freaky levels filled with mind-blowing mazes, brain twisting puzzles and against all-odds combat action. \n \n-CD-quality graphics and a rockin' stereo soundtrack \n \n-Grusome cast of unrelenting schitzoid mutants, each with the power to destroy \n \n-Fully animated introduction sequence", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/rrcomwwwoc10xbnsj1u7.jpg", "width": 320, "cloudinary_id": "rrcomwwwoc10xbnsj1u7", "height": 256}], "id": 4403}, {"genres": [5, 33], "summary": "Muster up all the skill, reflexes and guts you've got. Because inside your F-14 Thunder Cat, you're going to need all that - and more. \n \nBlast laser-directed, anti-aircraft fire at enemy planes. Dodge heat-seeking missiles with fancy flywork, like dips, turns and barrel rolls. Come head to head with the infamous Flying Fortresses (the toughest of all enemies) and dogfight your way through, to a nanosecond of safety. \n \nAnd if you make it far enough, a fuel tanker will be waiting for you. Dock successfully and you'll replenish valuable energy and ammunition. \n \nSo get your adrenaline pumping and grab your joystick. Then take to the skies. You're not going to believe what's up there!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/da86yojgmrblhuxieuuc.jpg", "width": 229, "cloudinary_id": "da86yojgmrblhuxieuuc", "height": 325}, "id": 5468, "name": "After Burner"}, {"genres": [4, 10], "name": "Road Rash", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eywipiisblrls5hjxcrm.jpg", "width": 1530, "cloudinary_id": "eywipiisblrls5hjxcrm", "height": 2100}, "summary": "Road Rash is an aggressive motorcycle racing game where the player assumes the role of a biker who takes part in a series of illegal races across the U.S.A. Starting at the back of the pack the objective is always to finish first on a linear course, overtaking the other bikers. This is achieved by driving very well or by playing it dirty, knocking opponents of their bikes using clubs, crowbars or your bare hands. The other racers fight back in a similar fashion and there are also hazards. All the races take place on the regular road with normal traffic (in both directions) and the cops, as well as occasional oil slicks and stray cows. \n \nBy winning races you can get promoted to a stronger division and earn cash with which you can buy a better bike. Whenever you're knocked off your bike or hit something you will have to run back to your bike and lose valuable time, plus your bike will suffer some damage. When the player crashes with cops nearby, it is possible to get busted and then you have to forfeit the race. \n \nLike the whole Road Rash lineage, the game has arcade-like gameplay with no intention to be a motorcycle simulation. While the game has a two-player mode, this is not simultaneous.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jmcjdzp6uf3eiw4vnjg2.jpg", "width": 660, "cloudinary_id": "jmcjdzp6uf3eiw4vnjg2", "height": 330}], "id": 3249}, {"genres": [8], "summary": "Uncle Scrooge found a magical necklace on a mysterious island, but the necklace put a curse on him. Now Uncle Scrooge is doomed to float around in the air forever! (Of course Donald always said Scrooge was full of hot air anyway!) To take the curse off Uncle Scrooge, Donald has to take the necklace back to the island. But there's plenty of danger awaiting Donald there. How about lending him a hand?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qv0vrkyrpnt2am1tzimz.jpg", "width": 256, "cloudinary_id": "qv0vrkyrpnt2am1tzimz", "height": 355}, "id": 8447, "name": "Deep Duck Trouble Starring Donald Duck"}, {"genres": [9, 15], "name": "Lemmings 2: The Tribes", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/a6cr1kyletwtrlhk91uh.jpg", "width": 250, "cloudinary_id": "a6cr1kyletwtrlhk91uh", "height": 323}, "summary": "By now, you'll probably be aware of the horrible plight the Lemmings face. Not only do they have to leave their lovely little hovels for good,but they also have to escape their island before they perish in the Darkness that's coming. Your objective therefore is to save as many Lemmings as possible from each tribe and help them escape the Island.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/nw7kmb49f3ekhto6hwoz.jpg", "width": 1919, "cloudinary_id": "nw7kmb49f3ekhto6hwoz", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mzdvhqe8methp5tybvum.jpg", "width": 1919, "cloudinary_id": "mzdvhqe8methp5tybvum", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/a9j0zepl92ha7metlp2u.jpg", "width": 1919, "cloudinary_id": "a9j0zepl92ha7metlp2u", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jymapeeaa8etz74ez8ky.jpg", "width": 1919, "cloudinary_id": "jymapeeaa8etz74ez8ky", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hhrdjg9n7mnm25kpqv0r.jpg", "width": 1919, "cloudinary_id": "hhrdjg9n7mnm25kpqv0r", "height": 1079}], "id": 8307}, {"genres": [31], "name": "Advanced Dungeons & Dragons: Heroes of the Lance", "videos": [{"video_id": "ZUHUzt7-sy8", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/taalb851q65sdq4ksj4o.jpg", "width": 220, "cloudinary_id": "taalb851q65sdq4ksj4o", "height": 303}, "summary": "Heroes of the Lance is a side-scrolling action game. The game used actual Dungeons & Dragons statistics, with statistics for the characters exactly as they were in the rule books. Eight heroes from the Dragonlance novels series must be assembled for the quest, and only one is visible on the screen at a time; when one on-screen hero dies, the next in line appears.", "storyline": "The game is based on the first Dragonlance campaign module for the Dungeons & Dragons fantasy role-playing game, Dragons of Despair, and the first Dragonlance novel Dragons of Autumn Twilight. Heroes of the Lance focuses on the journey of eight heroes through the ruined city of Xak Tsaroth, where they must face the ancient dragon Khisanth and retrieve the relic, the Disks of Mishakal.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pkwpuaoiupsixu1ywqse.jpg", "width": 204, "cloudinary_id": "pkwpuaoiupsixu1ywqse", "height": 185}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/joirgjjn1ugzfplmx8vc.jpg", "width": 204, "cloudinary_id": "joirgjjn1ugzfplmx8vc", "height": 185}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wbkfjgoveqoougkekhsz.jpg", "width": 259, "cloudinary_id": "wbkfjgoveqoougkekhsz", "height": 194}], "id": 8603}, {"genres": [8], "summary": "Quest for the Shaven Yak Starring Ren & Stimpy is a 2D Platformer game, developed by Realtime Associates and published by Tec Toy, which was released in South America in 1993.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wnfvaezlgnnyf9qaixlj.jpg", "width": 245, "cloudinary_id": "wnfvaezlgnnyf9qaixlj", "height": 350}, "id": 7986, "name": "Quest for the Shaven Yak Starring Ren Hoëk and Stimpy"}, {"genres": [8], "summary": "Férias Frustradas do Pica-Pau (roughly translated as Woody Woodpecker's Frustrated Vacations) is a platform game developed and published by Tectoy and released exclusively in Brazil for the Sega Mega Drive and Sega Master System. It stars cartoon character Woody Woodpecker on a quest to save his friends. \n \nFérias Frustradas do Pica-Pau is unusual in that it keeps a non-shaded cartoon style throughout the entire game.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/juvtgc1yrubwgdrfzwdl.jpg", "width": 200, "cloudinary_id": "juvtgc1yrubwgdrfzwdl", "height": 284}, "id": 8011, "name": "Férias Frustradas do Pica-Pau"}, {"genres": [12, 31], "name": "Ys: The Vanished Omens", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hh9g1icna6balurtcuuo.jpg", "width": 1019, "cloudinary_id": "hh9g1icna6balurtcuuo", "height": 1336}, "summary": "The hero of Ys is an adventurous young swordsman named Adol Christin. As the story begins, he has just arrived at the Town of Minea, in the land of Esteria. He is called upon by Sara, a fortuneteller, who tells him of a great evil that is sweeping the land. \n \nAdol is informed that he must seek out the six Books of Ys. These books contain the history of the ancient land of Ys, and will give him the knowledge he needs to defeat the evil forces. Sara gives Adol a crystal for identification and instructs him to find her aunt in Zepik Village, who holds the key to retrieving one of the Books. With that, his quest begins.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/fjqxki13y3pkjb1u9sqb.jpg", "width": 320, "cloudinary_id": "fjqxki13y3pkjb1u9sqb", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i6zuffk4r2gmmnaf1ayc.jpg", "width": 320, "cloudinary_id": "i6zuffk4r2gmmnaf1ayc", "height": 200}], "id": 2411}, {"genres": [8], "summary": "Wham!!! Biff1!! Pow!!! Asterix is back in another highly exciting adventure. Yet again Asterix and his good friend Obelix are thrown into an amazing adventure, when they find out that Getafix and Dogmatix have been kidnapped by the Romans. Asterix and Obelix must defeat the Romans and bring their friends back home!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/om4m1ntcsb17yqqpsu4r.jpg", "width": 209, "cloudinary_id": "om4m1ntcsb17yqqpsu4r", "height": 294}, "id": 8501, "name": "Asterix and the Great Rescue"}, {"genres": [10, 13], "name": "Super Monaco GP", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qxbmviuaxbzyrrstkfkq.jpg", "width": 220, "cloudinary_id": "qxbmviuaxbzyrrstkfkq", "height": 158}, "summary": "A superb Formula One racing game from Sega that took sprite-scaled graphics to a whole new level. The game's single track offered a very reasonable representation of the famous Monaco Grand Prix circuit. \n \nPlayers could chose to race with one of three different skill/gear settings : \n \nBeginner : Automatic Gears \n \nIntermediate : 4-Speed Manual gears \n \nProfessional : 7-Speed Manual Gears \n \nBefore entering the Grand Prix, a qualification lap had to be completed. In the event of qualifying, the qualifying time determined the player's position on the starting grid. During the race itself, checkpoints had to be reached within a set time, or the race was over.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gtlssmt1jkhd9qjumohi.jpg", "width": 1440, "cloudinary_id": "gtlssmt1jkhd9qjumohi", "height": 1008}], "id": 4528}, {"genres": [8], "name": "Master of Darkness", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j5edfccl6gaku3yukepb.jpg", "width": 256, "cloudinary_id": "j5edfccl6gaku3yukepb", "height": 375}, "summary": "The shadow of Dracula has spread over Victorian England. Make your way through strange and forbidding streets and cavernous warehouses while fighting his army of monsters. Find Dracula, the Master of Darkness, and rescue England from his terrifying grasp.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jjmtaokythgdirahpabb.jpg", "width": 640, "cloudinary_id": "jjmtaokythgdirahpabb", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mvhgzmtucjkpbqvqjs3i.jpg", "width": 640, "cloudinary_id": "mvhgzmtucjkpbqvqjs3i", "height": 480}], "id": 8039}, {"genres": [8], "summary": "Oooooh, that mouse! If there's one thing Tom can't stand, it's a rascally rodent named Jerry, and if that mouse isn't careful, Tom is going to nab him. But Jerry is pretty tricky. So muster up all your feline courage, Tom, 'cause there's a dangerous little mouse in the house!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r0uksxr1m5jqbyk7wsxy.jpg", "width": 188, "cloudinary_id": "r0uksxr1m5jqbyk7wsxy", "height": 268}, "id": 8043, "name": "Tom and Jerry: The Movie"}, {"genres": [8, 31], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/shsijllainbd4lhg4p3u.jpg", "width": 220, "cloudinary_id": "shsijllainbd4lhg4p3u", "height": 301}, "id": 8066, "name": "Taz-Mania"}, {"genres": [31], "summary": "You play as Taz, the famous cartoon-character. Taz is captured by Marvin the Martian and transfered to his intergalactic Zoo! Now it is your job to aid Taz in his great escape from the Zoo-prison and also find a way back home to Earth. To make the escape a little easier, there are items placed here and there, such as cakes which make regain your health. You also find gas tanks, which you can eat and then breath fire.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s6durwxz3xob4apzkqqb.jpg", "width": 220, "cloudinary_id": "s6durwxz3xob4apzkqqb", "height": 309}, "id": 8065, "name": "Taz in Escape From Mars"}, {"genres": [5, 8], "name": "James Bond 007: The Duel", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yt5scgaylhik5blgougn.jpg", "width": 700, "cloudinary_id": "yt5scgaylhik5blgougn", "height": 1032}, "summary": "The Duel is a James Bond video game released for the Sega Master System, the Sega Game Gear, and the Sega Mega Drive / Genesis. The game was developed and published by Domark and released in 1993.\nArmed with a pistol, the player controls James Bond through various side-scrolling enemy bases to rescue female hostages and arm a bomb placed at a strategic point to destroy the base. Along the way, Bond must battle numerous thugs and familiar bosses.\nThe game is notable among Bond games for a number of reasons. Although it was released 4 years after Timothy Dalton's last outing as James Bond, his likeness is used in the game, most notably the opening screens, thus making it Dalton's last appearance in a Bond game to date. It was also the final Bond game to be released by Domark. It was also the first Bond game not to be directly based on a movie or novel. Instead it featured an original storyline, albeit one featuring familiar villains including Jaws and Oddjob. Though the game's storyline was not its strong point, it did blaze a trail for future licence-holders EA, half of whose Bond output would be based on original storylines. One previous Bond game, Operation Stealth, included an original storyline but the game was originally based on a generic Bond-style character named John Glames and only had the licence added for its North American release.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cpgkzltdmesm38grlfu3.jpg", "width": 640, "cloudinary_id": "cpgkzltdmesm38grlfu3", "height": 480}], "id": 1637}, {"genres": [8], "summary": "Smurf to the rescue! Gargamel has already captured 4 Smurfs, Jocky Smurf, Greedy Smurf, Brainy Smurf and Smurfette. To free them you will have to smurf the Angry Smurfs and BUZZ flies before smurfing the mountain by sled, then smurfing the maze mine galleries, smurfing on the back of a stork to smurf Azrael and finally smurf Gargamel from his mansion! \nGood Smurf!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p1tahy0cidaizkca4rls.jpg", "width": 271, "cloudinary_id": "p1tahy0cidaizkca4rls", "height": 186}, "id": 8083, "name": "The Smurfs"}, {"genres": [31], "name": "Desert Speedtrap Starring Road Runner & Wile E. Coyote", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eqkggapwgnl0ttjv31tb.jpg", "width": 220, "cloudinary_id": "eqkggapwgnl0ttjv31tb", "height": 318}, "summary": "This is a platform game starring Looney Tunes famous Road Runner(who you control) and nemesis Wile E. Coyote. Road Runner can jump, eat birdseed to replenish life and run, of course! Holding the D-pad down speeds him up. The clock is ticking and if you run out of time a try is lost, collecting stars adds time to the clock \n \nThere are various items/powerups and bonus areas \n \n3 difficulty settings, choice to play with or without music and/or sound effects and an option to play the game music while not in game", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/f5ofdfksukfvnc9vvr3v.jpg", "width": 1440, "cloudinary_id": "f5ofdfksukfvnc9vvr3v", "height": 1080}], "id": 8098}, {"genres": [8], "summary": "Night falls at the Smurf Village. Inquisitive Smurf brings Smurfette along to Papa Smurf's laboratory to see the Magic Crystal that allows them to travel to anywhere in the world, but suddenly Smurfette breaks it, and they are gone! Now they must face the challenges in all continents in order to retrieve all shards of the Crystal and return home. (In the Master System and the portable versions of this game, there is also the additional task of cleaning the various regions of the world that the two Smurfs visit of its pollution.)", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/popjft4j4hv1eme8clmh.jpg", "width": 240, "cloudinary_id": "popjft4j4hv1eme8clmh", "height": 171}, "id": 4402, "name": "The Smurfs Travel the World"}, {"genres": [8], "summary": "Mickey finds himself in a fairy tale land where an evil Phantom-in-the-Clouds has stolen a special gem which brought peace and prosperity to a tiny village. It's up to you to help him save the day - and earn a place in Minnie's heart!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ero651vvv7q48yp7pllc.jpg", "width": 252, "cloudinary_id": "ero651vvv7q48yp7pllc", "height": 357}, "id": 8123, "name": "Land of Illusion Starring Mickey Mouse"}, {"genres": [8], "summary": "Mickey is tricked into a perilous quest when the kingdom is threatened by an evil cloud of darkness. As temporary king, Mickey must solve riddles, find maps and avoid trickery across 5 magical lands to save the Tree of Life from the cowardly King Pete.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dkpvbjxorslup5tqbjv4.jpg", "width": 192, "cloudinary_id": "dkpvbjxorslup5tqbjv4", "height": 262}, "id": 8125, "name": "Legend of Illusion Starring Mickey Mouse"}, {"genres": [8], "summary": "Presenting the world famous Daffy Duck P.I. Armed with your lethal bubble gun, search the Hollywood film sets for Yosemite Sam's Golden Cartoon World Movie Awards and the despicable Mad Professor Duck Brain.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l3k6u3ne1xmgu1mhjigt.jpg", "width": 1430, "cloudinary_id": "l3k6u3ne1xmgu1mhjigt", "height": 2025}, "id": 4461, "name": "Daffy Duck in Hollywood"}, {"genres": [2, 9, 31], "name": "King's Quest: Quest for the Crown", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hxp76eecxalg9kvk1bmp.jpg", "width": 709, "cloudinary_id": "hxp76eecxalg9kvk1bmp", "height": 881}, "summary": "In King’s Quest: Quest for the Crown, become Sir Graham, bravest of knights. Locate and return to King Edward the three great lost treasures of the Kingdom of Daventry in order to inherit the throne. \n \nEnter a world of adventure from Sierra and Roberta Williams. \n \nThe world of King's Quest is a world of high fantasy, perilous quests, and legendary adventure. It is a world where courage triumphs over adversity, and where bravery is royally rewarded. \n \nRoberta Williams' King's Quest I: Quest for the Crown first appeared in 1984, and began a tradition of family computer entertainment unequaled to this day. More people have played King's Quest games than any other adventure series in history. \n \nNow this classic game, rich in delightful characters and puzzling plot twists, returns in a beautiful new version, completely re-drawn and re-animated, with added music and sound. The same entertaining and enchanting game as ever, with a whole new dimension of realism.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/skrttpiswjnzxbmg1rmm.jpg", "width": 320, "cloudinary_id": "skrttpiswjnzxbmg1rmm", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qd4r1rdkw02vhwddbz81.jpg", "width": 640, "cloudinary_id": "qd4r1rdkw02vhwddbz81", "height": 400}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uipoysyxgvadwg9ivudh.jpg", "width": 320, "cloudinary_id": "uipoysyxgvadwg9ivudh", "height": 200}], "id": 892}, {"genres": [33], "name": "Back to the Future Part III", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cmcz4pho6gib6lfmc1iw.jpg", "width": 725, "cloudinary_id": "cmcz4pho6gib6lfmc1iw", "height": 913}, "summary": "There's no time like the past and there's no time to lose!\n\nGreat Scott! Doc's flashed himself back to 1885, into the arms of his future bride Clara Clayton, and right into the hands of Hill Valley's most vicious varmint, Buford \"Mad Dog\" Tannen. And Marty's learned that Doc is just a few days away from being deep sixed. So saddle up the DeLorean and bring Doc back to the future before he makes a no-return ride to Boot Hill.\n\nJump, shoot and duck past runaway suitcases, trunks, chicken crates, vultures, Indians, boulders, logs and more. Power up with three way shooting shotguns to get through the Indians arrows and cavalry's bullets. Keep an eye on the clock as you blast away at cutouts of Buford and his gang, flying geese, bonus ducks and more.\n\nYou're cornered by Buford's bad guys so whip those pie trays and try to take them out. Punch, crawl, duck and jump across the racing rail cars to get to the DeLorean. \n\nPlay both leading roles - Doc and Marty - during this fun, pistol packin' arcade action adventure inspired by the scenes from the smash hit movie.\n\nFour part rescue chase has you racing across the plains dodging danger, and galloping through a gauntlet of enemy crossfire to save Doc's sweetheart, Clara.\n\nTake aim at the first person perspective Shooting Gallery. Practice mowing down Mad Dog, his cronies and a wild western assortment of fast moving targets.\n\nIt's tin vs. lead as you pit your supply of pie trays against Buford's gang and their six shooters.\n\nAtop the speeding hijacked train you'll have to save your own caboose while collecting speed logs. It's the trickiest obstacle course ever to ride the rails.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/smonrdnca8q0dczsc1tl.jpg", "width": 320, "cloudinary_id": "smonrdnca8q0dczsc1tl", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lfrlyvje10c2ukn9nqnn.jpg", "width": 320, "cloudinary_id": "lfrlyvje10c2ukn9nqnn", "height": 256}], "id": 8519}, {"genres": [8, 15, 33], "name": "Bubble Bobble", "videos": [{"video_id": "ZVLcmx7kW7s", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fvvjot97a8ia4xwzjy3i.jpg", "width": 352, "cloudinary_id": "fvvjot97a8ia4xwzjy3i", "height": 494}, "summary": "In the game, each player controls one of the two Bubble Dragons, Bub and Bob. The player can move along platforms, as well as jump to those above and to the side, similar to most platform games. \n \nThe player can also blow bubbles. These can trap enemies, who are defeated if the bubble is then burst by the player's spiny back. Bubbles that contain enemies can be popped at the same time resulting in different foods being projected around the level. Each enemy trapped in a bubble equates to a different food. Food is consumed and transferred to points (an increasing scale of 1000 points is awarded for each enemy burst in tandem with another meaning: one enemy burst equals one food item worth 1000 points, two enemies burst equals two food items worth 1000 and 2000 points, three enemies burst equals three food items worth 1000, 2000 and 4000 points, and so on), which results in earning lives. These same bubbles also float for a time before bursting, and can be jumped on, allowing access to otherwise inaccessible areas. Players progress to the next level once all enemies on the current level are defeated. \n \nEnemies turn \"angry\" — becoming pink-colored and moving faster — if they are the last enemy remaining, escape from a bubble after being left too long or a certain amount of time has been spent on the current level. A monster will also become angry if either player collects a skull (the only negative item in the game), and the monster is hit by the resulting comet crossing the screen (however, this is a rare occurrence). \n \nAfter a further time limit expires, an additional invincible enemy appears for each player, actively chasing them using only vertical and horizontal movements. These do not need to be defeated to complete the level, and disappear once a player's life is lost. \n \nContact with enemies and their projectiles (rocks, lasers, fireballs, etc.) results in death.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hwbgrtxakeodkfwzlppe.jpg", "width": 800, "cloudinary_id": "hwbgrtxakeodkfwzlppe", "height": 750}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/el9zsctos0tamlhg2aat.jpg", "width": 540, "cloudinary_id": "el9zsctos0tamlhg2aat", "height": 506}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nckph4earsembk75t6mi.jpg", "width": 540, "cloudinary_id": "nckph4earsembk75t6mi", "height": 506}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/t7oo9mhc4yeodrutksgu.jpg", "width": 540, "cloudinary_id": "t7oo9mhc4yeodrutksgu", "height": 506}], "id": 2630}, {"genres": [5, 8, 31], "name": "Alien³", "videos": [{"video_id": "jsKzeo5RXuo", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fake7ncywh8afhenybc1.jpg", "width": 250, "cloudinary_id": "fake7ncywh8afhenybc1", "height": 350}, "summary": "Alien³ was released after the Alien 3 film. After success on the Super Nintendo and Genesis platforms, the game was built and ported to other systems, including the Commodore 64 and Game Gear. The game is set on the world of the film, Fury 161, but the gameplay has more in common with the film Aliens, throwing wave after wave of enemies at the player.", "storyline": "Loosely based off of the movie franchise, the main character Ripley arrives at Fiorina \"Fury\" 161, and she finds the planet is infested by Xenomorph Runnera. She is equipped with Colonial Marine equipment to defend herself while rescuing prisoners that are captured by the Aliens.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vrhrnif7e8nn2gy61zmg.jpg", "width": 800, "cloudinary_id": "vrhrnif7e8nn2gy61zmg", "height": 585}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ymhwoff8klxpxekccwji.jpg", "width": 640, "cloudinary_id": "ymhwoff8klxpxekccwji", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aziwtkukbkydayirxbzd.jpg", "width": 640, "cloudinary_id": "aziwtkukbkydayirxbzd", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bzaazyymcersos1ooidd.jpg", "width": 638, "cloudinary_id": "bzaazyymcersos1ooidd", "height": 477}], "id": 8908}, {"genres": [33], "name": "Spy vs Spy", "videos": [{"video_id": "LJC7DIP5JIw", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rxly0kzdxgl7sebqobth.jpg", "width": 256, "cloudinary_id": "rxly0kzdxgl7sebqobth", "height": 360}, "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/dbxjdf3c4rzrkhl1qoai.jpg", "width": 568, "cloudinary_id": "dbxjdf3c4rzrkhl1qoai", "height": 320}], "id": 9166}, {"genres": [8, 31], "name": "Mônica no Castelo do Dragão", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xfxmiznczs2ldjn4esch.jpg", "width": 676, "cloudinary_id": "xfxmiznczs2ldjn4esch", "height": 505}, "summary": "Monica at the Castle of the Dragon is a game Sega Master System released by Brazilian Tec Toy in 1991 , starring the character of comics , Monica . The game is an official graphical and textual reprogramming made ​​by Tectoy , in partnership with Mauricio de Sousa Productions , authorized by Sega , the original game Wonder Boy in Monster Land . The game had a sequel called Monica in Rescue , and a remake Mega Drive, called Monica in the Land of Monsters . The two also were modified versions of games Wonderboy series.\n\nThe game became one of the great successes of the Master System, having accompanied the island both in normal version and a pink version, to attract girls. He has also been adapted for comics Monica in an edition.\n\nThe game is a platform in which players control Monica, armed with her ​​stuffed rabbit Samson (replacing the Wonder Boy of spades). Monica has to go through twelve stages, each with monsters, items and own scenarios. The left and right arrows to walk, up arrow enters the house down active magic button, A button attacks and selects items in stores, and the B jumps and passes lines. Each city has a store to purchase items that include shield, armor, boots and magic. Monica initially has 5 hit points represented by hearts, which will be wearing when she is attacked by enemies. New hearts are won every 100,000 points, which are earned by winning stages. An hourglass representing the time to complete the phase appears along the top, and when it is exhausted Monica begins to lose life. Collect small hourglasses or visit hotels and hospitals restores the time.", "storyline": "The Ugly Captain and his army wants to dominate the world and leave it dirty. And so, Monica boards to prevent it, buying boots , shields , gowns (replacing armor) and Sanctions (the stuffed rabbit, replacing swords) to strengthen. But, despite the dragon of the title as the last boss , Captain Ugly not appear in the game, except on the title screen.\n\nEarly in the game it is revealed that the mission of Monica is super-dangerous by a witch with her crystal ball. Only she can beat Captain Ugly and its allies. For that Monica should leave for an adventure, but if Monica fail will be transformed into a monster polluted and dirt.", "id": 9557}, {"genres": [14], "name": "Speedball", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/a3o9npagthhqobgwrsdy.jpg", "width": 1134, "cloudinary_id": "a3o9npagthhqobgwrsdy", "height": 1376}, "summary": "Speedball is a futuristic football-like game which takes place on a steel walled floored pitch, 160 feet long by 90 feet wide. There are two teams, and the team scoring the most goals wins. There is a goal at each end of the pitch and a ball warp tunnel in each side of the wall. The warp tunnels can warp a ball from one tunnel to another. The ball is launched from the center of the pit by the automatic launcher in a random direction. There also bounce domes, off of which the ball will be deflected, but over which players are free to move.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ookolvjo6kur9rhotggo.jpg", "width": 643, "cloudinary_id": "ookolvjo6kur9rhotggo", "height": 404}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/chqpbif7a6a3e5yio5av.jpg", "width": 645, "cloudinary_id": "chqpbif7a6a3e5yio5av", "height": 574}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tlx1jl8ed401cpzcsbhy.jpg", "width": 644, "cloudinary_id": "tlx1jl8ed401cpzcsbhy", "height": 574}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ogkawuc9hr7befkzwarb.jpg", "width": 644, "cloudinary_id": "ogkawuc9hr7befkzwarb", "height": 574}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/it7aq6mwtzwsnnzloivj.jpg", "width": 643, "cloudinary_id": "it7aq6mwtzwsnnzloivj", "height": 573}], "id": 10151}, {"genres": [25], "name": "Streets of Rage", "videos": [{"video_id": "sLpS_s1PaXM", "name": "Gameplay video"}, {"video_id": "MXjaCkPWpvU", "name": "Game intro"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/so3nydnezx136deqo7pc.jpg", "width": 640, "cloudinary_id": "so3nydnezx136deqo7pc", "height": 895}, "summary": "Streets of Rage (ベアナックル 怒りの鉄拳 Bea Nakkuru: Ikari no Tekken?, \"Bare Knuckle: Furious Iron Fist\") is a side-scrolling beat 'em up video game developed and published by Sega in 1991 for Mega Drive/Genesis. It is the first installment of the Bare Knuckle/Streets of Rage series which was followed by Streets of Rage 2 and Streets of Rage 3. The game was converted to Game Gear, Sega CD and Master System. In 2007, the game was released for the Wii's Virtual Console in North America and Europe, and in 2009 it was released for the iOS via the App Store. It was again made available as part of Sonic's Ultimate Genesis Collection in 2009 on both the PlayStation 3 and Xbox 360 consoles.", "storyline": "The once peaceful city has been taken over by a criminal syndicate, including factions of the police. Mass violence is now common and no one is safe. Adam Hunter (an accomplished boxer), Axel Stone (skilled martial artist) and Blaze Fielding (judo expert) are young ex-police officers who have quit the force to fight back against the syndicate. \nDepending on whether the game is played as one-player or a two-player co-op, and whether the player accepts or rejects Mr. X's offer to join his henchmen, there is a possibility for an alternate ending where the player becomes the new head of the crime syndicate.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/dgzny6lsebonawh8b3hs.jpg", "width": 640, "cloudinary_id": "dgzny6lsebonawh8b3hs", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zzqzpcvoqrbi5x6su5mz.jpg", "width": 640, "cloudinary_id": "zzqzpcvoqrbi5x6su5mz", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ihmklwo06d83qnlpkyl5.jpg", "width": 640, "cloudinary_id": "ihmklwo06d83qnlpkyl5", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/l1mxjtivfaewzetl2ffh.jpg", "width": 640, "cloudinary_id": "l1mxjtivfaewzetl2ffh", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hfakhjocgmcwbdodqm8t.jpg", "width": 320, "cloudinary_id": "hfakhjocgmcwbdodqm8t", "height": 240}], "id": 1652}, {"genres": [5, 25, 33], "name": "Alien Storm", "videos": [{"video_id": "raf0jdiWV5I", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zfhbksjfls0kb4qxgaz5.jpg", "width": 640, "cloudinary_id": "zfhbksjfls0kb4qxgaz5", "height": 913}, "summary": "Alien Storm is a side-scrolling beat 'em up. The game resembles Golden Axe, with a similar artistic style, three playable characters (a man, a woman, and a novelty character) and pick-up or power-up special attacks. The player (one player only on the Master System version, up to two players on the Mega Drive version, three on the arcade version) selects from the three different characters to embark upon a quest to save the Earth from an alien invasion. \n \nAll of the Busters are playable from the beginning of the game. There are 6 missions to complete (8 in the Mega Drive version) with several stages, and each mission has the player blasting aliens, from the streets to the mother ship, where the mother of all aliens can be found. This task becomes increasingly difficult with each new mission, and the aliens are capable of hiding inside objects such as plants, postboxes, trashcans, drums, and other items. Each mission has an objective such as rescuing people or destroying an UFO. \n \nWhen dealing with a few aliens, flying heads will appear, which can be shot to collect life or energy. Energy is used specifically to power the energy based attacks of the player's weapon (such as flames or electricity) and to use the much more powerful special weapons. \n \nIn a similar format as other early Sega arcade games, each character has unlimited usage of various short-range attacks, i.e. punches, kicks. Along with these standard attacks, each character has their own individual weapon (Garth's weapon that shoots lightning is replaced with a flame weapon in the Master System version). Special attacks are also included, and vary depending on the character chosen at the start of the game. For instance, Garth summons an U.S. Air Force starship that drops bombs across the street (in the Master System version he has Karen's special, a ballistic missile strike). Scooter will teleport out of his present location and leave a series of bombs that will blow up on the appearance of aliens, after which he will re-appear (in the Mega Drive version he just explodes, leaving his head, which his new body returns to retrieve). Karen calls down a nuclear missile, which incinerates every foe on the screen. However, a large amount of energy is depleted by using each character's special attack, and cannot be used if the energy of the player's character is too low. \n \nThere are few bosses in the game. The arcade original only features a single boss that has three distinct forms. The Mega Drive port has two of these forms as two separate bosses. At the end of each mission, the side-scrolling gameplay shifts to either a shooting gallery perspective where the player must take out the aliens that pop out of various locations, similar to the bonus stages of Shinobi and Shadow Dancer, both also by Sega, or a running section that is similar to the side scrolling mode but plays like a horizontal shooter instead with projectile weapons.", "storyline": "Vicious predators from the far ends of the universe are invading our planet! They’re mean and wicked, creating havoc everywhere they go! Time for the aptly named “Alien Busters” to take control: Karen (absent in the Master System version, named \"Karla\" in some versions), Garth (named \"Gordon\" in some versions) and Scooter (the robot, named \"Slammer\" in Master System and PAL versions). \n Get nasty and kick some serious martian butt!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/wfyiuc3u2hwffpah8njc.jpg", "width": 500, "cloudinary_id": "wfyiuc3u2hwffpah8njc", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/elqsihhfprlsbbyztjcu.jpg", "width": 500, "cloudinary_id": "elqsihhfprlsbbyztjcu", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hadj93ugxzml7uexdjp5.jpg", "width": 640, "cloudinary_id": "hadj93ugxzml7uexdjp5", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/anvxunzggrhn2wyvymoh.jpg", "width": 620, "cloudinary_id": "anvxunzggrhn2wyvymoh", "height": 434}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/echkcn8ntgqefmgo8xkt.jpg", "width": 640, "cloudinary_id": "echkcn8ntgqefmgo8xkt", "height": 512}], "id": 9969}, {"genres": [8], "name": "Indiana Jones and the Last Crusade: The Action Game", "videos": [{"video_id": "QRk-rq0bezk", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hwgtppwjunslvkhmqw1d.jpg", "width": 1600, "cloudinary_id": "hwgtppwjunslvkhmqw1d", "height": 2037}, "summary": "A two-fisted action game from the people who brought you the smash hit movie. \n \nThe chase is on...all the way to the greatest treasure in history, the Holy Grail. And if you can survive the treacherous caves of Colorado...the medieval catacombs of Venice...the deadly ramparts of Schloss Brunwald...and the cunning traps of the Grail Temple...then you've earned your whip and your hat! \n \nWhip those bad guys...as only Indy can! Relive the greatest action scenes from the greatest Indy movie of them all. \n \nIt's red hot, slam-bam action, Indiana Jones and LucasFilm style!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kxrsizyzs0lzttdthnln.jpg", "width": 320, "cloudinary_id": "kxrsizyzs0lzttdthnln", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/w85bgx6pi38o5hjfggqx.jpg", "width": 288, "cloudinary_id": "w85bgx6pi38o5hjfggqx", "height": 200}], "id": 185}, {"genres": [31], "name": "Home Alone", "videos": [{"video_id": "JJghFOyHzFo", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nkjp0dbh0j3ocokrmtw8.jpg", "width": 588, "cloudinary_id": "nkjp0dbh0j3ocokrmtw8", "height": 826}, "summary": "Harry and Marv, the bumbling \"Wet Bandits,\" have paid their debt to society and are now ready to get revenge on the youngster that caused them their humiliating defeat Kevin McCallister. They have arranged for Kevin's family to be out of the house when they come calling again, leaving him home alone for their rematch. This time, the sneaky thieves have beefed up their gang with robbers and crooks that are more than eager to help themselves to the McCallister valuables. Only the resourceful Kevin stands between the new Wet Bandit gang and his family's fortune.", "storyline": "There are multiple versions of the game and each features a different style of gameplay, but all share the same plot and roughly the same objective: Kevin McCallister is left home alone when his family goes on vacation. He must prevent Harry and Marv, the \"Wet Bandits\", from burglarizing his home, using various household objects as traps and/or weapons. Each version of the game is an example of the trap-em-up genre, which also includes games like Heiankyo Alien, Space Panic, and Lode Runner.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/u8v9p2me5vve31dgzxia.jpg", "width": 1024, "cloudinary_id": "u8v9p2me5vve31dgzxia", "height": 676}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/v1ibtmg9sg0ym3diqr6w.jpg", "width": 960, "cloudinary_id": "v1ibtmg9sg0ym3diqr6w", "height": 720}], "id": 4523}, {"genres": [8, 9], "name": "Mickey's Ultimate Challenge", "videos": [{"video_id": "hhvMj_Fpl7Q", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q0zk8ma6jto0wamrdbgf.jpg", "width": 640, "cloudinary_id": "q0zk8ma6jto0wamrdbgf", "height": 638}, "summary": "Mickey's Ultimate Challenge is a puzzle game for the Super NES, Game Boy, Genesis/Mega Drive, Sega Master System, and Game Gear. The Master System version, released in 1998, was the last game ever released for that console.[3] All other versions were released in 1994. It was rated for all ages, aimed toward younger children, and was designed for only one player. Players move Mickey through the game by making him walk, jump, and go through doors. There are five major challenges, a segue, and a final challenge. It has met with mixed reviews from gaming magazines. It is also the first title developed by WayForward Technologies, under the name Designer Software.", "storyline": "Five Magical Puzzles\nFull Of Family Fun!\n\"The sky is rumbling!\nThe sky is rumbling! What ever can it be?\" cry the citizens of Beanwick.\n\"Is it a storm? Is it a monster? Is it the end of the Kingdom?\" I don't know, but I'll find out, says Mickey, \"if I have to search every room in the Castle of Beanwick to solve the mystery!\"\nIn Mickey's Ultimate Challenge, volunteer as Mickey or Minnie to help the Kingdom of Beanwick solve the mystery of the rumblings in the sky. But, first you must prove worthy of the challenge--by thinking your way through a series of fiendishly clever puzzles, players from 4 to 104 can take full advantage of the game's interactive capabilities to put their critical thinking skills to the ultimate test. Five incredible locations!\nFive brain-teasing challenges starring many of your favorite Disney characters. Solve them all for a chance to see what's really up, up there!\nIs this all a dream? Play Mickey's Ultimate Challenge and decide for yourself!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/p71fyaak8nk0sissesl5.jpg", "width": 480, "cloudinary_id": "p71fyaak8nk0sissesl5", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rbzakn6fppu7wvsbed4t.jpg", "width": 480, "cloudinary_id": "rbzakn6fppu7wvsbed4t", "height": 360}], "id": 18628}, {"genres": [4], "name": "Mortal Kombat 3", "videos": [{"video_id": "ikWeup2QW6I", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ekf2wwvzogrgig5qpxkr.jpg", "width": 488, "cloudinary_id": "ekf2wwvzogrgig5qpxkr", "height": 483}, "summary": "Mortal Kombat 3 (MK3) is a fighting game developed by Midway Games and first released into arcades in 1995 as the third game in the Mortal Kombat series. As in the previous games, it has a cast of characters that players choose from and guide through a series of battles against other opponents. The game avoids the tournament storyline of its predecessors, as various warriors instead fight against the returning Shao Kahn, who has resurrected his bride Sindel and started an invasion of Earthrealm.\nThe third installment of Mortal Kombat retains the blood and gory attacks that defined the series. It introduces new types of the Fatality finishing moves, including Animalities. Other features new to the series were combos, predefined sequences used to perform a series of consecutive attacks. A \"Run\" button was also added, allowing players to briefly dash toward the opponent, as were \"Kombat Kodes\", an unlockable content system using various symbols that can be entered before two-player matches to achieve certain effects.\nSome characters from the previous games returned and new characters were introduced into the series. Mortal Kombat 3 notably omitted popular characters from previous games, some of whom were added in an update, Ultimate Mortal Kombat 3, released later in 1995. The PC and home console-exclusive Mortal Kombat Trilogy (1996) added even more characters, as well as other new features.", "storyline": "Mortal Kombat 3 builds further on the gameplay of the previous game. A \"Run\" button, accompanied by a \"Run\" meter, was introduced. This was primarily to address concern from fans who thought that the previous games gave too much of an advantage to the defending player. The Run meter is drained by running (the character cannot run backwards, only forwards) and by performing combos.\n\"Chain combos\", also known as pre-programmed combos (labeled \"dial-a-combos\") were also introduced. Chain combos are button sequences that cannot be interrupted once one hit connects; some chain combos end with an uppercut or other move that knocks the opponent into the air, so that more damage can be dealt via a traditional juggle combo. To please players of various skill levels, a \"Choose Your Destiny\" screen appears in the single player mode to allow player-selectable difficulty.\nFor the first time, certain levels were interactive by allowing characters to uppercut each other through the ceiling where both characters would continue the battle in a different stage. This could alter the game's level cycle. Both normal uppercuts and uppercuts that are part of a ground combo would result in a level change. Kung Lao's \"Whirl Wind Spin\" move would also have the same effect. However, if the character is defeated by an uppercut, there is no level change.\nAll of the different styles of finishing moves featured in Mortal Kombat II (Fatalities, including the non-lethal Babality and Friendship moves) return in MK3. Additionally, the rumored Animality, where the character transforms into an animal in order to kill their opponent, is featured for the first time. Another new addition is the Mercy, where the character can give their opponent a small sliver of life if they have won two rounds and are at the \"Finish Him/Her\" screen. A Mercy is necessary for an Animality to occur. Finally, three new Stage Fatalities can be performed in the Subway, the Bell Tower and the Pit 3.\nAnother concept introduced in this game is the \"Kombat Kode\". A Kombat Kode is a six-symbol code entered at the VS screen in a two-player game to modify gameplay, fight hidden characters or display certain text messages. Also introduced in this game was the \"Ultimate Kombat Kode\", a 10-character code using symbols, that could be entered on the game over screen after the continue screen disappears in single player mode. It was used to unlock a robotic version of the character Smoke; it can be done by either the player or the arcade operator. The arcade owner could reset this code by accessing the game's diagnostic menu by toggling a DIP switch within the MK3 cabinet. The codes were revealed through gaming magazines, promotional material and other Mortal Kombat media.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/z7xmewnxmqha3ewssav6.jpg", "width": 480, "cloudinary_id": "z7xmewnxmqha3ewssav6", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i7mu9gd0zvij2ldwjw4t.jpg", "width": 400, "cloudinary_id": "i7mu9gd0zvij2ldwjw4t", "height": 300}], "id": 1620}, {"genres": [8, 31], "name": "Cosmic Spacehead", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pamddzwd1njhyzyo51an.jpg", "width": 630, "cloudinary_id": "pamddzwd1njhyzyo51an", "height": 801}, "summary": "Cosmic needs your help! He has no money, no car, and no respect from his fellow Cosmonaut's! The trouble is, no one believed his tale of discovering a far away planet called \"Earth\" so it's your job to help him get back there and take some handy snaps! Starting from his home town Old Lino Town, it's Cosmic gameplay all the way in a unique blend of adventure and arcade action plus a whole galaxy of surprises thrown in!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/g5yhubiz9fqnll3we487.jpg", "width": 320, "cloudinary_id": "g5yhubiz9fqnll3we487", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kg6bo7t5kazg2ckb2usq.jpg", "width": 320, "cloudinary_id": "kg6bo7t5kazg2ckb2usq", "height": 200}], "id": 12013}, {"genres": [5, 10, 33], "name": "Chase H.Q.", "videos": [{"video_id": "3-QvpB1cIow", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/e5kf5whqwgdch9zopxt8.jpg", "width": 522, "cloudinary_id": "e5kf5whqwgdch9zopxt8", "height": 640}, "summary": "At the start of each level the player is informed who they are pursuing, a great distance away: They must apprehend the criminal before their time limit expires. The criminal's car is constantly moving away, so if the player repeatedly crashes or drives too slowly, the criminal will escape. At some points during the game the road splits, and the correct turn must be taken, otherwise it will take longer to catch the criminal. When their vehicle is reached, the time limit is extended; the vehicle must be rammed a number of times until the criminal is forced to stop, then is arrested.\n\nThe game includes five levels. As both the initial time limit to reach the criminal and the time extension to ram the criminal are just 60 seconds, the game is very short - a player who is able to finish the game on one credit will enjoy at most ten minutes of game-play.\n\nInterestingly enough when Nancy at Chase HQ (at the start of every level) calls on the radio the frequency is always 144.X (various)Mhz. This is actually the 2-meter band of amateur or ham radio frequencies.\n\nAlthough superficially similar in technology to Sega's Outrun, Chase HQ features significant technical advancements over that title in the presentation of perspective, hills and track splits.", "storyline": "The player assumes the role of a police officer named Tony Gibson, member of the \"Chase Special Investigation Department.\" Along with his partner, Raymond Broady, he must stop fleeing criminals in high-speed pursuits.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ir6drqnaorndfzrhnut3.jpg", "width": 320, "cloudinary_id": "ir6drqnaorndfzrhnut3", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/h0yyoue9vgh54eut3sje.jpg", "width": 256, "cloudinary_id": "h0yyoue9vgh54eut3sje", "height": 224}], "id": 6802}, {"genres": [5, 15], "name": "Desert Strike: Return to the Gulf", "videos": [{"video_id": "RYVDt8XhTBM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gaw3afg1loubd7laxw1x.jpg", "width": 640, "cloudinary_id": "gaw3afg1loubd7laxw1x", "height": 900}, "summary": "Desert Strike: Return to the Gulf, commonly known as Desert Strike, is a shoot 'em up video game released by Electronic Arts (EA) in February 1992 for Sega's Mega Drive. The game was later released on several other formats such as the SNES, including a much upgraded version for the Amiga home computer. The game was inspired by the Gulf War and depicts a conflict between an insane Middle Eastern dictator, General Kilbaba, and the United States. The player controls a lone Apache helicopter and attempts to destroy enemy weapons and installations, rescue hostages and capture enemy personnel, while managing supplies of fuel and ammunition.", "storyline": "After terrorist leader General Kilbaba has seized control of an unnamed \"small but wealthy\" Gulf emirate, overthrown the monarchy and installed himself as dictator, the United States sends a lone helicopter to destroy his army in a series of swift strikes. The game's plot was felt by commentators to be a thinly disguised reference to the Gulf War, while comparisons were drawn between Kilbaba and Saddam Hussein, and between the game's unnamed desert setting and Iraq", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cxusupfchpxan2wgpkdk.jpg", "width": 320, "cloudinary_id": "cxusupfchpxan2wgpkdk", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p8libh8cr9glunjgqeux.jpg", "width": 320, "cloudinary_id": "p8libh8cr9glunjgqeux", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pxpcx6oxlsk5lpybfebv.jpg", "width": 512, "cloudinary_id": "pxpcx6oxlsk5lpybfebv", "height": 446}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jb57tb30vntxx7id9y7w.jpg", "width": 320, "cloudinary_id": "jb57tb30vntxx7id9y7w", "height": 256}], "id": 6798}, {"genres": [4, 8, 25, 33], "name": "Double Dragon", "videos": [{"video_id": "cy5f9ayBHbM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/brfsdesusepguypwilld.jpg", "width": 625, "cloudinary_id": "brfsdesusepguypwilld", "height": 795}, "summary": "The player character has a repertoire of martial art techniques which they can perform by using the joystick and three action buttons (kick, jump, and punch) individually or in combination. Techniques range from basic punches and kicks, to more elaborate manoeuvres like hair grabbing moves and elbow strikes. When playing with another player, one can assist the other by grabbing their partner's opponent from behind. Caution should be taken, though, as some enemies are able to do the same thing to the players. The player begins the game with a certain number of extra lives and a life gauge which depletes as the player takes hits. If the life gauge runs out or the time limit reaches zero, the player will lose a life.\n\nThere is a small variety of enemy characters that the player will face through the course of the game. Certain enemies carry melee weapons, which can be knocked out of their hands and picked up to use against them. Available weapons include baseball bats, whips, throwing knives, and dynamite; in addition, rocks, oil drums, and boxes can be found in certain places.\n\nThe game is divided into four different stages or \"missions,\" which consist of a city slum, a factory, the woods, and the gang's hideout. The game normally ends if a single player defeats the final boss alone. However, if two players manage to complete the game together, they are then forced to fight each other in order to determine who will win Marian's affections.", "storyline": "The player takes control of martial artist Billy Lee, or his twin brother Jimmy (also known as Hammer and Spike in the supplementary materials for the American arcade release), as they fight their way into the turf of the Black Warriors gang in order to rescue their common love interest Marian.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ftfk5zx4x9v5wf4wjzdy.jpg", "width": 480, "cloudinary_id": "ftfk5zx4x9v5wf4wjzdy", "height": 360}], "id": 6787}, {"genres": [31, 33], "summary": "Dizzy is an egg living in a world of magic and fantasy. The basic concept of the game is to move around the world, finding various items and collectibles, and to use them in the right locations. Dizzy has no special skills or abilities, save for his remarkable feats of somersaulting, and must solve all problems he faces with the clever use of one or more items.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j1n8fijaxzretihlynjt.jpg", "width": 640, "cloudinary_id": "j1n8fijaxzretihlynjt", "height": 812}, "id": 12089, "name": "Fantastic Dizzy"}, {"genres": [5], "name": "Operation Wolf", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mbgra6j17llekzp9qqkc.jpg", "width": 906, "cloudinary_id": "mbgra6j17llekzp9qqkc", "height": 640}, "summary": "In the steamy jungles of South America, heavily armed extremists are holding innocent civilians prisoner. Little do these terrorists know that real terror is about to land on their front porch! The sound of rotor blades and staccato bursts of gunfire echo through the valleys. Terrorists be warned! Operation Wolf is going to teach you what terror is all about!\n\nOperation Wolf consists of six missions, which are displayed on the Operations Map Screen. A mission is completed when all enemy forces are reduced to zero. The current level is completed when you escape from the airport with the prisoners. Your injury level increases when the enemy hits you. The game automatically ends if the injury indicator on the right side of the screen becomes completely red. You can reduce your injury level by getting power drinks.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yifvjbtqmpdybqqdddch.jpg", "width": 320, "cloudinary_id": "yifvjbtqmpdybqqdddch", "height": 200}], "id": 12190}, {"genres": [5, 33], "name": "R-Type", "videos": [{"video_id": "P-WPX4AsvOE", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zlanjdqihtrf4kcwybtp.jpg", "width": 300, "cloudinary_id": "zlanjdqihtrf4kcwybtp", "height": 424}, "summary": "R-Type is set in the 22nd century, and the player flies a futuristic fighter craft called the R-9a \"Arrowhead\", named for its shape, and because it is the ninth model in the 'R' series of fighter craft (but it is the first of the series to actually be used in combat; the previous models were all prototypes). The mission is to 'blast off and strike the evil Bydo Empire'. The R- in the series title originally stood for \"ray\", as in a ray of light. It was a reference to the many different types of ray-like weapons in the first R-Type. his was later retconned in R-Type Final to refer specifically to the production code as well as a term of endearment for the player fighter craft, the \"Round Canopy\".\n\nThe original R-Type was well received by most gaming critics. However, it was also infamous for its relentless difficulty. It earned 7th place in IGN's Top 10 most difficult games to beat. The gameplay of R-Type is noticeably distinct among shoot 'em ups. Invariably the player will lose, not because of an inequality in firepower, but because of the design of the levels themselves. There is usually a 'correct' way to get through a level, but players must learn these by experience - i.e. by losing and restarting from earlier in the level. The game innovated with its weapon system compared to contemporary shooters, featuring a chargeable shot (beam-meter), and detachable 'force' pod; levels were designed to require different tactics and ideal weapons (air-air, diagonal, or air-ground laser).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zakycibfdds0g86qnt0n.jpg", "width": 320, "cloudinary_id": "zakycibfdds0g86qnt0n", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j3ultnxeynvfhsngkqxf.jpg", "width": 256, "cloudinary_id": "j3ultnxeynvfhsngkqxf", "height": 256}], "id": 6840}, {"genres": [11, 13, 15], "name": "Populous", "videos": [{"video_id": "plX4VzG9_g4", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gdlnffdq2tmdodal7n34.jpg", "width": 256, "cloudinary_id": "gdlnffdq2tmdodal7n34", "height": 312}, "summary": "Miracles are child's play. Earthquakes are serious fun. The all-powerful can perform miracles in their sleep. But omnipotence isn't what it used to be. These days, it takes awesome natural disasters to dominate a world. You give them good land. You tell them when to farm and when to fight. You make them content beyond their wildest dreams. But then they become raging arsonists. What's a deity to do? Disasters are your divine prerogative - volcanoes, quakes, swamps. For stubborn non-believers, nothing beats a flood for spring cleaning. Cruel ice, lush grassland, parched desert... With 500 worlds, a deity's work is never done.\n\nPopulous is the original god-game, a strategy title that lets you shape the isometric isometric world and the fates of its inhabitants. Be sure to check out one of Bullfrog's earliest classics, from the mind of Peter Molyneux!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zxr5cfdeuroh2eeafven.jpg", "width": 640, "cloudinary_id": "zxr5cfdeuroh2eeafven", "height": 400}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eug5cxp0i1rcrfz4nm4b.jpg", "width": 768, "cloudinary_id": "eug5cxp0i1rcrfz4nm4b", "height": 512}], "id": 248}, {"genres": [5, 33], "name": "Mercs", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/awnimprqx61di6eilfro.jpg", "width": 630, "cloudinary_id": "awnimprqx61di6eilfro", "height": 790}, "summary": "The players are members of a covert counter-terrorist team of mercenaries known as the \"Wolf Force\". The aim of the game was to rescue the former President from rebels in the fictional African country of Zutula, which bears resemblance to the apartheid regime in South Africa. The game has six main levels, plus the final level where your mission is to rescue the former U.S. president from the Hercules Transport. The game's arsenal include real-world machine guns, shot guns, flame throwers, and grenade launchers. Several missions even have pilotable vehicles available.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/oulvv8mf05j70djgxede.jpg", "width": 320, "cloudinary_id": "oulvv8mf05j70djgxede", "height": 256}], "id": 4487}, {"genres": [4, 8], "name": "Zool", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eadky4cysuabfhoc4gx4.jpg", "width": 800, "cloudinary_id": "eadky4cysuabfhoc4gx4", "height": 1002}, "summary": "Once every year, the games world is rocked by a game so stunning, so fast, so colorful, so big, so demanding, so mega, so awesome, so varied, so incredible, and so full of fabulous features and unexpected treats, that everybody just looks at it and says \"THAT'S IT!\" This year, Zool, The Ninja From the Nth Dimension, is definitely \"IT!\"", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ndlot8gudrvy4hw2sbcp.jpg", "width": 320, "cloudinary_id": "ndlot8gudrvy4hw2sbcp", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kwhmhgzlcdubvprtbukj.jpg", "width": 320, "cloudinary_id": "kwhmhgzlcdubvprtbukj", "height": 256}], "id": 2547}, {"genres": [9, 15, 33], "name": "Rampart", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sp59udxogczfkbbng0wa.jpg", "width": 300, "cloudinary_id": "sp59udxogczfkbbng0wa", "height": 389}, "summary": "Rampart is a game combining strategy and artillery action. Build your castle from Tetris-style pieces, place your cannons, bombard the enemy, try to repair, do it all over again. The original arcade release has a single-player and a two-player mode; later revisions incorporate three-player gameplay.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ikfub651xpwj0mwfo1mk.jpg", "width": 320, "cloudinary_id": "ikfub651xpwj0mwfo1mk", "height": 200}], "id": 9684}, {"genres": [4], "name": "Mortal Kombat II", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jamebiyoftkhbgypxaje.jpg", "width": 698, "cloudinary_id": "jamebiyoftkhbgypxaje", "height": 1026}, "summary": "500 years ago, Shang Tsung was banished to the Earth Realm. With the aid of Goro he was to unbalance the furies and doom the planet to a chaotic existence. By seizing control of the shaolin tournament he tried to tip the scales of order towards chaos. Only seven warriors survived the battles and Shang Tsung's scheme would come to a violent end at the hands of Liu Kang. Facing execution for his failure and the apparent death of Goro, Tsung convinces Shao Kahn to grant him a second chance.. Shang Tsung's new plan is to lure his enemies to compete in the Outworld where they will meet certain death by Shao Kahn himself. Now, the Kombat continues...\n\nFollowing his defeat to Liu Kang, Shang Tsung begs his master, Shao Kahn, to spare his life. He tells Shao Kahn that the invitation for Mortal Kombat cannot be turned down, and if they hold it in Outworld, the Earthrealm warriors must attend. Kahn agrees to this plan, and restores Tsung's youth. He extends the invitation to Raiden, who gathers his warriors and takes them into Outworld. The tournament is dangerous, as Shao Kahn has the home field advantage, and an Outworld victory will unbalance the furies and allow Outworld to subdue Earthrealm.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/q5fqzywe1e5w7uktbe8v.jpg", "width": 480, "cloudinary_id": "q5fqzywe1e5w7uktbe8v", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/u6sbsqbfjnckmiiuzqla.jpg", "width": 452, "cloudinary_id": "u6sbsqbfjnckmiiuzqla", "height": 306}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/trv68dw9mj559emzwjqv.jpg", "width": 400, "cloudinary_id": "trv68dw9mj559emzwjqv", "height": 300}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vnnmg5zogmnc8vcgvtpe.jpg", "width": 1280, "cloudinary_id": "vnnmg5zogmnc8vcgvtpe", "height": 812}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dca0r150tljtbin6dadt.jpg", "width": 1280, "cloudinary_id": "dca0r150tljtbin6dadt", "height": 800}], "id": 1619}, {"genres": [10], "name": "Micro Machines", "videos": [{"video_id": "BMpZznee74I", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/acgmkiuatjpwroyxysjz.jpg", "width": 250, "cloudinary_id": "acgmkiuatjpwroyxysjz", "height": 350}, "summary": "Micro Machines is a classic racing game. Simple, fast-paced and lots of fun. You are given the control of miniature cars, choppers, speedboats, racecars, tanks, jeeps, formulas and many more vehicles to choose and about 20 different tracks to drive on. You'll have to race AI opponents or your friends on various locations such as kitchen desks, pool tables, workshops, school desks, gardens, bathtubs etc.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/a6oiltqjardzk9dbebng.jpg", "width": 240, "cloudinary_id": "a6oiltqjardzk9dbebng", "height": 210}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pqaxs9rovgugzy9oq54r.jpg", "width": 257, "cloudinary_id": "pqaxs9rovgugzy9oq54r", "height": 196}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vznsyperp3lhgqsieajz.jpg", "width": 318, "cloudinary_id": "vznsyperp3lhgqsieajz", "height": 159}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/da2uyejdeaq2jfjiupgg.jpg", "width": 259, "cloudinary_id": "da2uyejdeaq2jfjiupgg", "height": 194}], "id": 2703}, {"genres": [10], "name": "Ivan ''Ironman'' Stewart's Super Off Road", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lqq2z4zompqz4raewix9.jpg", "width": 630, "cloudinary_id": "lqq2z4zompqz4raewix9", "height": 767}, "summary": "Compact offroad races. Pick your site and win the world offroad tournament.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/uey9p9lvjurbazcy1am3.jpg", "width": 320, "cloudinary_id": "uey9p9lvjurbazcy1am3", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/homjg2tvbnr8mc7arngy.jpg", "width": 320, "cloudinary_id": "homjg2tvbnr8mc7arngy", "height": 200}], "id": 12735}, {"genres": [9], "name": "Shanghai", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iw337grsrs5lz8ms2ssw.jpg", "width": 640, "cloudinary_id": "iw337grsrs5lz8ms2ssw", "height": 819}, "summary": "Shanghai is a computerized version of mahjong solitaire. After winning a game, the tiles reveal the three-dimensional blinking eye of a dragon behind the game screen.[1] The Macintosh and Sega Master System version shows an animated dragon spitting fire.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/he2npmqhix8i6uwg0mu0.jpg", "width": 512, "cloudinary_id": "he2npmqhix8i6uwg0mu0", "height": 512}], "id": 12765}, {"genres": [5], "summary": "Moving from one room to the next within the studio/arena, players have to shoot down hordes of enemies as they advance from all sides, while at the same time collecting weapons, power-up items, and assorted bonus prizes until a final show down with the show's host where you are finally granted your prizes, your life and freedom. One of the enemies is fat and is named Mr. Shrapnel who roams aside of the walls of some rooms and after a short period of time he explodes. In the NES version, he is replaced by a giant rolling bomb.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/d8gi6iepz0ukld5oxqwk.jpg", "width": 630, "cloudinary_id": "d8gi6iepz0ukld5oxqwk", "height": 803}, "id": 12853, "name": "Smash T.V."}, {"genres": [14], "name": "Winter Olympics: Lillehammer '94", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qgocmgntcw0gkbnfx6ce.jpg", "width": 800, "cloudinary_id": "qgocmgntcw0gkbnfx6ce", "height": 1126}, "summary": "Winter Olympics offers you the ultimate experience in sports simulations. You'll race against the best in the world... and the clock... fighting for gold in a game where you'll face 10 spectacular events testing your speed, skill, strength and endurance to the limit. It's your chance to go for gold in the world's greatest winter sports spectacle!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/exp7zucudf2tdrklqnto.jpg", "width": 320, "cloudinary_id": "exp7zucudf2tdrklqnto", "height": 256}], "id": 4507}, {"genres": [14], "name": "Sensible Soccer: European Champions", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qm8h5cobquhsbouseush.jpg", "width": 640, "cloudinary_id": "qm8h5cobquhsbouseush", "height": 816}, "summary": "Sensible Soccer is a football video game series which was highly popular in the early 1990s and which still retains a cult following. Developed by Sensible Software and first released for Amiga in 1992, it featured a zoomed-out bird's-eye view, editable national, club and custom teams and gameplay utilising a relatively simple and user-friendly control scheme. One of the defining gameplay elements was the aftertouch feature, which enabled effective but unrealistic swerves. The game topped charts such as Amiga Power's \"All Time Top 100\". The graphic style of the game was used in other Sensible Software games, such as Mega-Lo-Mania, Cannon Fodder and Sensible Golf.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ohaltgqk9quszekbzwit.jpg", "width": 320, "cloudinary_id": "ohaltgqk9quszekbzwit", "height": 200}], "id": 13257}, {"genres": [8], "name": "Global Gladiators", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mxkzzxuntu7omi7sqavu.jpg", "width": 256, "cloudinary_id": "mxkzzxuntu7omi7sqavu", "height": 360}, "summary": "Global Gladiators (also known as Mick and Mack: Global Gladiators) is a 1992 platform game by Virgin Interactive, originally programmed by David Perry (who at the time had already moved to the United States and was located on the recently formed Virgin Games USA development studio) for the Mega Drive/Genesis and eventually ported by other Virgin Interactive teams in Europe (with the help of Graftgold and Krisalis Software) to the Sega Master System, Sega Game Gear and the Commodore Amiga. A Super Nintendo port was also in development but was never completed for undisclosed reasons, though a prototype exists on the Internet. The game is loosely based on the McDonald's fast food chain and has a strong environmentalist message. \n \nA Game Boy port of the title was also fully developed (by Damian Stones, of Climax) but was never released for the same legal reasons as the Super Nintendo port. \n \nIn the single-player game, the player controls Mick or Mack through four worlds; Slime World, Mystical Forest, Toxi-town and Arctic World. Each world has several sub-stages where the character must collect a certain number of Golden Arches to advance. \n \nThey are guided in their quest by Ronald McDonald, who appears at the beginning and the end of the game. The characters are armed with a Super Soaker-type gun that shoots gooey projectiles. \n \nThe game engine is the same used in other Virgin Interactive games such as Cool Spot and Disney's Aladdin, as all of them (Mega Drive/Genesis versions) were handled by David Perry's programming team, which eventually turned into Shiny Entertainment.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vyycvnz1ciz972ksdqqy.jpg", "width": 512, "cloudinary_id": "vyycvnz1ciz972ksdqqy", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i6exzai3g6uza32g5dyz.jpg", "width": 512, "cloudinary_id": "i6exzai3g6uza32g5dyz", "height": 448}], "id": 6828}, {"genres": [8], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hdidqbl2vlkysp1b5c6d.jpg", "width": 360, "cloudinary_id": "hdidqbl2vlkysp1b5c6d", "height": 500}, "id": 14207, "name": "The Addams Family"}, {"genres": [8], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nzecgtsjnuonenlgg6vh.jpg", "width": 800, "cloudinary_id": "nzecgtsjnuonenlgg6vh", "height": 1099}, "id": 14340, "name": "Bram Stoker's Dracula"}, {"genres": [14], "name": "PGA Tour Golf", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dnpjmlr852k3wlyvp28b.jpg", "width": 640, "cloudinary_id": "dnpjmlr852k3wlyvp28b", "height": 817}, "summary": "This first game in the series was originally released in 1990 for DOS computers, 1991 for Sega Genesis, Macintosh, SNES, and Commodore Amiga, and 1993 for Sega Master System and Game Gear. It was developed and published by Electronic Arts for DOS and Macintosh, ported to Genesis, SNES, and Game Gear by Sterling Silver Software, to Amiga by Bluesky Innovations, and to Master System by Polygon Games. The Genesis/Mega Drive version features 6 professional golfers as playable or as CPU opponents; Fred Couples, Mark McCumber, Larry Mize, Joey Sindelar, Craig Stadler, Bruce Lietzke.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/whmyi1nljpzg2ud7zq73.jpg", "width": 480, "cloudinary_id": "whmyi1nljpzg2ud7zq73", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ynycrhd3uahr4dkzbo8o.jpg", "width": 320, "cloudinary_id": "ynycrhd3uahr4dkzbo8o", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aincdwgtblyvict4mnov.jpg", "width": 320, "cloudinary_id": "aincdwgtblyvict4mnov", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hn1df9x4fqad53ggvrxo.jpg", "width": 256, "cloudinary_id": "hn1df9x4fqad53ggvrxo", "height": 160}], "id": 12714}, {"genres": [8], "name": "Castle of Illusion Starring Mickey Mouse", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ymhbze4eqtbckvxb5u1r.jpg", "width": 248, "cloudinary_id": "ymhbze4eqtbckvxb5u1r", "height": 348}, "summary": "Minnie Mouse has been kidnapped by the evil witch Mizrabel, and it's up to Mickey Mouse to venture through the mysterious worlds of the Castle of Illusion to rescue her in this 2D platformer (and collaboration between Disney and Sega).", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ogvzdabi7umyqyo2nwnx.jpg", "width": 1280, "cloudinary_id": "ogvzdabi7umyqyo2nwnx", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pq6mds0h2cyxvhrgpj1m.jpg", "width": 1280, "cloudinary_id": "pq6mds0h2cyxvhrgpj1m", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r0ljlbpzyzflkn9ghxbi.jpg", "width": 1280, "cloudinary_id": "r0ljlbpzyzflkn9ghxbi", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r3eyroib4t342e6plmxw.jpg", "width": 1280, "cloudinary_id": "r3eyroib4t342e6plmxw", "height": 829}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xzlmkb4t39c9apxsel1n.jpg", "width": 1280, "cloudinary_id": "xzlmkb4t39c9apxsel1n", "height": 829}], "id": 8122}, {"genres": [9, 15, 33], "name": "Dr. Robotnik's Mean Bean Machine", "videos": [{"video_id": "a-1b3IA2ujA", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nb8hilglvgl2aadztd0l.jpg", "width": 800, "cloudinary_id": "nb8hilglvgl2aadztd0l", "height": 1119}, "summary": "Dr. Robotnik is changing the jolly folk of Beanville into devious little robots that will help rid Planet Mobius of music and fun forever. Group the beans together to help them escape, and compete against Robotnik’s wily henchbots!", "storyline": "Dr. Robotnik has hatched a plan to ensure that no fun or music remains on Mobius. To do this, he kidnaps the jolly citizens of Beanville and stuffs them into a giant roboticizing machine called the Mean Bean-Steaming Machine to turn them into devious little robot-slaves. Across Beanville, Beans disappear and are sent to the Mean Bean Machine. The player sets off on a daring adventure to defeat Robotnik's minions and stop Robotnik. The game ends after a face-off with Robotnik, in which the Mean Bean Machine is destroyed and the Beans are freed. \n \nRobotnik's nemesis, Sonic the Hedgehog, is never mentioned throughout the game to rescue or help the player.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/cjgfkufqxyp5bxnttp9q.jpg", "width": 500, "cloudinary_id": "cjgfkufqxyp5bxnttp9q", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dfsgnqkb5dgwz7yeektn.jpg", "width": 500, "cloudinary_id": "dfsgnqkb5dgwz7yeektn", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rrbdtarhmngvh6js2tlp.jpg", "width": 500, "cloudinary_id": "rrbdtarhmngvh6js2tlp", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hieizzsmtjpf1qr87tkx.jpg", "width": 500, "cloudinary_id": "hieizzsmtjpf1qr87tkx", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jzb5ntrutndx4hlsjrjk.jpg", "width": 500, "cloudinary_id": "jzb5ntrutndx4hlsjrjk", "height": 370}], "id": 4499}, {"genres": [5, 33], "name": "Rescue Mission", "videos": [{"video_id": "RS4894A6xl4", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/adff5dvjhu4gl9soqjtk.jpg", "width": 800, "cloudinary_id": "adff5dvjhu4gl9soqjtk", "height": 1114}, "summary": "Rescue Mission is a shooting game. Using the Light Phaser peripheral, the player is required to shoot waves of enemy soldiers to protect a medic on a rail cart who slowly moves around the level rescuing injured friendly soldiers.", "storyline": "Your friends are trapped behind enemy lines. They're wounded and need your help to escape. Your taking the medics in... on a dangerous rescue mission.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/eanxdkkkgki0jvaqthva.jpg", "width": 498, "cloudinary_id": "eanxdkkkgki0jvaqthva", "height": 386}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qe1un8wg4czxzgbqstsp.jpg", "width": 640, "cloudinary_id": "qe1un8wg4czxzgbqstsp", "height": 480}], "id": 18140}, {"genres": [33], "name": "Dick Tracy", "videos": [{"video_id": "5si2yc0_3mQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vpsml4el9dnrzz8epuce.jpg", "width": 640, "cloudinary_id": "vpsml4el9dnrzz8epuce", "height": 790}, "summary": "Dick Tracy is a tie in to the 1990 movie adaptation of the classic comic strip, staring Warren Beatty and Madonna. While an action/adventure hybrid using this license was released by Disney for the PC and Amiga, Titus also held a license to the movie. This is a side scrolling action game, where you control Dick Tracy as he moves through five stages, shooting gangsters with an assortment of weapons. Each stage leads to one of the mob bosses, until you ultimately capture the big man himself.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pkg2odb521dwmugwis1v.jpg", "width": 640, "cloudinary_id": "pkg2odb521dwmugwis1v", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/o7rs698imxkuslko07k3.jpg", "width": 640, "cloudinary_id": "o7rs698imxkuslko07k3", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jrgawxlbnw5ukbovvgdv.jpg", "width": 640, "cloudinary_id": "jrgawxlbnw5ukbovvgdv", "height": 480}], "id": 13058}, {"genres": [4, 5], "summary": "Fantasy Zone II: The Tears of Opa-Opa is the sequel to Fantasy Zone, in which you control Opa-Opa, a pretty colored ship with wings on its side. You must destroy the large creatures in each world before moving on to the next. Your task becomes difficult by other small creatures that happen to pass by. If you destroy a large creature, they will drop a dollar bill, which you can pick up and use at the shop to buy items and powerful weapons such as laser beams, x-way shots, and big wings. Another way to get money is to shoot certain kinds of enemies all in a row. \n \nMore often than not, some large creatures will reveal a warp gate rather than a dollar bill. You can go through the warp gate to get to another part of the land, and destroy more large creatures. Only one of them will have a warp gate in the form of a 'stop' sign - that is your ticket to the round boss, but you must defeat all large creatures in order to pass through it. Also like in the original can you walk on the ground to avoid approaching enemies, and spend money in the shop to get new weapons (but they only last for a limited time).", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qudpfdzjder78mmuqlil.jpg", "width": 1534, "cloudinary_id": "qudpfdzjder78mmuqlil", "height": 2100}, "id": 6687, "name": "Fantasy Zone II"}, {"genres": [8, 9], "name": "Zillion", "videos": [{"video_id": "tKhwO571-1U", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wnxsun7hfys7p3yrsrlv.jpg", "width": 511, "cloudinary_id": "wnxsun7hfys7p3yrsrlv", "height": 700}, "summary": "Zillion is a space adventure platform video game designed for the Sega Master System as a companion for the Zillion anime series in 1987. The game is a free-scrolling platform/adventure, similar to Epyx's Impossible Mission, in which objects must be inspected to enable things by accessing codes.", "storyline": "Are you ready for the ultimate danger? You're alone, outnumbered and there's no guarantee you'll make it alive. You're J.J. Your objective: secretly infiltrate the underground labyrinth of The Norsa Empire and steal their plans for domination. Armed with the ultra speed and power of the Zillion Laser, your mission is complex. And sheer strength will not win this one alone. You'll need more brains than brawn in this sophisticated operation. So, how will you think your way to victory? With cunning strategy and memory to guide you successfully through the maze which awaits. Where once inside, you'll find the information needed to destroy the Norsas and restore peace forever.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/yuvikbt4th2eqdms4jrj.jpg", "width": 512, "cloudinary_id": "yuvikbt4th2eqdms4jrj", "height": 384}], "id": 18141}, {"genres": [14], "name": "Super Tennis", "videos": [{"video_id": "Woj7ogYo1Vo", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mixczvbypsmsehjcjbsm.jpg", "width": 350, "cloudinary_id": "mixczvbypsmsehjcjbsm", "height": 503}, "summary": "Super Tennis, is a sports game developed and published by Sega for the Sega Master System.", "storyline": "Lob! Volley! Smash! it's deuce and you've got one set to go for the match. All the details are here, bringing realistic action and strategy onto your home court.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/enaehpbkbibyhxga15jb.jpg", "width": 480, "cloudinary_id": "enaehpbkbibyhxga15jb", "height": 360}], "id": 18144}, {"genres": [5], "name": "Rambo III", "videos": [{"video_id": "vof5cjlwT4Y", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qapn8ojhlq3kr6qswkgi.jpg", "width": 350, "cloudinary_id": "qapn8ojhlq3kr6qswkgi", "height": 503}, "summary": "Rambo III is a shooting game developed and published by Sega for the Sega Master System, making use of the Light Phaser peripheral. It is based upon the film Rambo III.", "storyline": "John Rambo, America's favorite soldier, makes a daring rescue attempt on a Russian military base deep in war-torn Afghanistan. A fast-shooting Light Phaser game that tests your fighting skills to the limit.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ulrpzbndybndbax2rt17.jpg", "width": 256, "cloudinary_id": "ulrpzbndybndbax2rt17", "height": 224}], "id": 18145}, {"genres": [5], "summary": "A sidescrolling shooter in which you fight your way through 5 missions, each with a boss to defeat at the end. Along the way you find Power-Ups to help your odds either by improving your weapon or speed. Three difficulty levels are available (careful: \"Easy\" does not let you reach the very end)", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/m4jijiwyiooyekydazdy.jpg", "width": 190, "cloudinary_id": "m4jijiwyiooyekydazdy", "height": 271}, "id": 18233, "name": "Aerial Assault"}, {"genres": [12], "name": "Wonder Boy III: The Dragon's Trap", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xv5swpbl59r69or78m7l.jpg", "width": 256, "cloudinary_id": "xv5swpbl59r69or78m7l", "height": 355}, "summary": "A direct sequel to Wonder Boy in Monster Land, you wander through the lands using multiple forms that each have different abilities. Each defeated boss unlocks a new form that has to be used to advance to a new area, while shops give you access to new equipment for money.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/i2g8aliycm7wmm6hhw6y.jpg", "width": 600, "cloudinary_id": "i2g8aliycm7wmm6hhw6y", "height": 338}], "id": 18277}, {"genres": [4, 8], "summary": "The Romans have kidnapped Getafix, who is the only one that can brew the magic potion the Gauls need to stand against the Romans. Asterix and Obelix embark on a journey to free him. You can play as either Asterix or Obelix which play slightly differently (Obelix is slower, but can manipulate objects, Asterix moves faster).", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vwhpc1mn6ywdsboohd4n.jpg", "width": 640, "cloudinary_id": "vwhpc1mn6ywdsboohd4n", "height": 922}, "id": 19486, "name": "Asterix"}, {"genres": [5], "summary": "Just as you stole the enemy's secret weapon and started back, the enemy spotted you! Now you must fight your way back to safety. But be careful! You're in the line of fire.", "id": 19487, "name": "Line of Fire"}, {"genres": [14], "summary": "An isometric mini-golf game for 1-2 players", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xe7qg57rj1sghkicseoo.jpg", "width": 495, "cloudinary_id": "xe7qg57rj1sghkicseoo", "height": 700}, "id": 19505, "name": "Putt & Putter"}, {"genres": [5, 33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/czy4bndmngapxfysqacq.jpg", "width": 1536, "cloudinary_id": "czy4bndmngapxfysqacq", "height": 2100}, "id": 4468, "name": "Sagaia"}, {"genres": [12], "summary": "A roguelike \"dungeon\" crawler that leads you through 30 levels on your quest to find a way to return to your own world.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yalqtb9ajd2rytiy6259.jpg", "width": 256, "cloudinary_id": "yalqtb9ajd2rytiy6259", "height": 363}, "id": 18226, "name": "Dragon Crystal"}, {"genres": [8], "summary": "Sorceress Magica De Spell and her rotten ravens have kidnapped Huey, Dewey and Louie! Worse yet, she's snatched Uncle Scrooge's Lucky Dime! Join Donald Duck in his quest to prove that Magica is no match for him.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z9wtki6fqmrk3v7if4n2.jpg", "width": 480, "cloudinary_id": "z9wtki6fqmrk3v7if4n2", "height": 680}, "id": 12910, "name": "The Lucky Dime Caper starring Donald Duck"}, {"genres": [5, 33], "summary": "Vigilante forces have raided government military installations and \"confiscated\" tanks, planes, even warships! Pilot your G-LOC fighter to victory against the guerillas. Only you have the skills to get the job done and save the day!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ppkmhowyrdiuumtk5pto.jpg", "width": 500, "cloudinary_id": "ppkmhowyrdiuumtk5pto", "height": 700}, "id": 4464, "name": "G-Loc Air Battle"}, {"genres": [15], "summary": "Patience, cunning and a desire to be the best - the keys to becoming a master of chess. Sega Chess gives even the most seasoned player the game of a lifetime!", "id": 19490, "name": "Sega Chess"}, {"genres": [14], "summary": "Now you have the opportunity to play the same courses that have challenged golf’s greatest legends. WORLD CLASS LEADERBOARD features three famous 18-hole golf courses and each hole authentically reproduces the distance, traps, trees, rough and water hazards of: \n \n-St. Andrews - The Most Revered Course in Golf \n-Doral Country Club - The Florida Blue Monster \n-Cypress Creek - The Largest and the Finest \n \nThe fourth course, designed specifically for “WORLD CLASS” is the “GAUNTLET COUNTRY CLUB”. Only those who have mastered the best courses in the world should expect to come close to par at “THE GAUNTLET”. \n \n“WORLD CLASS” will challenge you with the same strategy and option decisions you face in your real game. And because the look and feel are so life-like, it may improve your actual golf game as well!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bsopk9cc5zfpwvpjdclp.jpg", "width": 800, "cloudinary_id": "bsopk9cc5zfpwvpjdclp", "height": 1028}, "id": 19492, "name": "World Class Leaderboard"}, {"genres": [8, 12], "name": "Wonder Boy in Monster World", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/txitvdhaboldmglzgvwr.jpg", "width": 256, "cloudinary_id": "txitvdhaboldmglzgvwr", "height": 360}, "summary": "Monsters have taken over the land, and every day the citizens fear for their lives, hoping that a hero will step forth and bring peace to the embattled country.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/modb6o8avkfuk11rkeox.jpg", "width": 1920, "cloudinary_id": "modb6o8avkfuk11rkeox", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tzf5xu9zojpz1oxy76py.jpg", "width": 1920, "cloudinary_id": "tzf5xu9zojpz1oxy76py", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/asxeonm5el1fvkxefqus.jpg", "width": 1920, "cloudinary_id": "asxeonm5el1fvkxefqus", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gcs3szcq3uo7lexd4mhg.jpg", "width": 1920, "cloudinary_id": "gcs3szcq3uo7lexd4mhg", "height": 1080}], "id": 9540}, {"genres": [14], "id": 15241, "name": "Kick Off 2"}, {"genres": [25], "summary": "A beat-em-up in which you take control of policeman Grey, who sets out to avenge the murder of his partner Brody and destroy the gang \"Soldiers of Darkness\" lead by \"M\".", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r1q2zxnrbnx7fsxcrhrh.jpg", "width": 942, "cloudinary_id": "r1q2zxnrbnx7fsxcrhrh", "height": 1314}, "id": 19511, "name": "Running Battle"}, {"genres": [5], "summary": "Space Invaders is the most famous video game ever! Now SUPER SPACE INVADERS has arrived with a host of amazing new features - wave after wave of weird and hostile aliens, fantastic multiway scrolling playfields, huge end of level mega monsters and secret levels for only the best to find! It'll drive you crazy, but you won't be able to leave it alone!", "id": 12859, "name": "Super Space Invaders"}, {"genres": [5], "summary": "Run… fly… dodge those obstacles, but return fire on wave after wave of attacking aliens. Armed with a really big gun, you have to defend yourself against the alien hordes using your wits to navigate around the screen. But watch out for those end of level bosses! \n \nOriginating in the arcades, Space Harrier is a third-person rail shooter with pseudo-3D graphics, set in the same world as Fantasy Zone. The lone titular hero fights aliens with a fireball-launching cannon, which can also be used to transform the hero into a flying rocket. The protagonist is constantly in motion, but the speed of his movement can be regulated by the player.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jj3psqxcwdq6ea8togkz.jpg", "width": 1401, "cloudinary_id": "jj3psqxcwdq6ea8togkz", "height": 1389}, "id": 12857, "name": "Space Harrier"}, {"genres": [33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dcmwbgvvkzsb0x3i7rrm.jpg", "width": 640, "cloudinary_id": "dcmwbgvvkzsb0x3i7rrm", "height": 910}, "id": 4372, "name": "The Terminator"}, {"genres": [4, 33], "name": "Bonanza Bros.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jso94gbldpk7hvre8wq6.jpg", "width": 660, "cloudinary_id": "jso94gbldpk7hvre8wq6", "height": 918}, "summary": "Just who are these guys? \n \nMobo and Robo are the coolest villains you'll ever meet- they rob banks, museums (and innocent computer gamers of their sanity). One evening whilst watching TV a mysterious stranger appeared on screen. \"Good Evening Boys I've got a job for you... My businesses are being robbed and I need you to test my security systems... Deliver the goods and I'll reward you.\" Take control of Mobo and Robo and guide them around the various establishments, collecting evidence on the way.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/v4qfc7dalfovmuxkpfzq.jpg", "width": 500, "cloudinary_id": "v4qfc7dalfovmuxkpfzq", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pixizgezvdpsfhv9st7m.jpg", "width": 500, "cloudinary_id": "pixizgezvdpsfhv9st7m", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tmxzksofx3fupnjcfffv.jpg", "width": 500, "cloudinary_id": "tmxzksofx3fupnjcfffv", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ziok50uw7us0rzq4pyu0.jpg", "width": 500, "cloudinary_id": "ziok50uw7us0rzq4pyu0", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tvcrhvarxejp1kmpwin8.jpg", "width": 320, "cloudinary_id": "tvcrhvarxejp1kmpwin8", "height": 256}], "id": 4511}, {"genres": [10, 33], "name": "OutRun", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wikclvhxdsrgllhzqhfd.jpg", "width": 850, "cloudinary_id": "wikclvhxdsrgllhzqhfd", "height": 1208}, "summary": "OutRun is a racing game originating in the arcades. The player can race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks. \n \nGameplay is viewed form just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/houuut8un6fxbeq0sjpn.jpg", "width": 1470, "cloudinary_id": "houuut8un6fxbeq0sjpn", "height": 1533}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vrpgdhtz22nhoi4azxvh.jpg", "width": 640, "cloudinary_id": "vrpgdhtz22nhoi4azxvh", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ndzkhuhrkszg9xiyehtt.jpg", "width": 640, "cloudinary_id": "ndzkhuhrkszg9xiyehtt", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wxo06xndkdytt8dftd9y.jpg", "width": 440, "cloudinary_id": "wxo06xndkdytt8dftd9y", "height": 308}], "id": 2051}, {"genres": [12], "name": "Ultima IV: Quest of the Avatar", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/boqvsymjrvmguntojmag.jpg", "width": 639, "cloudinary_id": "boqvsymjrvmguntojmag", "height": 907}, "summary": "As an addendum to this work, I, Lord British, would like to speak of the Quest of the Avatar mentioned in these pages. The Quest of the Avatar is the search for a new standard, a new vision of life for which out people may strive. We seek the person who can become a shining example of our nation and guides us from the Age of Darkness into the Age of Light. We have sent this message our to the farthest reaches of the known universe, indeed, we have even spoken across the void of time. Is there One who can complete the Quest of the Avatar? Many have tried already, and have met with partial success, becoming enlightened in one or more of the Eight Virtues of the Avatar - but none have yet attained the true state of being an Avatar. \n\nThe secrets of the Avatar are buried deep in the hearts of both our people and the land in which we dwell. The search will be arduous and the One who shall succeed must be able to assemble all the parts of the great mystery in order to solve the Quest. Gaze upon the device portrayed on the facing page of this tome. Learn it well, for when thou dost gaze upon it again then shall thy life's quest be revealed.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ljwgxzdcealtsnbrvf6n.jpg", "width": 320, "cloudinary_id": "ljwgxzdcealtsnbrvf6n", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wbfgtsy0o0yptgfhs7g2.jpg", "width": 320, "cloudinary_id": "wbfgtsy0o0yptgfhs7g2", "height": 256}], "id": 2878}, {"genres": [5], "summary": "Space Gun (スペースガン Supēsu Gan?) is a first-person, shoot 'em up arcade game released by Taito in 1990. It was later distributed for various home games consoles in 1992, and in 2005, it was included as part of the compilation Taito Legends on the PlayStation 2, PC and Xbox. It is set aboard a crippled space station that has been overrun by hostile alien creatures; there are human crew members that the player must attempt to rescue while destroying the alien creatures. Space Gun features simulated gore, giving the player the ability to shoot limbs off the creatures while blood splatters appear on screen. Various weapon upgrades can be found during gameplay. The music from the game is featured on several commercially released compact discs. It was fairly well received by critics both in arcades and when released for home systems. It was one of only a few games that supported a light gun peripheral for some of the home systems releases.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x0jefht0he2cnlwrpcap.jpg", "width": 640, "cloudinary_id": "x0jefht0he2cnlwrpcap", "height": 824}, "id": 12856, "name": "Space Gun"}, {"genres": [8, 25], "summary": "Set sometime during the 21st century, the player controls the grandson of the ninja master Joe Musashi, also named Joe, who is on a mission to defeat the minions of Cyber-Zeed, a terrorist organization founded by the remnants of the Zeed organization that the original Joe Musashi destroyed. Joe must fight his way through a series of six stages in order to prevent Cyber-Zeed from launching its stolen stockpiles of plutonium around the world. The stages consists of a construction site, a harbor, a heliport, a jungle, a waterfall, and the hideout of the enemy.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gznfe5bkxtdl0ec27juf.jpg", "width": 560, "cloudinary_id": "gznfe5bkxtdl0ec27juf", "height": 640}, "id": 10218, "name": "The Cyber Shinobi"}, {"genres": [8, 31], "name": "Sonic the Hedgehog 2", "videos": [{"video_id": "8cr1rqVcIhA", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ntf28xepajngtq6q4mvo.jpg", "width": 1521, "cloudinary_id": "ntf28xepajngtq6q4mvo", "height": 2100}, "summary": "Dr. Eggman (aka Dr. Robotnik) has returned, turning helpless animals into robots and forcing them to build his ultimate weapon, the Death Egg! But this time, Sonic has a friend that can help him: Tails! Find the 7 Chaos Emeralds and stop Dr. Robotnik’s evil scheme!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/aeazsmwnemy9caad5jxp.jpg", "width": 1597, "cloudinary_id": "aeazsmwnemy9caad5jxp", "height": 899}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ap6ptovy4koli0unr6nm.jpg", "width": 1597, "cloudinary_id": "ap6ptovy4koli0unr6nm", "height": 897}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yeqzlc8rbbgfmudb3bql.jpg", "width": 1597, "cloudinary_id": "yeqzlc8rbbgfmudb3bql", "height": 897}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ptfgp9sijeqkajwptny2.jpg", "width": 1593, "cloudinary_id": "ptfgp9sijeqkajwptny2", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eqba0h9qaqrt7bu34diz.jpg", "width": 1597, "cloudinary_id": "eqba0h9qaqrt7bu34diz", "height": 897}], "id": 4438}, {"id": 19693, "name": "Predator 2"}, {"genres": [4], "name": "Mortal Kombat", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lbpslq8trfkv2lc0065q.jpg", "width": 698, "cloudinary_id": "lbpslq8trfkv2lc0065q", "height": 886}, "summary": "Mortal Kombat is a 1992 Fighting video game by Midway, originally designed for Arcade systems, but later ported to various home computers and consoles. Mortal Kombat was well received around the world and has spawned countless sequels and spin-offs with it's 22nd title coming up in 2015. Mortal Kombat is the first game in the Mortal Kombat series and was followed by Mortal Kombat II in 1993.", "storyline": "Mortal Kombat follows the story of the Mortal Kombat tournament, a sacred martial arts contest created by the Shaolin Monks, that takes place on a secluded island. Over 500 years ago, the evil sorcerer Shang Tsung overthrew the monks with the help of the monster warrior Goro, and now hosts the contest to steal the souls of the contest's losers to keep himself immortal and powerful. This year's Mortal Kombat tournament is about to take place, and 7 contestants are ready to fight. Liu Kang a noble Shaolin warrior, Scorpion and Sub-Zero, two rival ninja warriors with origins shrouded in secrecy, Johnny Cage a professional martial arts movie star, Raiden the God of Thunder, invited by Shang Tsung personally, Kano a ruthless crime lord, and Sonya Blade a US special forces soldier hunting after Kano.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/suagypvd2jxydgkrsvte.jpg", "width": 320, "cloudinary_id": "suagypvd2jxydgkrsvte", "height": 256}], "id": 1618}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wv2lklly0piypdwok43h.jpg", "width": 640, "cloudinary_id": "wv2lklly0piypdwok43h", "height": 811}, "genres": [33], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vgecqskw8mn923czwfis.jpg", "width": 1919, "cloudinary_id": "vgecqskw8mn923czwfis", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/scqzpzpv6fcmtwmdt0qy.jpg", "width": 1919, "cloudinary_id": "scqzpzpv6fcmtwmdt0qy", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xm6u7ordofvbjo4pst47.jpg", "width": 1919, "cloudinary_id": "xm6u7ordofvbjo4pst47", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cgv0mfhk8fuo8hhadacb.jpg", "width": 1919, "cloudinary_id": "cgv0mfhk8fuo8hhadacb", "height": 1079}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x2sk4xjgxrhnxgxtxyly.jpg", "width": 1919, "cloudinary_id": "x2sk4xjgxrhnxgxtxyly", "height": 1079}], "id": 12793, "name": "Terminator 2: Judgment Day"}, {"genres": [5, 8, 33], "name": "RoboCop 3", "videos": [{"video_id": "7FILe8utwVU", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sjiyzu3gv74jruqaoubb.jpg", "width": 800, "cloudinary_id": "sjiyzu3gv74jruqaoubb", "height": 1099}, "summary": "RoboCop 3 is a side-scrolling platform shooter. You get missions (such as rescuing your colleagues who are being kept hostages), which are divided into several smaller levels. The levels usually consist of several platforms, and are heavily populated by enemies who shoot at you. You can gather special repair kits, which will be used to restore your health after you've completed a level. \"RoboCop 3\" is more of a shooter than its predecessors, having more and tougher enemies.", "id": 19695}, {"genres": [8], "summary": "Sylvester's alter ego, the dastardly Dr. Cheesefinger, has \"kidnapped\" the cheese supply and Speedy Gonzales' girlfriend, Carmel. Can this \"speedy-mouse\" outwit the callous cat and rescue the village cheese supply?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zvxyfmwwbbv4mpcor65m.jpg", "width": 640, "cloudinary_id": "zvxyfmwwbbv4mpcor65m", "height": 910}, "id": 4460, "name": "Cheese Cat-Astrophe starring Speedy Gonzales"}, {"genres": [14], "summary": "Compete in a super realistic ice hockey game with all the frantic action of Championship Hockey - skilful skating, thundering body checks and rifling slap shots. You'll have to skate well to avoid crunching body checks from defenders and out manoeuvre goalkeepers in your quest for The Cup!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oszv3gpi2rbbnrk1kso1.jpg", "width": 341, "cloudinary_id": "oszv3gpi2rbbnrk1kso1", "height": 468}, "id": 19772, "name": "Championship Hockey"}, {"genres": [8, 9, 30], "name": "Sonic the Hedgehog: Spinball", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/q1nqzyif9gwygk46s6fo.jpg", "width": 800, "cloudinary_id": "q1nqzyif9gwygk46s6fo", "height": 1116}, "summary": "Dr. Eggman (AKA Dr. Robotnik) is once again turning the animals of Mobius into robots using his monstrous contraption, the Veg-O-Fortress. Only Sonic can penetrate the Pinball Defense System to free the animals, retrieve the Chaos Emeralds, and put a stop to Dr. Eggman’s fiendish plans!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/gfnr4htilqe2wjxiee0p.jpg", "width": 500, "cloudinary_id": "gfnr4htilqe2wjxiee0p", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kne2ilwqjbvlc0gqyjom.jpg", "width": 500, "cloudinary_id": "kne2ilwqjbvlc0gqyjom", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fgowgszhgnpfgtsqco6z.jpg", "width": 500, "cloudinary_id": "fgowgszhgnpfgtsqco6z", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fotpdmqcex67xcr10kaf.jpg", "width": 500, "cloudinary_id": "fotpdmqcex67xcr10kaf", "height": 370}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yjsoafbfd6nc3b1fusws.jpg", "width": 500, "cloudinary_id": "yjsoafbfd6nc3b1fusws", "height": 370}], "id": 16036}, {"genres": [33], "summary": "Woody Pop is an Action game, published by Sega, which was released in Japan in 1987.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iz9wcex5yth26xyufhlb.jpg", "width": 800, "cloudinary_id": "iz9wcex5yth26xyufhlb", "height": 1111}, "id": 21551, "name": "Woody Pop"}, {"genres": [5], "name": "Choplifter", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ca2jt1qcgtwlsrtyz7en.jpg", "width": 850, "cloudinary_id": "ca2jt1qcgtwlsrtyz7en", "height": 1204}, "summary": "Choplifter is a 1982 Apple II game developed by Dan Gorlin and published by Brøderbund. It was ported to other home computers and, in 1985, Sega released a coin-operated arcade game remake, which in turn received several home ports of its own. While many arcade games have been ported to home computers and consumer consoles, Choplifter was one of the few games (Lode Runner is another) to take the reverse route: first appearing on a home system and being ported to the arcade.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ktbhkkrifknoocddnjbw.jpg", "width": 320, "cloudinary_id": "ktbhkkrifknoocddnjbw", "height": 225}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nrgpckojol3l0gkmn3nq.jpg", "width": 320, "cloudinary_id": "nrgpckojol3l0gkmn3nq", "height": 225}], "id": 6094}, {"genres": [8], "name": "Dynamite Headdy", "videos": [{"video_id": "tYn68fFIx1U", "name": "Trailer"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/t74lloptoeq4tnfa1l96.jpg", "width": 256, "cloudinary_id": "t74lloptoeq4tnfa1l96", "height": 351}, "summary": "Dynamite Headdy is a platform game in which the player controls Headdy, a puppet with a detachable head. This head can be fired in eight directions to attack enemies and obstacles, as well as retrieve out of reach items. By grabbing a HangMan, Headdy is able to pull himself up various platforms, or drag certain areas towards him. By finding a walking case named HeadCase, Headdy can gain a special head type depending on the image shown on HeadCase at the time he hits it. These range from offensive heads that increase his strength, allows him to shoot homing stars or suck up everything on screen, to support heads which include invulnerability, shrinking to reach small areas and sleeping to regain health. Most of these heads have a time limit before the head returns to normal, with the player able to cancel at any time, though some heads, such as the Pin Head, disable manual cancellation. The game also features a side-scrolling shooter stage, during which Headdy can change between three unique Head Types.", "storyline": "Headdy, the central protagonist of the game, arrives in North Town to find that the evil puppet King Dark Demon is in the midst of attacking the puppet town to select which of the peaceful toys should live and which should be converted into his evil minions. Headdy is captured and rejected by Dark Demon's forces, and is dropped into the dust cargo to be thrown into the incinerator. However, Headdy escapes the clutches of Dark Demon's minions and sets off to defeat the evil king. \n \nHowever, trouble is afoot. Not only is the puppet world filled with Dark Demon's minions, but to reach the evil overlord's castle, Headdy must defeat Dark Demon's Keymasters who serve as the king's elite guard. To make matters worse, Headdy is followed by Trouble Bruin, a puppet jealous of Headdy's success. Trouble Bruin wants to be the star instead of Headdy, and will stop at nothing to get rid of him.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/w3zujolsfrrgpx5our3o.jpg", "width": 1197, "cloudinary_id": "w3zujolsfrrgpx5our3o", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dcqhxkwqqwzgql9onzjm.jpg", "width": 1191, "cloudinary_id": "dcqhxkwqqwzgql9onzjm", "height": 893}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/n3jovc4medlu3cqcpsrg.jpg", "width": 1191, "cloudinary_id": "n3jovc4medlu3cqcpsrg", "height": 891}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hgqxl89dsjl8cs3ahphk.jpg", "width": 1189, "cloudinary_id": "hgqxl89dsjl8cs3ahphk", "height": 891}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/iskgeerrbzruzuhmvhsn.jpg", "width": 1195, "cloudinary_id": "iskgeerrbzruzuhmvhsn", "height": 891}], "id": 22744}, {"genres": [8, 31], "name": "Impossible Mission", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uhjwowupjem0u15ibidc.jpg", "width": 256, "cloudinary_id": "uhjwowupjem0u15ibidc", "height": 405}, "summary": "The situation: for three days have the strategic central computers of the great powers acted up. An unknown person manipulates their programmes; at the end of these programmes is the starting command for the intercontinental rocket. The countdown is on, only 6 hours keep the humanity from an atomic inferno. An unknown person? Only professor Elvin, the insane computer expert could crack the top secret start code, Elvin, who entrenches himself in his intangible subterraneous, guarded by 90 murderous robots, that until now had hunted down every intruder. No one who has ever set foot on the lift to Elvins cave labyrinth has returned back alive.\n\nThe last hope: Special Agent 4125, the most cunning, toughest and most indiscriminate man, that the secret service can offer. Only ice cold reckoning and superior physical condition give this unarmed hero a tiny chance to avert the disaster in the last minute.\n\nThe game: your task is to put a stop to evil Elvin Atombender's game. For this you have to enter in his laboratory, protected by a vault somewhere on his underground stronghold. To open the laboratory's door you need a nine letters password, each letter of which Elvin coded into a punchcard, just for cutting in four each one of them, painting them in different colors and hiding the resulting pieces everywhere in his base's furniture. So all you have to do is search into every object of every room for pieces of puzzle while surviving the robots, the pits and doctor Elvin's annoying voice, retrieve all the 36 pieces, put them together in groups of four, and head for the laboratory, where an unpleasant surprise waits you", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bm5qcyj0hj7waplfbkcm.jpg", "width": 320, "cloudinary_id": "bm5qcyj0hj7waplfbkcm", "height": 200}], "id": 4929}, {"genres": [14], "name": "Summer Games", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hwfsgeqowai1hkf7fung.jpg", "width": 585, "cloudinary_id": "hwfsgeqowai1hkf7fung", "height": 881}, "summary": "Summer Games allows up to eight players to compete in a series of summer themed Olympic events. The gameplay is similar to the other entries in Epyx \"games\" series. Each player can choose a country to represent, and then takes turns competing in various events to see who will win the gold medal! The game allows you to compete in all of the events sequentially, choose a few events, choose just one event, or practice an event. The events available vary slightly depending on the platform, and may include: \n \n  Pole vault \n  Platform diving \n  4x400 meter relay \n  100 meter dash \n  Gymnastics \n  Freestyle swimming \n  Skeet shooting \n  100 meter freestyle \n  Rowing", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hamc17ljnc2p6oi2nnnp.jpg", "width": 336, "cloudinary_id": "hamc17ljnc2p6oi2nnnp", "height": 240}], "id": 12340}, {"genres": [8, 31], "name": "Montezuma's Revenge", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vhmikckzypt67vscgsds.jpg", "width": 1000, "cloudinary_id": "vhmikckzypt67vscgsds", "height": 1368}, "summary": "PANAMA JOE, That’s what they call him ‘round these parts; though no one knows his real name or where he comes from. But one thing’s for sure, PANAMA JOE’s a daredevil from the word “go!” No risk’s too great if the reward’s large enough. Winning. That’s what’s the most important to him. And more times than not, that’s exactly what he does. Because he’s tough, clever – resourceful. And sometimes, downright pig-headed! Though occasionally (ah-hum), he’s been known to get in over his head. Luckily, he’s got a knack for getting himself out of hot water as quickly as he gets into it! Let’s hope MONTEZUMA’S REVENGE is one of those times.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/reeeuv0d2dqdfp7qbnbh.jpg", "width": 256, "cloudinary_id": "reeeuv0d2dqdfp7qbnbh", "height": 192}], "id": 12297}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/me05a6nspjjxksu4uhfl.jpg", "width": 684, "cloudinary_id": "me05a6nspjjxksu4uhfl", "height": 946}, "genres": [33], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hublhpnzwobsuf0c2noq.jpg", "width": 320, "cloudinary_id": "hublhpnzwobsuf0c2noq", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i4ipdmsudlu1a7ltuigt.jpg", "width": 334, "cloudinary_id": "i4ipdmsudlu1a7ltuigt", "height": 210}], "id": 6054, "name": "Ghostbusters"}, {"genres": [9, 10, 15, 33], "name": "Marble Madness", "videos": [{"video_id": "bTtM0QTKfnc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ryvunixvrbibtedtwl4m.jpg", "width": 1000, "cloudinary_id": "ryvunixvrbibtedtwl4m", "height": 991}, "summary": "Marble Madness is an isometric platform game in which the player manipulates an onscreen marble from a third-person perspective. The player controls the marble's movements with a trackball, though most home versions use game controllers with directional pads. The aim of the game is for the player to complete six maze-like, isometric race courses before a set amount of time expires. When a player completes a race, the remaining time is added to the next race's allotted time. The game also allows two players to compete against each other.\n\nCourses are populated with various objects and enemies designed to obstruct the player. As the game progresses, the courses become increasingly difficult and introduce more enemies and obstacles. Each course has a distinct visual theme. For example, the first race, titled \"Practice\", is a simple course that is much shorter than the others, while the fifth race, named \"Silly\", features polka-dot patterns and is oriented in a direction opposite from the other courses", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hoi8b4t1vbnauuojc1xj.jpg", "width": 320, "cloudinary_id": "hoi8b4t1vbnauuojc1xj", "height": 256}], "id": 2246}, {"genres": [13, 33], "name": "Paperboy", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/y1ad39sesw16yhq8w2zw.jpg", "width": 360, "cloudinary_id": "y1ad39sesw16yhq8w2zw", "height": 500}, "summary": "Paperboy is a 1985 arcade game by Atari Games originally developed in 1984 . The players take the role of a paperboy who delivers newspapers along a suburban street on his bicycle. The game was ported to numerous video game consoles and personal computers. The Nintendo Entertainment System (NES) version represented the first NES game developed in the United States and coincidentally, the Sega Master System version represented the first SMS game developed in the United Kingdom. Paperboy was innovative for its theme and novel controls.\n\n\nGAMEPLAY:\nThe player controls a paperboy on a bicycle delivering newspapers along a suburban street which is displayed in a cabinet perspective (or oblique projection) view. The player attempts to deliver a week of daily newspapers to subscribing customers, attempts to vandalize non-subscribers' homes and must avoid hazards along the street. Subscribers are lost by missing a delivery or damaging a subscriber's house.\n\nThe game begins with a choice of difficulty levels: Easy Street, Middle Road and Hard Way. The object of the game is to perfectly deliver papers to subscribers for an entire week and avoid crashing (which counts as one of the player's lives) before the week ends. The game lasts for seven in-game days, Monday through Sunday.\n\nControlling the paperboy with the handlebar controls, the player attempts to deliver newspapers to subscribers. Each day begins by showing an overview of the street indicating subscribers and non-subscribers. Subscribers and non-subscribers' homes are also easy to discern in the level itself, with subscribers living in brightly colored houses, and non-subscribers living in dark houses.\n\nDelivering the papers\nThe paperboy begins his route at the start of the street (bottom of the screen) and progresses towards the end. The player can control the paperboy's speed, but the paperboy is in constant movement and cannot stop moving forward until the level (day of the week) has ended. Should he slow down or stop for more than a few seconds, a swarm of bees will appear (arcade version only). For each paper that is delivered to a subscriber's mailbox, the player receives 250 points. If the paper is delivered to the subscriber's doorstep, the player receives 100 points. Points are multiplied x2 for playing 'Middle Road', and x3 for playing 'Hard Way'. Points can be gained for breaking plants, running over flowers, or throwing papers into windows of the non-subscriber houses.\n\n\nIn Paperboy, the player attempts to deliver newspapers to subscribers along a suburban street.\nThe primary objectives of the game are to keep as many subscribers as possible and to stay alive. Secondary objectives include vandalizing non-subscribers' homes and hitting nuisances with newspapers.\n\nKeeping subscribers is fairly straightforward: the player must deliver a paper to them. While the player may deliver more than one paper to each customer, they have to avoid accidentally damaging their homes, such as by throwing a paper through a window. Delivering a newspaper directly into the customer's newspaper box (or mailbox, as the voiceover calls it) earns bonus points. Accidentally damaging a customer's home or failing to deliver a paper causes the customer to cancel his subscription and may cause him to set traps for the paperboy the next day. In more advanced rounds, the homeowner may immediately run after the paperboy after the house is damaged.\n\nThe player must stay alive by avoiding obstacles that appear along the street. Some obstacles include everyday nuisances such as fire hydrants, storm drains, break dancers, cars, skateboarders, drunks, kids with radio controlled toys and even rather bizarre foes such as a tornado, oversized house cats, and even the Grim Reaper himself. The player must also cross street intersections successfully (which gets harder each day). Some obstacles can earn the player bonus points. For example, the breakdancer and some men brawling in the street can be \"smacked\" with a newspaper for extra points. Running into any of the obstacles with the bike results in the loss of a life.\n\nThere are two types of collisions possible from running into obstacles, \"%#@*!\" and \"SMACK!\" The former results from hitting obstacles that are integral parts of the landscape, such as fire hydrants, fences, and signposts. The latter collision type comes from obstacles not integral to the landscape: cars, people, dogs and bees.\n\nAlong the way, the paperboy can pick up extra bundles of papers since he can carry only a limited number. These are sometimes located in difficult to reach spots.\n\nA 'Perfect Delivery' is achieved by successfully delivering to all current subscribers. This award doubles bonus points for each house delivered to, as well as reinstating one lost subscriber - up to a maximum of 10 out of the 20 houses being subscribers. If a 'Perfect Delivery' is achieved when the player already has 10 subscribers, double bonus points are still awarded, but no further subscribers are added.\n\n\nTraining course\nPaperboy encountering some obstacles, such as a Big Wheel tricyclist and a construction worker.\nThe end of each level contains a \"training course\", with unique music, which the player can traverse within an allotted time for bonus points. In the training course are various targets to be struck with papers, jumps, water and other hazards. Riding over a jump replenishes the paperboy's stock of papers in addition to earning points. As with the rest of the level, the difficulty of the training course increases over the week, with new hazards added each day. Crashing on the course or running out of time ends the day, but does not result in the loss of a life. Successful completion of the training course rewards the player with a bonus for any remaining time.\n\n\nFinish line bug\nA bug in the game allowed the player to skirt the finish line at the end of the training course and repeat it a second time, with garbage data appearing in the display, garnering huge scores.\n\nRecapping the delivery\nThe next day begins with the neighborhood overview again, highlighting new subscribers and any unsubscribers. A flawless delivery record for the previous day results in a new subscriber. The next day through, the street is harder with more obstacles and faster cars.\n\nThe game concludes with the Sunday delivery. The road is the hardest version of whichever road the player has selected, and the Sunday edition papers are heavier and fly more slowly. Successfully delivering papers on this day ends the game, but with a newspaper headlined \"Paperboy Wins Award For Outstanding Paper Delivery\", complete with a picture of the paperboy holding a trophy.\n\nLosing all lives also ends the game with a headline reading \"Paperboy Calls It Quits.\" Causing all subscribers to cancel their subscriptions by either failing to deliver their paper or vandalizing their houses results in a headline reading \"Paperboy Fired\", along with a digitized voice which states \"You're fired!\"\n\nThe arcade version of the game included a number of voice clips, used both as voiceover commentary at game start (e.g. \"Paperboy... stopping at nothing in his valiant effort to save this land from TV journalism,\") and as the voice of the paperboy himself when tossing a paper into a mailbox (e.g. \"Now you have a friend in the paper business.\") or losing a life (e.g. \"I live a life of danger.\"). Hitting a few particular obstacles could trigger voice clips specific to the obstacle. (For example, a satirical \"Let's see you hang ten!\" when struck by a skateboarder, or when struck by a tricyclist, he replies, \"I hate that kid.\") Voice clips from collisions only result from the \"SMACK!\" kind.\n\n\nPORTS:\nPaperboy was ported to consoles and home computers, starting in 1986. In some of these versions, the player could assume the role of a papergirl instead of a paperboy. Paperboy was ported to the BBC Micro and Acorn Electron (by Andy Williams, 1986), Commodore 64 (by Chris Harvey and Neil A Bate, 1986), Commodore 16 (1986), Amstrad CPC (1986), ZX Spectrum (1986), Apple II (1986), TRS-80 Color Computer (1986), DOS (1988), Apple IIGS (1988), NES/Famicom (1988)(1991, Japan), Game Boy (1990), Game Boy Color (1999), Atari ST (1989), Amiga (1989), Atari Lynx (1990), Sega Master System (1990), Game Gear (1991), and Sega Mega Drive/Genesis (1991)(1992, Japan). The NES version is particularly notable for being the first NES game developed in the United States.\n\nUnlike the arcade version, several of these versions inspired a sequel, Paperboy 2 for several home systems (Amiga, Amstrad CPC, Atari ST, DOS, Game Boy, Game Gear, Sega Genesis, NES, SNES, ZX Spectrum), and a 3D version for the Nintendo 64 called Paperboy 64.\n\nMore recently, Paperboy was included in Midway Arcade Treasures, a compilation of arcade games for the Nintendo GameCube, PlayStation 2, PlayStation Portable, Xbox, and Windows released in 2003.\nA Mobile version of Paperboy was released in 2005.\n\nPaperboy was also released on February 14, 2007 on Xbox Live Arcade for the Xbox 360; however, the game was delisted.\n\nAn iPhone/iPod Touch 25th anniversary version of Paperboy was released December 18, 2009.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/s29dx0vdizqqbw5vpxbl.jpg", "width": 512, "cloudinary_id": "s29dx0vdizqqbw5vpxbl", "height": 384}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hz9edpqsrkywr9ci1b4y.jpg", "width": 512, "cloudinary_id": "hz9edpqsrkywr9ci1b4y", "height": 384}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/idugnjxjvjttyane7bhl.jpg", "width": 1440, "cloudinary_id": "idugnjxjvjttyane7bhl", "height": 1080}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pvgwxx6im9gxwopvrtr7.jpg", "width": 640, "cloudinary_id": "pvgwxx6im9gxwopvrtr7", "height": 448}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nsoegta4imoyaeztqif4.jpg", "width": 259, "cloudinary_id": "nsoegta4imoyaeztqif4", "height": 194}], "id": 11762}, {"genres": [9, 31], "name": "Where in the World Is Carmen Sandiego?", "videos": [{"video_id": "kijhv53RDJE", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ovrocpwswe1hieuar4z5.jpg", "width": 600, "cloudinary_id": "ovrocpwswe1hieuar4z5", "height": 780}, "summary": "Woldwide crime wave! \nAcme Detective Agency hot on the trail of master thief Carmen Sandiego and her henchmen. \n \nWanted: Detective to locate and capture Carmen and her gang. Must be hard working, independent, fun seeking individual willing to travel the world. No experience necessary. \n \n- Digitised graphics \n- Hundreds of cases \n- More animated sequinces \n- Play in 5 languages \n \nDon't forget your World Almanac. It is a gumshoe's best friend.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/m79olx8iaqidvbb1mhmv.jpg", "width": 320, "cloudinary_id": "m79olx8iaqidvbb1mhmv", "height": 256}], "id": 251}, {"genres": [25, 33], "name": "Gauntlet", "videos": [{"video_id": "94gY2QiyDVg", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zfuftanzlr4yvkq7dedr.jpg", "width": 222, "cloudinary_id": "zfuftanzlr4yvkq7dedr", "height": 289}, "summary": "The players, up to four at once in the arcade version, select among four playable fantasy-based characters; Thor the Warrior, Merlin the Wizard, Thyra the Valkyrie, or Questor the Elf. Each character has his or her own unique strength and weaknesses. For example, the Warrior is strongest in hand-to-hand combat, the Wizard has the most powerful magic, the Valkyrie has the best armour and the Elf is the fastest in movement. \n \nUpon selecting a playable character, the gameplay is set within a series of top-down, third-person perspective mazes where the object is to find and touch the designated exit in every level. An assortment of special items can be located in each level that increase player's character's health, unlock doors, gain more points and magical potions that can destroy all of the enemies on screen. \nThe enemies are an assortment of fantasy-based monsters, including ghosts, grunts, demons, lobbers, sorcerers and thieves. Each enters the level through specific generators, which can be destroyed. While there are no bosses in the game, the most dangerous enemy is \"Death\", who can not only drain a character's health, but is difficult to destroy. \nAs the game progresses, higher levels of skill are needed to reach the exit, with success often depending on the willingness of the players to cooperate by sharing food and luring monsters into places where they can be engaged and slaughtered more conveniently. While contact with enemies reduces the player's health, it also slowly drains on its own, thus creating a time limit. When a character's health reaches zero, that character dies. The character can be revived in place with full health by spending a game credit (i.e. inserting a coin) within a certain short time window after it died. This allows even the least proficient players to keep playing indefinitely, if they are willing to keep inserting coins.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pgyffbo6ledhatogmbun.jpg", "width": 480, "cloudinary_id": "pgyffbo6ledhatogmbun", "height": 270}], "id": 3502}, {"genres": [14], "name": "World Games", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qbvx2gf4dfm2hxmll0jd.jpg", "width": 1000, "cloudinary_id": "qbvx2gf4dfm2hxmll0jd", "height": 1506}, "summary": "World Games is an Olympics-style sports game with arcade-oriented gameplay. The events players can compete in include: •Barrel jumping \n •Bull riding \n •Caber toss \n •Cliff diving \n •Log rolling \n •Platform diving \n •Pole vault \n •Skiing \n •Sumo wrestling \n •Weightlifting", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/j7rsldsdgfj3tvqlvcyj.jpg", "width": 320, "cloudinary_id": "j7rsldsdgfj3tvqlvcyj", "height": 256}], "id": 12831}, {"genres": [10], "name": "Ayrton Senna's Super Monaco GP II", "videos": [{"video_id": "MVJVAGiBR7A", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/efvo5ezzbj1uvdgwreki.jpg", "width": 282, "cloudinary_id": "efvo5ezzbj1uvdgwreki", "height": 397}, "summary": "Ayrton Senna's Super Monaco GP II (アイルトン・セナ スーパーモナコＧＰ II) or simply Super Monaco GP II is a racing game developed and published by Sega for the Sega Mega Drive, Sega Master System and Sega Game Gear in 1992. It is a sequel to Super Monaco GP, but this time the game is sponsored by Ayrton Senna (who won the Monaco Grand Prix six times). Also unlike the previous game, Super Monaco GP II was not released in arcades or for any non-Sega console or computer. \n \nAt the time of release it was regarded as the most realistic racing experience on home video game consoles, and the fact that it was endorsed by Ayrton Senna meant the game was very popular. However, due to these celebrity endorsements, it is unlikely Super Monaco GP II will be re-released without cutbacks.", "id": 27077}, {"genres": [8, 9, 33], "name": "Solomon's Key", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jwmax11wyt9cgxqui5jy.jpg", "width": 1000, "cloudinary_id": "jwmax11wyt9cgxqui5jy", "height": 1406}, "summary": "Solomon's Key is a puzzle game developed by Tecmo in 1986 for arcade release on custom hardware based on the Z80 chipset. The game is generally recognized as one of the most difficult games to appear on the NES. The player, controlling a sorcerer known only as Dana must overcome unlimited enemy spawning, challenging level designs, a countdown timer, instant death from any physical contact with enemies, and limited ways to dispatch enemies.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/n9zmjgmflwh4nafnjckp.jpg", "width": 256, "cloudinary_id": "n9zmjgmflwh4nafnjckp", "height": 240}], "id": 28384}, {"genres": [8, 33], "name": "Ghouls 'n Ghosts", "videos": [{"video_id": "Id2K0XoDqZY", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ysnlsxyutz1z9l8usgku.jpg", "width": 350, "cloudinary_id": "ysnlsxyutz1z9l8usgku", "height": 454}, "summary": "The gameplay for Ghouls 'n Ghosts is similar to that of Ghosts 'n Goblins. The player controls the knight Arthur, who must advance through a series of eerie levels and defeat a number of undead and demonic creatures in his quest to restore the souls stolen by Lucifer (Loki in the English-language Mega Drive and Sega Master System versions), including the soul of his lover, Princess Prin Prin. Along the way, Arthur can pick up a variety of weapons and armor to help him in his quest. While the core gameplay remains the same as its predecessor, the game now allows Arthur to fire directly upward and directly downward while in mid air. \n \nBy jumping in certain spots, players can cause a treasure chest to erupt from the ground. By firing his weapon at the chest, players may uncover new weapons, gold armor or an evil magician that changes Arthur into an elderly man or a helpless duck. The gold armor allows players to charge up the weapon to release a powerful magical attack. Each weapon has its own special attack. \n \nThere are five levels and Lucifer's chamber at the end, considered a sixth level in itself. To defeat the game, Arthur must complete level 1 to 5 twice. Upon completing level's 1 to 5 the first time, Arthur is taken back to level 1 again but this time a special weapon appears during the game. To enter Lucifer's chamber the player must have this special weapon equipped and defeat the penultimate boss.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ymgcqo0qefcwz0wzratw.jpg", "width": 320, "cloudinary_id": "ymgcqo0qefcwz0wzratw", "height": 256}], "id": 6817}, {"genres": [5, 33], "name": "Forgotten Worlds", "videos": [{"video_id": "baNlrRMaAJM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lxazlfrn26pwbg9kflrt.jpg", "width": 1200, "cloudinary_id": "lxazlfrn26pwbg9kflrt", "height": 1600}, "summary": "Forgotten Worlds can be played by up to two players simultaneously. The player controls a flying muscle-bound soldier armed with a rifle with unlimited ammo. The Player 1 character is equipped with a long-range automatic rifle, while Player 2 has a short-range wide shot. The controls in the original coin-op version consists of an eight-way joystick for moving the character in the air while flying and a unique rotatable button known as the \"roll switch\".Rotating the switch left or right allows the player to adjust their character's aim in one of sixteen directions, while pressing it causes the player character to shoot his gun. This allows for the player to move their character anywhere while keeping their aim in one direction. Pressing the switch rapidly will cause the character to perform a \"megacrush\" attack will destroy all on-screen enemies, but at the expense of a portion of their vitality gauge. \n \nThe player character is accompanied by a satellite module orbiting near him that will provide backup firepower every time the player fires their gun. Like the main character, the satellite can also be rotated with the roll switch. Rotating the character while firing will only rotate the aim of the satellite, while rotating the character without firing will not only rotate the satellite's aim, it will also move its relative position around the player. \n \nThe player can obtain blue-colored coins known as \"zennies\" from defeating enemies throughout the game. The zennies are used as currency to obtain new power-up items from shops located at certain points in each stage. When the player enters an item shop, they are given a choice of the items available and a limited time to make any purchase they wish. These items consists primarily of new weapons for the satellite module, but also includes a health kit to restore lost vitality, an armor that allows the player to sustain additional damage, and even tips on how to defeat the boss awaiting at the end of the current stage. \n \nForgotten Worlds consists of five stages with a total of eight bosses. The player will lose if their vitality gauge runs out, but will be given a chance to continue.", "storyline": "Set in a distant future, an evil god known as Emperor Bios has destroyed most of the Earth, turning it into a desolated wasteland known as the \"Dust World\". Two nameless super-soldiers are created by the people to defeat Bios and the eight evil gods who serve him.", "id": 6794}, {"genres": [8, 25], "name": "Kung Fu Kid", "videos": [{"video_id": "FmEd_2CpkLY", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mflq4kdzo0uhws56hwwd.jpg", "width": 256, "cloudinary_id": "mflq4kdzo0uhws56hwwd", "height": 367}, "summary": "A beat-'em-up game developed and published by Sega for the Sega Master System. It is a sequel to the SG-1000 game Dragon Wang (ドラゴン・ワン), in which the player reprises the role of Wang, a kung fu master. \n \nIn Brazil this game was re-released as Sapo Xulé O Mestre do Kung Fu in 1995, complete with graphical changes. \n \nThis can be played for free in the browser at the Internet Archive.", "storyline": "This game is about a kid that has knowledge of kung fu including wall jumping. It tests his skills as he defeats terrible enemies in order to save the day.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zwlu2okg4gmctp7eq4bk.jpg", "width": 320, "cloudinary_id": "zwlu2okg4gmctp7eq4bk", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ibznqp4g6tvdykkull3l.jpg", "width": 320, "cloudinary_id": "ibznqp4g6tvdykkull3l", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xb8zlmdwgwnuzat5cjsq.jpg", "width": 248, "cloudinary_id": "xb8zlmdwgwnuzat5cjsq", "height": 192}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dxoupjrusdmuucsszpwp.jpg", "width": 320, "cloudinary_id": "dxoupjrusdmuucsszpwp", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/b7hxdbqiurllwltjcqep.jpg", "width": 320, "cloudinary_id": "b7hxdbqiurllwltjcqep", "height": 240}], "id": 36898}, {"genres": [5, 33], "name": "Laser Ghost", "videos": [{"video_id": "WZh9Tv7a61c", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aee8q4zg1t1fnykh6zy8.jpg", "width": 281, "cloudinary_id": "aee8q4zg1t1fnykh6zy8", "height": 400}, "summary": "A shoot-'em-up designed for use with the Light Phaser, but can also be played with a control pad. \n \nNot to be confused with the Sega System 18 version.", "storyline": "Laser Ghost for the Sega Master System is completely different from the arcade original. In the game, players must protect a young girl named Catherine who is being held captive in the haunted White Manor. Using either the joypad or the Light Phaser gun, players eliminate the various hazards Catherine encounters as she attempts to escape with her soul.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/htdhicqccaveukkvlgax.jpg", "width": 248, "cloudinary_id": "htdhicqccaveukkvlgax", "height": 192}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fpyu0ni1z5fw35axzu2f.jpg", "width": 260, "cloudinary_id": "fpyu0ni1z5fw35axzu2f", "height": 226}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jkprrp0uy9zg0xmb6pki.jpg", "width": 248, "cloudinary_id": "jkprrp0uy9zg0xmb6pki", "height": 192}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wujsf1dew6jx0fesjnel.jpg", "width": 256, "cloudinary_id": "wujsf1dew6jx0fesjnel", "height": 192}], "id": 36901}, {"genres": [4, 25, 33], "name": "Renegade", "videos": [{"video_id": "eIIOHCA6Flo", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wc0txeyvwcxfwvkj46ug.jpg", "width": 655, "cloudinary_id": "wc0txeyvwcxfwvkj46ug", "height": 640}, "summary": "Unlike Technos' subsequent game Double Dragon, the playing field is limited to one two-screen-wide area (a subway platform, a harbor, an alley, a parking lot and the hideout of a gang) and does not scroll continuously. Out of the four stages in the game, the first, second and third each begin with the player fighting a group made up of two different types of small fry enemies: one with fewer hit points and a stronger attack (usually armed with a weapon) and one with more hit points, but with a weaker attack and the ability to grab the player from behind, making him vulnerable to other enemies' attacks. \n \nWhen only three underlings remain (in any combination of the two) their boss will come in from the sidelines and join the fight. When the boss is defeated, any remaining enemies retreat off the bottom of the screen, and the stage ends. The second stage follows this same formula, but begins with a series of enemies riding motorcycles trying to run the player down, and brings in the normal enemies once the bikers have been defeated. The third stage is a gang of women; their boss is a very large woman who cannot easily be knocked to the ground. The fourth stage features a single type of knife-wielding enemy who can kill the player with one hit. Once the player has defeated this first wave of enemies, the main character proceeds to enter a building at the far right of the stage. There, he faces three more knife-wielding enemies and the final boss, a mobster whose gunfire is also deadly with one hit. Once the final boss is defeated, the main character exits the building and is greeted by his rescued girlfriend, who proceeds to give him a kiss. The game then begins the next cycle with an increased difficulty. \n \nIn addition to an eight-direction joystick, there are three buttons; left attack, right attack, and jump. Pressing the attack in the direction the character is facing will punch, while attacking in the opposite direction will perform a rear kick. Jumping, followed immediately by one of the attack buttons, which will perform a jumping kick in the direction of the attack. \n \nPressing the joystick twice quickly either left or right will cause the player to run, at which point attacking in the direction of the run will perform a running punch, jumping will automatically perform a flying kick, and attacking in the opposite direction will bring the player to a sudden halt and perform a back-kick. Pressing down over a downed enemy will make the player sit on top of the enemy, at which point attacking toward the enemy will cause the player to pummel him. The bosses can only be sat on if all normal enemies have been defeated, and unless the boss' energy level is low enough, he'll throw the player off.", "storyline": "In Renegade, the player controls a vigilante (named Mr. K in the NES version), who fights a variety of street gangs on his way to save his girlfriend.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/wlp6fauavsdvbmrsozto.jpg", "width": 320, "cloudinary_id": "wlp6fauavsdvbmrsozto", "height": 200}], "id": 6852}, {"genres": [14], "name": "California Games", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ltslwdd98letnne1n5mm.jpg", "width": 882, "cloudinary_id": "ltslwdd98letnne1n5mm", "height": 640}, "summary": "Introducing the gnarliest bunch of games under the sun. Games invented on the beaches by sun-baked beach bums with a fondness for ripping, grinding, and shredding. With six radically thrilling events intended to bring you to the edge and blow your mind. And make adrenaline California's most plentiful natural resource. \n \nWish they all could be California Games. \nGet ready to shred the face off an awesomely tubular wave. Turn a \"berm\" on a BMX bike and spray up a wall of dirt. Launch a few feet off-the-lip with your skateboard tucked high. And while you're up there, dance for the crowd. Or if you're feeling like kicking back a bit, float a flying disk, juggle a foot bag with your heels, or just slalom the boardwalk on skates. \n \nWhen the going gets weird, the weird turn pro. \nBut this ain't beach blanket bingo. In fact, before you even set foot on California turf, you'll choose an on-screen sponsor from among the heaviest names on the circuit. Then, hit the competition route. Prizes include trophies for a single event and a top prize in overall competition. \n \nSo get air. Go crazy. Welcome to a new state of intensity.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/i2saw6bppouzerzwlt1l.jpg", "width": 320, "cloudinary_id": "i2saw6bppouzerzwlt1l", "height": 256}], "id": 11984}, {"genres": [5, 13], "name": "Ace of Aces", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zbps0mgbhnqcqfthgfo6.jpg", "width": 1389, "cloudinary_id": "zbps0mgbhnqcqfthgfo6", "height": 1811}, "summary": "Ace of Aces is a combat flight simulator developed by Artech Digital Entertainment in 1986. The game takes place during World War II and the player flies a RAF Mosquito long range fighter-bomber equipped with rockets, bombs and a cannon. Missions include destroying German fighter planes, bombers, V-1 flying bombs, U-boats, and trains.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/b9q0co0cosbtyzm0hzyg.jpg", "width": 320, "cloudinary_id": "b9q0co0cosbtyzm0hzyg", "height": 225}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mavrxdpkmdicjmdlesyi.jpg", "width": 320, "cloudinary_id": "mavrxdpkmdicjmdlesyi", "height": 225}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/insewc1qg1jalleq1yy2.jpg", "width": 320, "cloudinary_id": "insewc1qg1jalleq1yy2", "height": 225}], "id": 11863}, {"genres": [8, 33], "name": "Rygar", "videos": [{"video_id": "0UhQi4A3Wx0", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ohfcrb3bvoqzutgd6iw4.jpg", "width": 1000, "cloudinary_id": "ohfcrb3bvoqzutgd6iw4", "height": 1293}, "summary": "An evil being known as Ligar is about to conquer the land of Argool. Such is his power that no living creature dares to cross paths with him. But the legendary warrior Rygar rises from his grave to restore peace and justice. Armed with his famed weapon Diskarmor, Rygar begins to traverse the vast lands that lead to the lair of the demon, as his minions are trying in vain to stop him...", "storyline": "The arcade game begins with the following introduction: \n \n4.5 billion years have passed since Earth's creation. Many dominators have ruled in all their glory, but time was their greatest enemy and it defeated their reign. And now a new dominator's reign begins... \n \nInformation gleaned from console manuals reveals that the evil being Ligar has taken over the land of Argool, and Rygar, a dead warrior who has risen from his grave, must use his Diskarmor, along with a variety of other weapons, to stop him. In console versions clues and limited dialogue are given in the form of large, sage like men encountered in stone green temples throughout the game. \n \nIn the Japanese original, references to \"Ligar\" and \"Rygar\" are one and the same because the Roman syllables \"Li\" and \"Ry\" come from the same Japanese character. In this version, the hero is only referred to as \"The Legendary Warrior\", while both \"Rygar\" and \"Ligar\" refer to the main villain.", "id": 6856}, {"genres": [8], "name": "Sonic the Hedgehog Chaos", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eg4vvlrup8ti5mxjgbk6.jpg", "width": 1530, "cloudinary_id": "eg4vvlrup8ti5mxjgbk6", "height": 2100}, "summary": "Dr. Robotnik's stolen the red Chaos Emerald, and it's up to Sonic The Hedgehog to get it back! As Sonic or \"Tails\" the two-tailed fox, you'll zip through the Zones, using your quick moves and quicker thinking to collect rings and evade Robotnik's latest batch of badniks!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pegurjpzckfhinsi7vcu.jpg", "width": 1080, "cloudinary_id": "pegurjpzckfhinsi7vcu", "height": 720}], "id": 43322}, {"genres": [10, 33], "summary": "Feel the excitement of the starting line up and take in the atmosphere before letting your throttle unleash to send your formula one-style vehicle around the courses at incredible speeds! In the amazing World Grand Prix you must battle your way up the pack to snatch pole position and maintain it for as long as possible to whoosh over the finish line first in each race to become the true tarmac racing champion!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tp6wfjeattzvphwx6ywz.jpg", "width": 1000, "cloudinary_id": "tp6wfjeattzvphwx6ywz", "height": 1421}, "id": 29132, "name": "World Grand Prix"}, {"genres": [25, 33], "summary": "My Hero (Seishun Scandal in Japan) is a Sega video game released via arcade in 1985 and was later ported to the Sega Master System in 1986. The gameplay takes the form of a simple side-scrolling beat 'em up fighting game, which was seen as being frustratingly difficult at several points in the game.[1]", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/icmzyoeomsmbx7ha6nkn.jpg", "width": 1000, "cloudinary_id": "icmzyoeomsmbx7ha6nkn", "height": 1385}, "id": 29133, "name": "My Hero"}, {"genres": [25, 33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ym8racbrsfxzk0qrkwuz.jpg", "width": 1000, "cloudinary_id": "ym8racbrsfxzk0qrkwuz", "height": 1402}, "id": 29134, "name": "Black Belt"}, {"genres": [5, 10, 33], "name": "Action Fighter", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ztaufhgtonxosvu5btl3.jpg", "width": 500, "cloudinary_id": "ztaufhgtonxosvu5btl3", "height": 485}, "summary": "Take to the streets or take to the skies. Because Action Fighter is the incredible, transformable combat vehicle. \n \nYou start out on a customized cycle. Built with enough speed and power to jump over water and overtake enemies. Then, by finding the right parts along the way, you'll change your cycle into a supercharged, state-of-the-art sports car. Next, add two turbojets to make your car airborne. And take to the skies. Down hyped-up helicopters and jet spaceships from above. \n \nAnd no matter which vehicle you're manning- or who you're after- get ready to stand by for action!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/lf65doorz0hhknno0tmb.jpg", "width": 320, "cloudinary_id": "lf65doorz0hhknno0tmb", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ccwlxvsnnvpf3khccvah.jpg", "width": 320, "cloudinary_id": "ccwlxvsnnvpf3khccvah", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gjjdcmcqwkiacolov6vx.jpg", "width": 320, "cloudinary_id": "gjjdcmcqwkiacolov6vx", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nltanhh7yufdarlcfrmf.jpg", "width": 384, "cloudinary_id": "nltanhh7yufdarlcfrmf", "height": 270}], "id": 11885}, {"genres": [5, 33], "summary": "Thwart an underground invasion with your transforming weaponry. The ground is scarred by craters, a reminder of the recent Dalaus invasion. And continuous acid rains give the sky an eerie irridescence. You are the only Transbot pilot left from the now defunct regime. So you must battle wave after wave of orbiting debris. To try to get to the notorious Dalaus artificial intelligence computer. Fortunately, your astro-plane can go through 6 different transformations. Turn into a robot warrior and more. By the time you transform, you should be able to penetrate the fortress of Dalaus. And rid the galaxy of her evil influence forever!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lw7ttqfxcxlgy6k4dr3e.jpg", "width": 1000, "cloudinary_id": "lw7ttqfxcxlgy6k4dr3e", "height": 1417}, "id": 29136, "name": "TransBot"}, {"genres": [5, 33], "summary": "The Fantasy Zone is a solar system consisting of eight brightly colored, fantastic planets. The evil Menons are trying to take over all of the planets in the Fantasy Zone by using misappropriated foreign currency to build their forces. It is the player's job to recover all of the coins and save the solar system! \n \nFantasy Zone is an arcade style shooter for one or two players. The goal is to destroy all of the creatures on each planet and collect as many of the lost coins as possible. At the end of each level is a large enemy that will have to be defeated before moving on to the next world. At various points in the game, the player will be able to find a parts shop, which allows purchasing improvements for his spaceship, including better weapons and faster engines.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gjywiwgar1gcfs89nxzj.jpg", "width": 640, "cloudinary_id": "gjywiwgar1gcfs89nxzj", "height": 640}, "id": 6684, "name": "Fantasy Zone"}, {"genres": [8, 33], "name": "Wonder Boy", "videos": [{"video_id": "mPafvZNUpiQ", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gomu9gldwucfi5uuyv3t.jpg", "width": 1000, "cloudinary_id": "gomu9gldwucfi5uuyv3t", "height": 1412}, "summary": "Wonder Boy (ワンダーボーイ Wandā Bōi?) is a 1986 platformer video game published by Sega and developed by Escape (now known as Westone Bit Entertainment). \n \nOriginally designed for arcades, it was later ported to the SG-1000, Sega Mark III/Master System and Game Gear video game consoles by Sega, and to the ZX Spectrum, Commodore 64 and Amstrad CPC home computers by Activision. The game is also known as Super Wonder Boy (スーパーワンダーボーイ Sūpā Wandā Bōi?) for its Sega Mark III release in Japan and Revenge of Drancon for its Game Gear release in North America. \n \nIt was the first in the long-running Wonder Boy series of games and was followed up by five sequels, Wonder Boy in Monster Land, Wonder Boy III: Monster Lair, Wonder Boy III: The Dragon's Trap, Wonder Boy in Monster World and Monster World IV. It was also the basis for the Adventure Island series.", "id": 5560}, {"genres": [8, 33], "name": "Rampage", "videos": [{"video_id": "8maxrUWsHxU", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sugqwtufff9ubypwvtcn.jpg", "width": 222, "cloudinary_id": "sugqwtufff9ubypwvtcn", "height": 286}, "summary": "Rampage is a game where players control giant monsters/mutated humans. Players must smash buildings while destroying vehicles such as tanks, planes, and trains to advance to the next level. Smashing windows will sometimes reveals items of interest that the player may use.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/txcjadlgyrtih85hp6qx.jpg", "width": 480, "cloudinary_id": "txcjadlgyrtih85hp6qx", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vgm9f8b53m5gdeq6orav.jpg", "width": 256, "cloudinary_id": "vgm9f8b53m5gdeq6orav", "height": 192}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ofgjel6fqsvduvncz5kb.jpg", "width": 320, "cloudinary_id": "ofgjel6fqsvduvncz5kb", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/irfpv0lbdohkoj5fnoef.jpg", "width": 640, "cloudinary_id": "irfpv0lbdohkoj5fnoef", "height": 400}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/sxev7geagqldbzfb8tdb.jpg", "width": 320, "cloudinary_id": "sxev7geagqldbzfb8tdb", "height": 200}], "id": 3055}, {"genres": [14], "summary": "Villainy alliances, four teams of young Gals ...... is rampaging the world. The Power of proper technique, and a series of weapon attacks. Come on, who wants the champion belt?!", "id": 46148, "name": "Gokuaku Doumei Dump Matsumoto"}, {"genres": [5], "summary": "Air Rescue is similar to Choplifter!. You are a driver of a helicopter and the object is to rescue hostages without being shot down by soldiers, jeeps, tanks, choppers, and ground-based missiles, and bring them back to base. A maximum of four hostages can fit into the helicopter at any given time, so it is necessary to make more than one trip. You can choose from a variety of weapons that you can use to shoot down enemies. There are five rounds, which take you through theme parks, burning skyscrapers, army bases, sunken submarines, and caverns. The round ends when you have taken the required number of hostages to the bases.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rm0lwsi2pfwucnjprd4a.jpg", "width": 1530, "cloudinary_id": "rm0lwsi2pfwucnjprd4a", "height": 2100}, "id": 45671, "name": "Air Rescue"}, {"genres": [33], "summary": "You are trapped in a twenty-level creature filled maze. Your job is to make your way to the bottom and get out alive. Pick up the iron bar and use it to destroy enemies that get in your way. Find the silver key to open the locked warp portal leading to the next level. \n \nRequires 3-D glasses to play.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vl2hwhgrixmsrnde44os.jpg", "width": 1000, "cloudinary_id": "vl2hwhgrixmsrnde44os", "height": 1406}, "id": 45674, "name": "Maze Hunter 3-D"}, {"genres": [10], "summary": "Buggy Run is a game that lets players race dune buggies in a championship over 15 possible tracks (plus 4 in 2 player mode) each winning money that can be used for dune buggy upgrades. There are 4 different modes that can be played in single player mode that includes Race, Vs Com, Freerun, and Battle. \n \nIn the main mode Race the player is given $20,000 starting cash that can be used to upgrade the buggy. The upgradable features of the buggy are Tyres (grip), Engine (speed), Suspension (limits bounce), Steering (cornering), Transmission (performance). All the upgrades cost $10,000 for level 2, $30,000 for level 3, and $50,000 for level 4 however the player doesn’t need to get them in order. There are also special upgrades to buy that includes $5000 for a mine (drops behind and if another car hits then it is blown up until reset), $5000 for Nitoro (gives the players car a short speed boost), and $10,000 for extra capacity of special items (starts with 2 slots to a max of 6). Special Items must be used in the order they're placed in the slots.", "id": 45657, "name": "Buggy Run"}, {"genres": [5, 33], "summary": "The time is the wild 1920's. The place is a great American city that has been taken over by rampant crime. The corruption is led by cruel and cunning gangsters who have let fear and destruction loose in the city. You are the only hope for law and order to return. As a member of the FBI, you wear the badge of the bravest. Your mission: rid the city of these thugs. Armed with your machine gun and plenty of courage, you're dedicated to making gangsters a thing of the past. But it won't be easy. The streets are riddles with gunfire, the local nightclubs are now criminal hang-outs, and the waterfront's docks are in the grip of the most menacing crime-lover, Big Boss. It's you or them - good luck, you'll need it!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yj13e6e3osuimmwm8c6h.jpg", "width": 1000, "cloudinary_id": "yj13e6e3osuimmwm8c6h", "height": 1397}, "id": 45650, "name": "Gangster Town"}, {"genres": [8], "summary": "Psycho Fox must get to the right hand side of the level. However, there are many enemies in the way. He can use a Shinto stick to change into characters/animals like a hippopotamus, a monkey or a tiger, each of which has its own special ability. The hippopotamus is slow and cannot jump very high, but can punch through special destructible blocks in the game world. The monkey can jump higher than the other creatures and the tiger can run faster. Psycho also has an ally named Birdfly, who can be used as armor or as a boomerang. If Psycho is hit while carrying Birdfly, Birdfly goes away and the player does not lose a life.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ala2lzl8vu0m8qvga1dg.jpg", "width": 1426, "cloudinary_id": "ala2lzl8vu0m8qvga1dg", "height": 2000}, "id": 46131, "name": "Psycho Fox"}, {"genres": [14], "summary": "Twenty-four teams from around the globe have come to participate in this soccer showcase. Pick one and match your skills against the computer in an exhibition match, take on a friend, or put it all on the line in the World Cup Tournament! The action never stops!", "id": 46101, "name": "Tecmo World Cup '93"}, {"genres": [14], "summary": "You started out at the bottom, an unknown name in a field of highly talented players. You worked your way up the ranks, playing in America, Australia and France. And now, the big day... the day you take on the best tennis players in the world for the Wimbledon Open Cup!", "id": 46105, "name": "Wimbledon II"}, {"genres": [8], "summary": "Join Bignose in a zany, prehistoric race to catch his dinner! Club you way through hoards of dinosaurs across four huge islands, colleciting bones and rocks and trade with the natives. Fly between the islands using your club as helicopter rotors and become the first flying man! Great cartoon graphics, brilliant music and, most importantly, excellent fun! \n \nUnreleased although prototype is available.", "id": 45660, "name": "Dinobasher Starring Bignose the Caveman"}, {"summary": "Danan, the infant who was rescued from the remains of a wrecked airplane by Jimba, a young Amazon tribesman, came home from hunting one day to find his guardian mortally wounded! What happened to Jimba? Who would do such a thing? Help Danan to find the answers — stalk the hot, wet jungles of the Amazon, putting the pieces together as you go, and avenge Jimba's death!", "id": 45664, "name": "Danan: The Jungle Fighter"}, {"genres": [5], "summary": "Your planet has been overrun by the meanest mutant vegetation ever created in a genetics laboratory. It's taken over buildings, labs, fighter craft... even people! And it's getting bigger... and meaner... with each passing second. But it hasn't taken over you. Now, you're going in on a mission to deliver a POWER STRIKE! You have a special attack ship with the ability to use weapons you free from the ground. The action is hot and heavy. The enemy is coming faster than you could ever believe! So fight hard and fast. If you don't turn the mutated vegetation into a giant tossed salad, they'll turn you into toast!", "id": 46132, "name": "Power Strike"}, {"genres": [9], "summary": "Mahjong Sengoku Jidai is a Board game, developed by Sanritsu and published by Sega, which was released in Japan in 1987.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/otb0h42kzb1td4nwlhmn.jpg", "width": 936, "cloudinary_id": "otb0h42kzb1td4nwlhmn", "height": 1320}, "id": 46141, "name": "Mahjong Sengoku Jidai"}, {"genres": [4], "summary": "Choose one of four colossal fighters, each one with a number of special moves and fighting techniques, and go head-to-head against the other three! Take on a friend in an exhibition combat, or make your way to the top in the one-player tournament, where you must fight for your life - and the lives of all the people on Earth!", "id": 46140, "name": "Masters of Combat"}, {"genres": [14], "summary": "Tecmo World Cup '92 is a Soccer Sim game, developed by Sims and published by Sega, which was cancelled before it was released.", "id": 46102, "name": "Tecmo World Cup '92"}, {"genres": [9], "summary": "Super Tetris is an unlicensed version of Tetris, released for the Sega Master System in South Korea.", "id": 46116, "name": "Super Tetris"}, {"genres": [8], "summary": "Super Boy 4 is the fourth and supposedly final game in the Super Boy series by Zemina. Super Boy 4 again changes Super Boy's design, this time not being based off of Mario. The graphics, however, are still ripped from Super Mario World but with reduced color depth due to the Master System's technical limitations. Despite this, they are an improvement on Super Boy 3's due to the Master System having better graphical capabilities than the MSX or SG-1000. All sound effects and some of the songs are recycled from Super Boy 3. The game's items, unlike the first three games, are not randomized.", "id": 45625, "name": "Super Boy IV"}, {"genres": [9], "summary": "Dr. Hello is an unlicensed Dr. Mario clone developed for the MSX and ported to the Sega Master System. It was developed in South Korea by a company known as \"Sis Co.\" in 1991, without the backing from either Sega or Nintendo. The game uses a completely different set of graphics and music to Dr. Mario, but the gameplay is exactly the same. \n \nDespite being released on a Master System cartridge, the Master System version runs in SG-1000 mode, and hence appears to have weaker graphics than most other Master System games. This is likely because the MSX and SG-1000 share similar specifications, and porting from one system to another was not too difficult.", "id": 45638, "name": "Dr. Hello"}, {"genres": [31], "summary": "Gameplay involves the player trying to reach Paradise by exploring ten different lands, including desert, marshes, ruins, underground waterways, and forest. While exploring you can collect weapons, by destroying plants. A variety of in-game weapons can be found, some more powerful than others. Some weapons can be used against bosses, which can take a certain amount of hits from the player's default weapon, unless he has companions. The player's companions need to be hired with gold, and until he pays them they remain your enemies. Players must either bribe them or battle them to make them join his quest.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hagsajolkck40q8dbiqw.jpg", "width": 1000, "cloudinary_id": "hagsajolkck40q8dbiqw", "height": 1390}, "id": 45668, "name": "Aztec Adventure"}, {"genres": [5], "summary": "War has been declared between two super powers. At play are real nuclear missiles and the outcome looks dim. If their missiles make contact, there's no chance for survival. Luckily there's hope. You and The Eliminator, the only anti-nuclear laser in operation. Aboard a fugitive space station, you're armed for intervention and your mission is clear: stop all nuclear missiles. But it won't be easy. Because those missiles are being launched at you, too. So play for keeps. This is the most important challenge you may ever face.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wujepf1oqznqxlkz6roh.jpg", "width": 1443, "cloudinary_id": "wujepf1oqznqxlkz6roh", "height": 1987}, "id": 45672, "name": "Missile Defense 3-D"}, {"genres": [14], "summary": "You'll need sharp eyes, a smooth swing, and perfect judgment if you're going to master Golfamania. Out on the links you'll have to consider the distance, the wind, the lie of the ball, where to hit the ball and which club to use. Then watch that power meter and swing for the pin!", "id": 45673, "name": "Golfamania"}, {"genres": [5], "summary": "You control the action as John and Jack, two warriors hand-picked by the United Nations, attempt to bring down a terrorist organization which is responsible for a worldwide wave of violence! The terrorists are capable of launching attacks from the sky, the sea, and by land. Are you the one person who can end this reign of terror?", "id": 45659, "name": "Double Hawk"}, {"genres": [14], "summary": "Your chance to be a champion has arrived! Compete against Europe's finest teams in the football game for 1992. Fast-paced action, multiple options, \"instinctive\" controls and superb animation make Champions of Europe - The official game of UEFA '92 rock solid soccer!", "id": 45655, "name": "Champions of Europe"}, {"summary": "Fly your plane through five levels, shooting enemy planes, submarines, helicopters, and other enemies along the way, and use your equipped cluster bombs if necessary. You need to destroy a target that is outlined in your mission briefing. You have three lives and limited cluster bombs. To help you along the way, you can shoot a power pod to score points, increase your firepower, and gain some help from fellow squadrons.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ztpkv2xg3lgylk7nbvqq.jpg", "width": 1530, "cloudinary_id": "ztpkv2xg3lgylk7nbvqq", "height": 2100}, "id": 45662, "name": "Bomber Raid"}, {"summary": "World peace is at stake! Death Adder, a wicked giant, has stolen the nine crystals from the kingdom of Firewood and has hidden them in nine labyrinths that he has created. These nine magic crystals protected the people from evil – especially from Death Adder's grasp. But now that the crystals are lost, the world is defenseless! \n \nSomeone must put an end to the fiend's realm of darkness, death and destruction! Do you have what it takes to bring back peace and happiness? Trek through deep, dark forests and sail across vast, stormy seas. Chop down trees with your Battle Axe and move rocks with your magic spells to find secret caves. When you take on Death Adder's gruesome monsters, think only of winning – or else you won't find the nine crystals. And when you do, you'll find the Golden Axe – the only weapon that can crush Death Adder!", "id": 46147, "name": "Golden Axe Warrior"}, {"summary": "Players control a satellite and must destroy enemies by moving a crosshair over them and firing the satellite's weapons.", "id": 45648, "name": "Global Defense"}, {"genres": [14], "summary": "Basketball Nightmare is a basketball game where the player plays basketball against strange humanoid creatures on the court where the creature lives. The player must play and defeat each creature before moving onto a new place with a new harder opponent. The player starts of playing against Wolfs in the Forest and then, upon defeating that opponent, moves on to play Frogs at the Pond, One Eyed Aliens at the Waterfall, Vampires in the Skeleton Cave, Geishas in the Bamboo Forest, before finally playing against Samurais at the Shrine. If the player loses a match then that match can be replayed until won. \n \nThe player at the start of each match gets to pick how long the match duration is out of the options of 15, 30, or 45 minutes (not in real time) before being placed on the court. When on the court the player always plays towards the right of the court. First the player tries to get the ball from a throw by a well timed button press. When the player has the ball the player has the option to move, pass the ball, and jump. When jumping the player can shoot, with the accuracy of the shot depending on the timing, or just simply pass. When defending the player can cycle through the field or just simply run into the opponent to challenge for the ball. There are a few penalties that the player can get including but not limited to Travelling (not passing after jumping), Charging (Sometimes called when the player with the ball runs into an opponent), and Pushing (Sometimes called when the player without the ball runs into an opponent) with all the penalties resulting with the other team getting the ball on the side of the court.", "id": 45667, "name": "Basketball Nightmare"}, {"genres": [8], "summary": "After ten thousand years, the once banished Dark Ninja returns to make another attempt to take over the Miracle World. Someone's definitely got to stop him! Guess who dares to meet the challenge? You! You're Alex Kidd, the prince who knows no fear. \n \nA lovely girl has been kidnapped and her life is at risk! And she's your girlfriend from the planet Shinobi! By holding her hostage, the Dark Ninja plans to realize his fiendish scheme. She must be saved before it's too late! \n \nYou need more than courage to be successful. Transform into a fireball and burn up enemies that come at you. Jump up and across towering walls with your amazing wall-climbing skills. Turn into a tornado and twist your way out. And when you encounter the Dark Ninja, think only of winning. Otherwise you'll lose your girl and, worse yet, the Miracle World will be doomed forever!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fxqukfjergy1sh9hspqa.jpg", "width": 963, "cloudinary_id": "fxqukfjergy1sh9hspqa", "height": 1352}, "id": 45670, "name": "Alex Kidd in Shinobi World"}, {"summary": "ALF has an enormous appetite (eating everything he can get his hands on); he is also troublesome, sarcastic, slovenly and cynical, and sometimes he puts himself at the risk of being discovered while perpetrating some of his often-unintentional pranks. However, if things have gone too far, he does as much as possible to make up for his mistakes, generally with positive results.", "id": 45669, "name": "ALF the Alien Life Form"}, {"summary": "The Year: 2242. You're the toughest bounty hunter in the galaxy. You've amassed a fortune by defeating the most vicious creatures known to man. And now, deep inside the enemy Cyborg Fortress, you can almost taste your next paycheck. But there's a little work to be done before you cash in. Like blasting swarms of deadly Cyborgs with your powerful psycho gun. And a battle-to-the-death showdown with Vipron, the vile Cyborg leader. Prepare yourself for one explosive payday!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mlzyfj7yxrbpyoj4idon.jpg", "width": 1530, "cloudinary_id": "mlzyfj7yxrbpyoj4idon", "height": 2100}, "id": 45653, "name": "Cyborg Hunter"}, {"genres": [14], "summary": "Brutal Deluxe doesn't live up to their name - in fact they're the worst team Speedball has ever seen. As their manager, it is your job to transform their fortunes. As well as the league system, which consists of 2 8-team divisions and challenges you to advance to the top, there are also 2 cup tournaments, one of which is played out over 2 'legs' with the aggregate score deciding who progresses. \n \nYou can play the matches as well, which is the real meat of the game. They consist of 2 90-second periods, and the gameplay is futuristic, fast and frantic, with heavy tackling encouraged to retrieve the ball. Power-ups and tokens appear on the pitch, including ones to make your players extra-tough or freeze the opponents.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cr6iipp7ygfqdpfsmww8.jpg", "width": 1530, "cloudinary_id": "cr6iipp7ygfqdpfsmww8", "height": 2100}, "id": 46125, "name": "Speedball 2"}, {"genres": [12, 31], "summary": "He has been summoned by Daikak, the great leader of the Summit Temple, to stop a war between factions of warlords. The player explores temples and defeats enemies like ghosts, ninja, and feral beasts. There are also villages to explore and people to talk to as the player assembles clues on who desecrated his home town's temple and killed its guardians. The quest takes the player across medieval Japan and to the Underworld. Unlike most games, death does not lead to game over or even a loss of money or experience points. Instead, the player has to use a password in order to resurrect themselves from the dead.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dg79jxnfxmohmrpmqsfr.jpg", "width": 1436, "cloudinary_id": "dg79jxnfxmohmrpmqsfr", "height": 2000}, "id": 46124, "name": "SpellCaster"}, {"genres": [14], "summary": "Nekkyuu Koushien is a baseball game for the Sega Master System. It was only released in Japan.", "id": 46137, "name": "Nekkyuu Koushien"}, {"genres": [14], "summary": "Choose from the exciting challenges and action of Billiards, Darts or World Bingo! In Billiards, choose nine-ball or rotation. Play the Dart games 301 or 501. Or test your luck in a high-stakes game of World Bingo.", "id": 46135, "name": "Parlour Games"}, {"genres": [8], "summary": "It's a video dream. Or nightmare. \n \nDepending on how well you're doing. \n \nScramble from maze to maze — each more magnificent than the one before it — bumping off bugs, guppies, snails, dominos and more as you go. \n \nGrab precious points for tennis shoes, teddy bears, snails, and other identifiable objects. \n \nAnd try to avoid the ugly Den Den, a snapping dragon head. Or you'll be forced to wake up to reality. \n \nThe colors are fantastic. Even the music is wild.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uqqmzynqzdet5hmieb1i.jpg", "width": 1530, "cloudinary_id": "uqqmzynqzdet5hmieb1i", "height": 2100}, "id": 46100, "name": "Teddy Boy"}, {"summary": "The Dinosaur Dooley is a Shoot-'Em-Up game, developed by Daou and published by Innovation Tech, which was released in Korea in 1991.", "id": 46109, "name": "The Dinosaur Dooley"}, {"summary": "Toto World 3 is a 2D Platformer game, developed by Open Corp and published by Daou, which was released in Korea in 1993.", "id": 46107, "name": "Toto World 3"}, {"genres": [8, 31], "summary": "Life isn't always easy for the Crown Prince of Radactian. When the High-Tech World arcade opened up, someone in your castle tore the map into eight pieces! But it's such a cool arcade, you have to go there. It's a challenge worthy of any Kidd!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r0zittfdafb0yqfqws14.jpg", "width": 1530, "cloudinary_id": "r0zittfdafb0yqfqws14", "height": 2100}, "id": 46112, "name": "Alex Kidd: High-Tech World"}, {"genres": [5], "summary": "SDI - Strategic Defense Initiative, or simply titled SDI and sometimes known as Global Defense. Players control a satellite and must destroy enemies by moving a crosshair over them and firing the satellite's weapons.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bsv03exayv411iabvzwm.jpg", "width": 640, "cloudinary_id": "bsv03exayv411iabvzwm", "height": 897}, "id": 12848, "name": "SDI"}, {"genres": [10, 14], "summary": "In this game you play the role of an endurance bike racer. The gameplay involves you racing against the clock to get to the finish line and jumping over ramps. At the end of each race you get points for how many cars or bikes you have overtaken with which you can upgrade your bike. There are various different terrain for you to race on including desert beach and dirt tracks plus a number of things to slow you down or even knock you off of your bike all together. The main idea is to find the best route through each level to shave off valuable seconds in order to over take more cars and bikes. \n \nThe Japanese version of the game has more Tracks than the European and US versions have. Among them is a snow track which is one of the hardest tracks in the game, because there is a lot of stones on the thin road.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/u8vmepdeex3cnq88q0cb.jpg", "width": 1534, "cloudinary_id": "u8vmepdeex3cnq88q0cb", "height": 2100}, "id": 6666, "name": "Enduro Racer"}, {"genres": [8, 33], "summary": "Alex Kidd: The Lost Stars features Alex Kidd and Stella searching for the twelve Zodiac signs.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lizqtfvuh8hvolyvkxrc.jpg", "width": 180, "cloudinary_id": "lizqtfvuh8hvolyvkxrc", "height": 255}, "id": 13678, "name": "Alex Kidd: The Lost Stars"}, {"genres": [14], "summary": "Rocky Super Action Boxing is the first licensed video game based on the popular Rocky film series. The game is based on Rocky III and was designed by Coleco. In the game, the player can play as either Rocky Balboa or Clubber Lang in the game, either against the computer in a one player game, or against each other in a \"Head to Head\" two player mode. There is also a \"Demo\" mode if the player wants to watch Rocky and Clubber Lang fight. \n \nSince Rocky Super Action Boxing is one of the later ColecoVision titles released, it includes a pause feature for the game. \n \n \nEach boxing match consists of, according to the skill level chosen, two, five, ten, or fifteen rounds each lasting one minute each. During gameplay, the player's movement is restricted to three positions or \"lanes\" vertically, and from each player's side of the ring to the front of their opponent horizontally. \n \nThe 4 button controller allows for (independently) offensive hits to the body or head, defensive blocking for the head and body, and ducking. \n \nPoints are scored in the game by hitting the opponent's guard (1 point), or with a punch connecting with the opponent's head or body (2 points for either hit). \n \nVictory can be achieved in two ways, either by knockout, or by point count if the fight goes all the way to the end.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ffahmeh5elsn0xsw24oo.jpg", "width": 1000, "cloudinary_id": "ffahmeh5elsn0xsw24oo", "height": 1397}, "id": 37175, "name": "Rocky"}, {"genres": [5, 33], "name": "Bank Panic", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jqyxtuhkbemjbz3hxdy3.jpg", "width": 850, "cloudinary_id": "jqyxtuhkbemjbz3hxdy3", "height": 1108}, "summary": "Bandits are holding up a bank and have taken people hostage, and as a gunslinger, it's your job to shoot them. The bank has 12 doors, and the bandits are behind each one of them. When they pull a gun out at you when you open a door, you have only a few seconds to shoot them before they shoot you. If you shoot them too early (ie: before he sticks his gun out at you), it is considered unfair, and you won't score any points, but if you're too late, he'll shoot you and you lose one of your three lives.If you waste too much time, a bandit will come out from one of the doors and stick dynamite on it. You must then shoot the dynamite to get rid of it. \n \nIf you're lucky, either a man or a woman will throw you a bag of gold coins. If you shoot any of these people by accident, you also lose a life. More often than not, the person will throw his/her hands up, saying \"I haven't got anything\". That's when they will be replaced by bandits. \n \nSome men will carry three to five pieces of gold on top of their heads, and shooting at all of the gold will award you with a bag of gold coins. Others will be tied up with rope. If you shoot the rope, there's more money for you, because not only will you receive one bag of gold coins, but you'll get three bags of gold coins.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/vpce5ugflkkkcqdunehr.jpg", "width": 1080, "cloudinary_id": "vpce5ugflkkkcqdunehr", "height": 1080}], "id": 6083}, {"genres": [5, 33], "name": "The Ninja", "videos": [{"video_id": "P_eY4RzCMLI", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r46s1eio2shjfr4wlxmt.jpg", "width": 500, "cloudinary_id": "r46s1eio2shjfr4wlxmt", "height": 672}, "summary": "It is typical of a run and gun game, such as Commando and Ikari Warriors, where the player has to shoot enemies and defeat a boss. Enemies include samurai, ninja and dogs.", "storyline": "Throughout your Journey to the Ohkami Castle, you'll battle evil Ninja Warriors. Once there, you must destroy their leader, Gyokuro. Only then Will you be able to save the princess from her prison Inside the castle.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xdoex2c9odrejswd9bdz.jpg", "width": 468, "cloudinary_id": "xdoex2c9odrejswd9bdz", "height": 351}], "id": 12889}, {"genres": [8], "name": "Alex Kidd in Miracle World", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/v0nwvwykbcviv1zmk1gu.jpg", "width": 300, "cloudinary_id": "v0nwvwykbcviv1zmk1gu", "height": 420}, "summary": "Journey through the planet Aries to the beautiful City of Radactian - and save it from the evil Janken the Great.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/icsl22liapzdlet6fzo1.jpg", "width": 1024, "cloudinary_id": "icsl22liapzdlet6fzo1", "height": 768}], "id": 26778}, {"genres": [10, 33], "summary": "As young Alex, your job is to go through an obstacle course and get to the main exit without other competitors trying to push you off your bike. You start out in Blackwood Forest, but depending on which scene you're in, you can travel to Cactus Desert, South Seas, Pyramid River, or Alex's home, Radaxian.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/el2vavtr06nlfulbu2mx.jpg", "width": 1000, "cloudinary_id": "el2vavtr06nlfulbu2mx", "height": 814}, "id": 37174, "name": "Alex Kidd: BMX Trial"}, {"genres": [5, 33], "summary": "Basic Sega shoot-em-up in which you must guide your ship through three zones while avoiding hazards. Your only weapon are bullets as your only defense, but if you shoot the flashing red pieces on the terrain, chances are that a green ship will approach you, and if you collect this ship, your weapons will be upgraded so that you shoot a laser beam instead. Keep collecting ships and you can shoot up to three laser beams at once. \n \nAt the end of each zone, you will come across a boss that takes multiple hits to kill. If you manage to conquer all three zones, you are back to where you started. The whole point of this game is to earn as many points you can without losing all of your lives.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ovnqjyxbmhwv1dzwavuk.jpg", "width": 1000, "cloudinary_id": "ovnqjyxbmhwv1dzwavuk", "height": 1358}, "id": 37176, "name": "Astro Warrior"}, {"summary": "The game had a choice of 3 arcade games to play. They are Centipede, Breakout and Missile Command.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hmfysrgt5zuftxxvf1q2.jpg", "width": 1527, "cloudinary_id": "hmfysrgt5zuftxxvf1q2", "height": 2100}, "id": 46151, "name": "Arcade Smash Hits"}, {"genres": [15], "summary": "Welcome to Sega Royale, where fortunes can be made or lost with the turn of a card. You have $500 to play the games of your choice. Which will they be? Challenge high stakes gamblers in a game of poker. Beat the dealer in a fast-moving game of Black Jack. Enter the world of the rich and famous in the famous game of Baccarat. Run the gambit with Lady Luck on the Sega slot machines, or just relax with a game of pinball! Bet as little as $1, up to $1,000, in your living room. Casino Games even has a Password save so you can keep your winnings for your next gambling trip! If you lose all your cash, remember; at Sega Royale experience is the greatest reward. There's always tomorrow...and another $500 to play!", "id": 45656, "name": "Casino Games"}, {"genres": [5, 33], "summary": "Blade Eagle 3-D is a vertical shoot-em-up which has no story involved. You just have to shoot your way on three planets (you have to travel through space first), blasting as many enemies as possible. Along the way, there are several bosses that you have to defeat. The later ones drop a power-up, which you can use to upgrade your ship. Some of the power-ups include double shots and laser beams. Another power-up gives you the ability to have an extra ship on your side and will join the fight, and will later serve as a backup. Blade Eagle is designed for play in conjunction with the Sega 3-D Glasses. If you play without the 3-D glasses, it will look like as if there are two of your ships, not just one. If there are four enemies approaching you, they will look like eight.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rnnhjothbxr6tddjhcho.jpg", "width": 1000, "cloudinary_id": "rnnhjothbxr6tddjhcho", "height": 1448}, "id": 45663, "name": "Blade Eagle 3-D"}, {"genres": [14], "summary": "You're the manager. And you can field a total of 26 ball teams to battle for league leadership. Pick the team of your choice. Designate the starting pitcher. Then, play ball! And get ready for some of the most exciting baseball since the game was invented. Will it be a slugging match? A pitching duel? Need a pinch hitter or relief pitcher? You decide. It just takes the right strategy. A cool head. And sure ball control. And if you want batting practice, call up The Home Run Contest. A great feature of Great Baseball that lets you swing at 20 perfect pitches. It's going... It's going... It's gone!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jdqoy88ema2rxsd4yjxn.jpg", "width": 1000, "cloudinary_id": "jdqoy88ema2rxsd4yjxn", "height": 1395}, "id": 46145, "name": "Great Baseball"}, {"genres": [5], "summary": "CAUTION: FOUR MEGA POWER! Not double, not triple, but FOUR times the playing power of a regular cartidge. You get the hottest space combat, the baddest explosions, and the coolest sounds ever! Journey to four different planets, each with stunning but deadly landscapes. There's so many awesome enemies, you won't have time to stargaze!", "id": 45651, "name": "Galaxy Force"}, {"genres": [5], "summary": "Satellite 7 is a Shoot-'Em-Up game, developed and published by Sega, which was released in Japan in 1985.", "id": 46130, "name": "Satellite 7"}, {"genres": [31], "summary": "The player controls a on-screen character called Panama Joe, moving him from room to room in the labyrinthine underground of the 16th century Aztec temple of emperor Montezuma II, filled with enemies, obstacles, traps and dangers. The objective is to score points by gathering jewels along the way. Panama Joe must find keys to open doors, collect and use equipment such as torches, swords, amulets, etc. without losing his life. Obstacles are laser gates, conveyor belts, disappearing floors and fire pits.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vdvofacdv8frvlguu3ku.jpg", "width": 1581, "cloudinary_id": "vdvofacdv8frvlguu3ku", "height": 2100}, "id": 46138, "name": "Montezuma's Revenge Featuring Panama Joe"}, {"summary": "Fushigi no Oshiro Pit Pot is an Action game, developed and published by Sega, which was released in Japan in 1985.", "id": 46113, "name": "Fushigi no Oshiro Pit Pot"}, {"summary": "Trivial Pursuit is the world's greatest and best selling board game. This Sega version incorporates everything that has helped make it so. Plus, Russell your animated and friendly question master, superb sound and color, wonderful screen background and over 2,000 brain teasing questions.", "id": 46106, "name": "Trivial Pursuit - Genus Edition"}, {"summary": "Getafix the Druid is out of magic potion! If Caesar finds out, it's invasion for sure. Asterix and Obelix set out to find the necessary herbs. A mission through all sorts of Roman-infested terrain - seas and rivers, forests and deserts, temples and ruins.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gbxaimsdu6cum2l0xdao.jpg", "width": 477, "cloudinary_id": "gbxaimsdu6cum2l0xdao", "height": 669}, "id": 12888, "name": "Asterix and the Secret Mission"}, {"genres": [14], "summary": "This is basketball at the professional level. Full of international competition from the first jump ball to the last jump shot. Whether it's four on three or three on two - the action is fast and furious. And there are no favorites in this demanding play. You'll be called for double dribbling, cheered for every slam-dunk and carried off the court for making the winning free throw. But so will your opponent. So go for it. Your tough offense can put a \"fast break\" in the opposing team's stride while your defense remains solid as a rock. But think fast - because two can play at this game - and only one can win!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kbmgqxgdgf2lnhmv0sjc.jpg", "width": 1333, "cloudinary_id": "kbmgqxgdgf2lnhmv0sjc", "height": 1987}, "id": 46672, "name": "Great Basketball"}, {"genres": [8], "summary": "The player controls Mick, a young vampire hunter out to destroy five vampires in each stage before proceeding to the next. \n \nEverything is out to stop Mick from completing this tasks and making his way out of the mansion. The player has to punch, or jump on, his enemies to defeat them. Arrows will be flying from either direction and will attempt to hit Mick on the head, and he must either duck or jump on them for extra points. Players can jump or touch lights to freeze everything on screen for a few seconds. Rather than punching, the player can collect a sword on the lower level by jumping on it as it flies past him.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/r21xjqvm3iff8ok7en2r.jpg", "width": 1530, "cloudinary_id": "r21xjqvm3iff8ok7en2r", "height": 2100}, "id": 45649, "name": "Ghost House"}, {"genres": [31], "summary": "The followers of the evil Ra Goan have toppled the king from the throne. None are brave enough to take his place. The Elders have decreed that any man who can pass three tests will become King of Baljinya. Find the Tree of Merill. Defeat the Goblin of Balala Valley. Destroy the Statue of Evil. It sounds easy. But the followers of Ra Goan are waiting to stop you! It's an adventure that will take you across rivers and oceans, through swamps and over mountains. You have a sword and a bow. But magical weapons may become yours... for a price. Pass the tests and you shall be king. But remember: There's more to being a Lord of The Sword than hacking apart thine enemies!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/py06fs26xvzogl5gpuaa.jpg", "width": 1156, "cloudinary_id": "py06fs26xvzogl5gpuaa", "height": 1613}, "id": 46671, "name": "Lord of the Sword"}, {"genres": [10], "summary": "Strap yourself in and take a 3-D ride on the wild side. Sega's Out Run 3-D is so close to reality it will leave you breathless! As your car whips around treacherous curves and over hills, you can almost feel the engine screaming and the wind whipping through your hair!", "id": 46136, "name": "OutRun 3-D"}, {"genres": [5, 8], "summary": "They're at it again. The dreaded Norsa Empire is back... and stronger than ever before. This time they won't make any mistakes. Others have tried to stop them and all have failed. The evil Baron Ricks knows you are coming. And it's a trap! But you're the galaxy's last hope. Can you do what's never been done before?", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dgggrjqoroliml1tihwg.jpg", "width": 1581, "cloudinary_id": "dgggrjqoroliml1tihwg", "height": 2100}, "id": 46114, "name": "Zillion II: The Tri Formation"}, {"genres": [14], "summary": "Ever wanted to play in the big leagues? Now is your chance. Step up to the plate with Sega's Reggie Jackson Baseball. It's so real you'll be grabbing for the hotdogs as you hammer 'em out of the ball park! Play against the computer or with a friend. Take your pick of twenty-six American or National City teams. You can choose a mini two-out-of-three tournament, go for the Series or test your batting skills in the Home Run contest. Reggie Jackson Baseball gives you the power to select your pitchers and pitches, to bat high and low, to lead off or try to steal your way around the bases. Is there a man leading off on second? fake a pitch and catch him off base. Move fast and snatch a ground ball from the infield for a double play! When the game is over, you'll get tips from Reggie himself. Go far enough and win the Series! It's baseball action like you've never seen before, only from Sega.", "id": 45630, "name": "Reggie Jackson Baseball"}, {"genres": [14], "summary": "It's the snap! You sweep to the right. the quarterback hands you the ball. You head for daylight as the linemen open a hole. Suddenly, 250 lbs. of screaming tackle is heading your way. He wants to make you splat city. What will you do? This game gives you the chance to find out. With Walter Payton Football you can play against the computer, or against a friend, in a Monday Night Game or in a series on the Road to the Superbowl. Choose from 28 west, central and eastern teams. Offense and defense. Should you run or pass? Will a reverse throw 'em off guard? In the middle of a hot series, you can save your standings with a Password save. The Superbowl ring has never been this close. If you like football, then Sega's Walter Payton Football is the game for you!", "id": 45629, "name": "Walter Payton Football"}, {"summary": "This game was originally released only in Japan on Sega Card, though has appeared in several compilations since.", "id": 45627, "name": "Comical Machine Gun Joe"}, {"genres": [14], "summary": "Dallyeora Pigu-Wang (달려라 피구왕), roughly translated as \"Run Dodgeball King\" is a dodgeball game for the Sega Master System. It was only released in South Korea.", "id": 45624, "name": "Dallyeora Pigu-Wang"}, {"genres": [4], "summary": "THE FATE OF THE HAN DYNASTY IS IN YOUR HANDS! \n \nIn the final years of the Eastern Han Dynasty, under the reign of Emperor Ling, ten eunuchs in the imperial palace abused their power. The country was in a dreadful state of affairs; bandits began an uprising, and the people were in turmoil. \n \nThe emperor asked the lords of the land to crush the rebellion, but this only resulted in a race for power. After Dong Zhuo usurped the throne only to be quickly defeated, civil war erupted. \n \nFinally, it was Cao Cao who took control of the emperor, commanding the lords in his name. After years of harsh fighting, Cao Cao united the north and prepared to conquer the south in an attempt to unite all of China. \n \nLiu Bei, the fate of the Han Dynasty is in your hands! Will you linger in fear, waiting for death to find you? Or will you take a stand against the evil forces of Cao Cao? Don't hesitate; take your five tiger generals and rush to destroy the enemy!", "id": 45626, "name": "Sangokushi 3"}, {"genres": [14], "summary": "Dallyeora Pigu Wang (달려라 피구왕) translates roughly to \"Run Dodgeball King\" and the game is often referred to as \"Dodgeball King\" in non-Korean speaking communities.", "id": 45632, "name": "Dodgeball King"}, {"genres": [33], "summary": "The evil Menons have returned... in multi-level bases which are hidden in seven different planets! The brave Opa-Opa has been called to battle their evil threat. And joining him in the fight is his younger brother, Upa-Upa. Your Mission: Guide this brave team of brothers through level after level of treacherous mazes. Get the golden coins stolen by the Menon hoard and use them to purchase powerful weapons. The Fantasy Zone is counting on you! Don't let them down.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ka8mabiogjsd6visifkl.jpg", "width": 1443, "cloudinary_id": "ka8mabiogjsd6visifkl", "height": 1987}, "id": 45658, "name": "Fantasy Zone: The Maze"}, {"summary": "Enter the wild, fun-filled world of Mike Chen. He's out to learn the secrets of the five lands so he can become a powerful wizard of the skies! Already he has tamed a cloud to carry him around. He has learned the art of the shooting Ki force from his fingertips! but standing against him are more wacky, zany creatures than you can shake your chopsticks at! Bird men. Flying cat heads. Pigs with guns. And flying bowls of soup! Sounds funny...but remember that each can zap you with a touch! You do have a couple of tricks up your sleeve. Collect power-up pots to fly faster and make your Ki force even more powerful! Defeat the mid-round bosses and you will earn the use of true magic...fireballs, guardian flames and bouncing bombs. Defeat the five world guardians and you'll become a Cloud Master! Fail, and you'll be locked in combat forever. Are you really going to let a flying dumpling get the best of you?", "id": 45654, "name": "Cloud Master"}, {"genres": [8], "summary": "South America release \n \nMadame Who-Said has been coating famous Toons in wax to make statues for her Wax Museum, and the next victim will be Bonkers! Now he needs to stop her, free his pal Lucky and find the Toon Toaster to un-wax the Toons. \n \nIn this platform game, the player controls Bonkers through several levels where he must find 7 pickle clues. By pressing the pause button, a compass is shown, with the number of remaining clues and the direction of the next one. Bonkers can run (by holding button 1), jump (button 2) , duck and slide (by running and pressing the opposite direction on the d-pad). \n \nBonkers will find several items to restore his health (like cups of coffee, donuts, slices of pizza and badges) as well as some bonus items. He'll also find some of his friends, like Marylin, who'll show him the way to bonus levels, where he must find pieces of the Toon Toaster. In these bonus levels, Bonkers will ride a mine cart in a rail course, trying to collect items. \n \nAfter a row of sub-levels, Bonkers will have to fight a boss, usually villains from the TV show.", "id": 45661, "name": "Bonkers Wax Up"}, {"summary": "When Machiko Tashoku, the daughter of the Pscane Corporation's head honcho, is abducted by the Pigs of the Apocalypse and forced indignantly into the Gamescape, Zitz leaps into the action fists-a flain! \n \nBut Even for a Battletoad there's too much pork to pummel - and after a beastly bashing, he jains Machiko as the Parkers' prisoner! \n \nRash and Pimple are soon to soar on the scene - an' with Rash lookin' lean an' green and Pimple actin' mean, it's obvious that a rescue's about to begin! \n \nOnly it ain't gonna be seay, 'cuz the pigs have taken them to the dingy Dark Tower, home of the sinister Silas Volkmire and his equally evil partner, the deadly Dark Queen! Their malevolent minds have found a way to leak their computerized world into ours, with the fiendish intention of creating a worldwide Gamescape over which they would rule!", "id": 45665, "name": "Battlemaniacs"}, {"genres": [13, 14], "summary": "Keep your head down. Eyes on the ball. Grip the club firmly... and swing. Welcome to the Sega Master's Tournament where you need to play better than \"par\" if you want to win. So tee-up for some real fun. And remember to play with caution. This championship course has been groomed for a truly competitive challenge. Eighteen holes full of roughs, bunkers and water hazards will put your nerves to a real test. But not to worry. You've got some clever moves to meet the challenge of a \"dog leg\" fairway or a tricky green. So go for a sneaky slice or hard hook to outplay the rest. Winner takes all! FORE!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zoni1lbrble9hky5fwtv.jpg", "width": 1530, "cloudinary_id": "zoni1lbrble9hky5fwtv", "height": 2100}, "id": 46143, "name": "Great Golf"}, {"genres": [14], "summary": "Playoff fever grips you. And no wonder. You're the driving force that can take your football team to the top in this rough and tumble contest between the leagues. The outcome of the game is in your hands. As the quarterback, you select the plays. Line up the formations. Call the signals and carry the ball. Cut down your opponent with deadly blocking. Intercept a pass. Make a flying tackle. All you need is skill. Strategy. Cunning. And nerve. For non-stop action that charges across the screen. You decide to pass. It looks good. Touchdown!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kzddal4ekik2ou4thzzr.jpg", "width": 1000, "cloudinary_id": "kzddal4ekik2ou4thzzr", "height": 1402}, "id": 46144, "name": "Great Football"}, {"genres": [12], "summary": "Enter the world of Golvellius. Where demons rule the valley of water...and control the creatures of land, sea and air. Where almost everyone stands against you. There is only one way in...and no way out except victory or death! \n \nIt's an adventure that will take you across deserts and mountains, oceans and forests...through eerie graveyards and caves filled with danger and surprise. \n \nGolvellius has a PASSWORD SAVE feature that lets you keep all your possessions. So you never have to start an adventure empty handed!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jmqga2cc0exvmoas51fv.jpg", "width": 1043, "cloudinary_id": "jmqga2cc0exvmoas51fv", "height": 1500}, "id": 46146, "name": "Golvellius: Valley of Doom"}, {"genres": [5], "summary": "Galactic Protector (ギャラクティックプロテクター) is a Sega Master System shoot-'em-up game developed and published by Sega. It stars Opa Opa of Fantasy Zone and Zillion fame, who must save various planets from enemies and debris hurtling towards them. \n \nThe game is built specifically for the Paddle Control, and therefore cannot be played on a standard Master System Control Pad. This also makes emulating the game tricky. \n \nLike the Paddle Control itself, Galactic Protector was not released outside of Japan. It was released as part of the Fantasy Zone Complete Collection for the PlayStation 2, also Japan only.", "id": 45652, "name": "Galactic Protector"}, {"summary": "Sukeban Deka II: Shoujo Tekkamen Densetsu is an Adventure game, published by Sega, which was released in Japan in 1987.", "id": 46119, "name": "Sukeban Deka II: Shoujo Tekkamen Densetsu"}, {"genres": [14], "summary": "On your first serve, the ball explodes off your racquet like a fiery missile. Instinctively you move toward the net. Your opponent returns your serve, but you're ready for him. With lightning speed you raise your racquet and smash the ball. He never had a chance. You're the Tennis Ace!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/diuzmikn9rgkjzld12hk.jpg", "width": 1530, "cloudinary_id": "diuzmikn9rgkjzld12hk", "height": 2100}, "id": 46111, "name": "Tennis Ace"}, {"genres": [5, 33], "summary": "The enemy has built battle fortresses in the farthest reaches of space. There's only one way in... and one way out. Your Mission: To infiltrate the enemy's defenses and destroy their motherships!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z49oiwkan5qqkascliy2.jpg", "width": 1000, "cloudinary_id": "z49oiwkan5qqkascliy2", "height": 1367}, "id": 46104, "name": "Zaxxon 3-D"}, {"genres": [8], "summary": "Digger Chan is a brand new \"homebrew\" game created exclusively for the classic 8-bit Sega Master System game consoles. It will be the first new game to be released on cartridge for the Master System since 1998! \nDigger Chan Screen Shot 1 Digger Chan Screen Shot 2 \n \nYou play as Digger Chan working for M.O.O. Milk Co, and it's your job to go around the globe fixing the milk pipelines buried deep beneath the ground. Everyone loves having fresh cool milk available on tap, and the customers get displeased when there are problems with the pipelines, cutting off their supply of milk. \n \nGetting down to the pipelines is not an easy job, digging is exhausting with only sporadic bottles of milk available to collect and quench your thirst. As if that wasn't enough to worry about, rival milk companies have hidden deadly explosives in your path to disrupt your work!", "id": 45622, "name": "Digger Chan"}, {"genres": [5], "summary": "Porkpolis - the city of flying pigs. Long ago, the flying pigs built large greenhouses to grow leafy greens year round. The pigs are well fed, but they create more waste than the land can handle. The greenhouses are put on gigantic floating platforms which float above a literal sea of... waste. The land below can not support life. But the pigs just keep eating and don't seem to care. \n \nUrchin is a flying pig from this city. Urchin wants to be an explorer. So one day he up and flew into the distance. He saw many interesting lands, but suddenly strange creatures and flying dinnerware came at him. He quickly realized they were trying to eat him! Urchin is flying home - and you can help! Use your light phaser (or control pad) to shoot down foes while Urchin flies home. Protect your pork!", "id": 47058, "name": "Porkpolis"}, {"genres": [31], "summary": "The game revolves around a dog and his family. Being one of the earliest adventure games for an 8-bit console system, the game tends to be simplistic compared to today's adventure games. As a Japan exclusive video game, literacy is required in the Japanese language in order to play the game. The character seems to have an anime-like influence as the people are watching out for the dog that is sitting on a log. Among the human beings, however, is an alien-like creature. While the literal translation would be Searching the Stars..., the actual alternative title is The Story of Mio.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hjnmjr4qckzizyiexv6i.jpg", "width": 1053, "cloudinary_id": "hjnmjr4qckzizyiexv6i", "height": 1485}, "id": 46149, "name": "Hoshi wo Sagashite..."}, {"genres": [14], "summary": "Great Volleyball (グレートバレーボール) is a sports game developed and published by Sega for the Sega Master System. It is part of the Great Sports series and was released internationally in 1987.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hmbgyqrlwktxqf4ltm63.jpg", "width": 1000, "cloudinary_id": "hmbgyqrlwktxqf4ltm63", "height": 1395}, "id": 46150, "name": "Great Volleyball"}, {"genres": [14], "summary": "Welcome to the Big Leagues. Here's a rough and tumble hockey game that takes a steady hand and quick reflexes. Because your mean opponents mean business. Teams line up in full defense. Tackle one another. Scramble for the puck. Drive relentlessly for a goal. Victory for your team depends on you. So you need sharp techniques. Quickness. Power. And smooth stick-shifting ability. Show you have the right touch, hit the puck straight into the goal. But just relax your guard, and see why they call the game of hockey \"wrestling on ice.\"", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/x4lqjubpw7apbo0tinn4.jpg", "width": 1000, "cloudinary_id": "x4lqjubpw7apbo0tinn4", "height": 1412}, "id": 46142, "name": "Great Ice Hockey"}, {"genres": [9], "summary": "Spider-Man: Return of the Sinister Six is a side-scrolling game which puts you in the role of Spidey throughout six levels against Electro, Sandman, Mysterio, Vulture, Hobgoblin and Doctor Octopus respectively. Some puzzle solving (like finding a key) is necessary to beat some levels. Spidey can duck jump, climb walls, punch, shoot webs to swing (by pressing punch and jump together) and perform a jump kick (by pressing the punch button twice). Collecting web cartridges allows Spidey to shoot limited web projectiles. \n \nAlthough hard to die, Spidey has only one life, there are no items to recharge life (but killing some guys will do so) and only one continue.", "id": 46123, "name": "Spider-Man - Return of the Sinister Six"}, {"genres": [14], "summary": "\"Challenging courses, a variety of modes and realistic gameplay - Sega World Tournament Golf has it all!\"", "id": 46128, "name": "Sega World Tournament Golf"}, {"genres": [5], "summary": "Robots Go Berserk! Dateline: Assault City, 2092. It's a robot mutiny! Central Computer Control is in chaos. Armed KillerBots are running amok, blasting loyal Bots into metal junk and piles of whining servomotors!", "id": 46117, "name": "Assault City"}, {"genres": [9], "summary": "Snail Maze is a 1986 video game by Sega, part of the Sega Master System. Instead of being released on a cartridge, it was built into the system's BIOS and could be played by starting the system without a game cartridge inserted and holding Up and buttons 1 and 2 simultaneously. The later \"Master System II\" model did not include Snail Maze, it instead included a built in Alex Kidd in Miracle World. Snail Maze was never released in cartridge or card format.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/wlvbiewyoand2gl4y5vh.jpg", "width": 1598, "cloudinary_id": "wlvbiewyoand2gl4y5vh", "height": 2160}, "id": 46118, "name": "Snail Maze"}, {"summary": "Solomon no Kagi: Oujo Rihita no Namida (ソロモンの鍵 王女リヒタの涙) is a platform-puzzle arcade game developed by Tecmo, which was subsequently brought to the Sega Master System by Salio in 1988. The game was brought to the west via other platforms as Solomon's Key, though the Master System version remained exclusive to Japan. \n \nThe object of the game is get a key and then make your way to the exit. To achieve this, Solomon can create and destroy blocks, which can be used to trap enemies or as platforms. \n \nYou and Dana, the wizard of Lyrac, must unlock Solomon's scroll of secrets to restore peace in the constellations. With Dana's magic, fire, and mystical powers, you will help release the imprisoned Princess of the Fairies and harness the evil forces within the constellations. But first, you need the key! Solomon's Key!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/octyqsz3hu8blwem54zv.jpg", "width": 936, "cloudinary_id": "octyqsz3hu8blwem54zv", "height": 1306}, "id": 46127, "name": "Solomon no Kagi: Oujo Rihita no Namida"}, {"genres": [5, 33], "summary": "The intergalactic warrior Space Harrier returns... in an all-new 3D adventure! The peaceful Land of the Dragons is again under attack. Evil creatures fill the land and sky. Euria, the magnificent white dragon, is being held prisoner in a diabolical trap. Only you, the Space Harrier, can set him free. But this time, the challenge is greater than ever before! Put on your SegaScope 3D Glasses. The screen will come alive with new 3D graphics, enemies and wild new battle scenes! Only you stand between the peaceful dragons and defeat. Get ready for the battle of a lifetime!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hmtfmzeerazd8x78dg5i.jpg", "width": 1530, "cloudinary_id": "hmtfmzeerazd8x78dg5i", "height": 2100}, "id": 46126, "name": "Space Harrier 3-D"}, {"genres": [4], "summary": "After Axel Stone, Blaze Fielding and Adam Hunter destroyed the evil Syndicate leader, Mr. X, the city became a peaceful place to live, and each one of them followed their own paths. One year later, after their reunion, Adam's brother Sammy returned from school to find their apartment in a mess, and Adam nowhere to be seen, and after calling his two friends, one of them notices a photo of Adam chained to a wall, next to someone they knew very well - Mr. X, who returned to turn the peaceful city once again into a war zone. Now, Axel, Blaze, Sammy, and Axel's good friend Max, a pro wrestler, must head out to stop Mr. X once again...hopefully for good...", "id": 46121, "name": "Streets of Rage II"}, {"summary": "The Meta-creature has returned to haunt the citizens of Balderia, who haven't yet recovered from their last encounter with the monster four years ago! Guide Admiral Mikan through the underwater dangers and into the enemy complex, and help him get rid of the monster for good!", "id": 46120, "name": "Submarine Attack"}, {"genres": [5], "summary": "Battle Stations! Battle Stations! Your country is being attacked. You'll be fighting on the U.S.S. Poseidon; an armor-plated attack cruiser with radar, sonar, 76mm cannons and surface-to-surface missiles. First come the training rounds. They'll throw everything they have at you... jets, cruisers, torpedoes, cannons. And then the fun really starts! Combat missions! You're on the open seas. You have blips on the radar. Line up your gunsights and let 'em have it. You pick up an enemy cruiser on your sonar. Get ready with an armor piercing missile and send them to Davey Jones locker. If you complete your missions, you will be awarded with the Navy's highest honor... a promotion to Fleet Admiral.", "id": 46134, "name": "Poseidon Wars 3-D"}, {"genres": [10, 14], "summary": "Super Racing is a Racing game, published by Sega, which was released in Japan in 1988.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/udogcyezw86hdiyl7pg6.jpg", "width": 1170, "cloudinary_id": "udogcyezw86hdiyl7pg6", "height": 1650}, "id": 46103, "name": "Super Racing"}, {"summary": "Megumi Rescue is an Action game, developed and published by Sega, which was released in Japan in 1988.", "id": 46139, "name": "Megumi Rescue"}, {"summary": "Tensai Bakabon is an Action game, published by Sega, which was released in Japan in 1988.", "id": 46110, "name": "Tensai Bakabon"}, {"summary": "Disney's Ariel: The Little Mermaid is an Action game, developed by Blue Sky Software and published by Tec Toy, which was released in South America in 1992.", "id": 45628, "name": "Ariel: The Little Mermaid"}, {"summary": "The Three Dragon Story is an Action game, developed and published by Zemina, which was released in Korea in 1989.", "id": 45623, "name": "The Three Dragon Story"}, {"genres": [8], "summary": "Bread and Butter is an arcade style action game for the Sega Master System (or emulator). You run, jump, climb and float on balloons to avoid wild animals and collect the super-sized ingredients to bake the Bread of Legend. \n \nBread is a girl with brown hair who always wears an apron and a chef's hat. She wants to become the greatest baker in existence and things such as danger and common sense won't stand in her way! Butter is just a fat boy in a green shirt with blond hair who loves to eat. So he follows Bread everywhere she goes, for food is soon to follow. \n \nIt is Bread's life goal to bake the Bread of Legend. The ingredients are rare and hidden in very dangerous places. Bread sets off without hesitation to collect the ingredients. Butter warns Bread of the dangers, but she doesn't listen. Butter still follows, as his stomach always gets the better of him. \n \nCollect the ingredients from 8 different stages as you go for the high score!", "id": 45639, "name": "Bread and Butter"}, {"genres": [5, 33], "name": "Alien Syndrome", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xhxidvyivyj04adivsoi.jpg", "width": 1000, "cloudinary_id": "xhxidvyivyj04adivsoi", "height": 1350}, "summary": "The time bomb is set. \n \nIt's the only sure way to get rid of these aliens. For good. \n \nThey're vile. Vicious. And villainous. \n \nAnd they've infested our outcolony. \n \nThey're holding hundreds of inhabitants hostage. Some of them your friends. \n \nSo get in there. And get blasting. \n \nInside, you'll find state-of-the-art weaponry. It's yours for the taking. \n \nThere's sector after sector to purge. Each more intricate than the one before it. \n \nAnd there are Super Aliens to confront. Each more hideous than the one before it. \n \nGet the hostages out. And get as many aliens as you can. Before the blast gets all of you.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ermthu75612wfgmbevl0.jpg", "width": 320, "cloudinary_id": "ermthu75612wfgmbevl0", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/opbhkstfvjo8zcincdac.jpg", "width": 320, "cloudinary_id": "opbhkstfvjo8zcincdac", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fc0duspqfahaxx3xtnmi.jpg", "width": 256, "cloudinary_id": "fc0duspqfahaxx3xtnmi", "height": 232}], "id": 4478}, {"genres": [5, 8, 25, 33], "name": "Michael Jackson's Moonwalker", "videos": [{"video_id": "eDc_--eBdVo", "name": "Gameplay video"}, {"video_id": "r37TJdTI5M0", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/khkd4i3iv77faqtd3lpn.jpg", "width": 498, "cloudinary_id": "khkd4i3iv77faqtd3lpn", "height": 611}, "summary": "Several video games based on the 1988 Michael Jackson film Moonwalker. U.S. Gold published various games for home computers, released in 1989, whilst Sega developed two similarly themed beat 'em up video games in 1990; one released for arcades and another released for the Mega Drive/Genesis and Master System.", "storyline": "\"Michael!\" Katy's voice rings out - you've found her! But more children are still lost! Can you stop the psycho mastermind Mr. Big and his goon squad before they kidnap all the kids? You can, if you're Michael Jackson! Moonwalk on muggers, lean on meanies, and pop the punks! Outfight, outjump, outdance! Move like only Michael can, to the beat of Smooth Criminal, Beat it, Billie Jean, and Bad! No bad guy can last through Michael's Star Magic! Punch down gangsters in Club 30. Rumble in the streets. Swing, spin, and kick past graveyard ghouls. Chill in the caverns, then sizzle 'em with ultra-tech weapons in Mr. Big's hideout. Experience the baddest video game ever. Defy physics with Michael's dancing! You never lose your cool. See it and be it - Michael Jackson's Moonwalker!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/svowx9hcbufm13sbczxw.jpg", "width": 567, "cloudinary_id": "svowx9hcbufm13sbczxw", "height": 340}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aabwst23wd705o6sx4qk.jpg", "width": 1280, "cloudinary_id": "aabwst23wd705o6sx4qk", "height": 720}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ekbmi27xu5tknrgjqsgy.jpg", "width": 480, "cloudinary_id": "ekbmi27xu5tknrgjqsgy", "height": 360}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/d0olgirvngz3tz3xj3ao.jpg", "width": 595, "cloudinary_id": "d0olgirvngz3tz3xj3ao", "height": 425}], "id": 18139}, {"genres": [8], "summary": "Fully rendered graphics thrust Sonic into an exciting 3D playing environment. An all new gameplay perspective puts you in the middle of Sonic's 3D adventure! The evil genius Robotnik is after the Chaos Emeralds and it's up to Sonic to stop him. Rescue the innocent Flickies before Robotnik turns them into part of his evil plan! \n \nSonic Blast was the last Sonic game for the Game Gear. \nThe game was also ported to the Sega Master System in Brazil by TecToy and released in December 1997, making it the last game ever made for that system. \n \nWhile this game was released at the end of 1996 in conjunction with the similarly named Sonic 3D Blast, it is worth noting that the two games have little in common. No enemies, levels, or bosses, are shared between the games. The story is also completely different. Sonic and Knuckles join together to collect five of a Chaos Emerald's pieces and confront Dr. Robotnik at Silver Castle.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eabk0avvrxtokyfqg2vo.jpg", "width": 250, "cloudinary_id": "eabk0avvrxtokyfqg2vo", "height": 346}, "id": 19538, "name": "Sonic Blast"}, {"genres": [8, 33], "name": "Rastan", "videos": [{"video_id": "iz5rgV56kdU", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hbswezr2xgeodpfreyij.jpg", "width": 640, "cloudinary_id": "hbswezr2xgeodpfreyij", "height": 824}, "summary": "Rastan, originally released as Rastan Saga (ラスタンサーガ?) in Japan, is a fantasy-themed side-scrolling action game originally released for the arcades in 1987 by Taito and later ported to various platforms. \n \nThe controls of Rastan consists of an eight-way joystick and two buttons for attacking and jumping. By using the joystick in combination with either buttons, the player can determine the height of Rastan's jumps, as well as the direction where he swings his weapon (including downwards while jumping). The game uses a health gauge system along with limited lives, although certain obstacles (such as falling into a body of water or being crushed by a spiked ceiling) will instantly kill Rastan regardless of how much health he has left. \n \nThere are a total six rounds, each consisting of three areas: an outdoor scene, a castle scene and a throne room where the player must confront the stage's boss. The backgrounds of the outdoor areas feature broad landscapes with changing sunlight effects with detail. The game's bosses (names according to the MSX2 version) consists of Graton (a skeletal warrior who wields a halberd), Slay (a demonic swordsman who can sprout wings), Symplegades (a wizard), Laios (a dragon knight), the Hydra (a five-headed snake) and the final boss, the Dragon. \n \nThe player can pick up any item by touching them, as well as new weapons by striking them with his current one. All the weapons and power-ups picked by Rastan will be equipped only for a limited time. When Rastan picks up any equipable item, an icon will appear on the lower right corner of the screen as an indicator of the item's effect until it wears out. Rastan can only wield one weapon at a time (which consists of a mace, an axe and a fireball-shooting sword in addition to his standard sword), as well as only one type of protector (a shield, a mantle or a body armor), but other items (such as the necklace and ring) can be worn at the same time. There are also jewels that gives out bonus points, as well potion bottles that will restore or deplete the player's health depending on the color. The rare golden sheep's head will restore Rastan's health completely.", "storyline": "The player controls a barbarian warrior who has embarked on a quest to slay a dragon. While on his way to the dragon's lair, Rastan must fight hordes of enemy monsters based on mythical creatures such as chimeras and harpies.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/eogfnftt5nsex6nssqgm.jpg", "width": 256, "cloudinary_id": "eogfnftt5nsex6nssqgm", "height": 177}], "id": 6875}, {"genres": [5, 8, 33], "name": "Quartet", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/aoxk1iweb90olj4dr0qe.jpg", "width": 1000, "cloudinary_id": "aoxk1iweb90olj4dr0qe", "height": 1433}, "summary": "A platform shoot-em-up hybrid from Sega for one to four players, selected from either Joe (yellow), Mary (red), Lee (blue) and Edgar (green). The action takes place over a number of sideways scrolling levels, the bulk of which consist of straightforward platform action. On some levels, however, there are jet packs for the players to collect, and the gameplay's emphasis switched to that of a standard, sideways scrolling shoot-em-up. \n \nThe object of the game is to destroy an army of robots that have taken over an Earth colony satellite station. Each level has a boss character that must be destroyed. Upon its death it releases a door key that must be used to exit the level. Weapon and character power-ups can be collected to aid players in their task. \n \nDue to its potential for four-player shoot-em-up gameplay, Quartet's gameplay feels vaguely similar to (though by no means as accomplished as) Atari's 1985 classic, \"Gauntlet\".", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/alqpqelv7kxvmerhxtbs.jpg", "width": 1440, "cloudinary_id": "alqpqelv7kxvmerhxtbs", "height": 1008}], "id": 36677}, {"genres": [14], "name": "World Soccer", "videos": [{"video_id": "g0LKe_UEewc", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kpapnfta1smi6chxhfmv.jpg", "width": 302, "cloudinary_id": "kpapnfta1smi6chxhfmv", "height": 422}, "summary": "World Soccer, known as Great Soccer in the US and Super Futebol in Brazil, is a sports game developed and published by Sega for the Sega Master System. The game was rereleased in Japan a year later under the name Sports Pad Soccer, which was bundled with the Sega Sports Pad.", "storyline": "Dribble, passes, corner kicks, etc. Retrieve the opponent's ball by tackling. Get past his strong defense with an overhead shot. Take advantage of a split—second unguarded goal and head the ball into the net. Also features Penalty Kicks to decide a tie game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/bdbumhsakbldhbb0xapp.jpg", "width": 640, "cloudinary_id": "bdbumhsakbldhbb0xapp", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/kktaxfgjftstqxpo1qws.jpg", "width": 640, "cloudinary_id": "kktaxfgjftstqxpo1qws", "height": 480}], "id": 12893}, {"genres": [13, 33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ovdkz8ho1wp8644eeipb.jpg", "width": 1000, "cloudinary_id": "ovdkz8ho1wp8644eeipb", "height": 1397}, "id": 36679, "name": "F-16 Fighting Falcon"}, {"genres": [14, 33], "name": "Pro Wrestling", "videos": [{"video_id": "ToXufxik6Zs", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cpib8axeemftpw3tpaae.jpg", "width": 265, "cloudinary_id": "cpib8axeemftpw3tpaae", "height": 377}, "summary": "Pro Wrestling is a professional wrestling video game released for the Sega Master System in 1986 by Sega. It centers around tag team wrestling, with four duos that players can select and guide to various championship titles around the world.", "storyline": "Pro Wrestling it's the video match of the year. A no-holds barred battle between you and a friend, or some of the biggest bruisers this side of Madison Square Garden. Just try to pin The Iron Soldier. Or wiggle away from The Giant Bull. Or just survive the cruel Crusher Brothers. Body slam. Drop kick. Pile drive. You'll even have the notorious German Suplex Hold. All at your command. Go for the title. Mexican League, Pacific League or World League. Whatever you d(), play rough. Play to win.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ato3tn3vujj0kk4qm2gh.jpg", "width": 480, "cloudinary_id": "ato3tn3vujj0kk4qm2gh", "height": 360}], "id": 18143}, {"genres": [33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fwrpsika14wdjuhhq8bc.jpg", "width": 800, "cloudinary_id": "fwrpsika14wdjuhhq8bc", "height": 841}, "id": 36678, "name": "Pit Pot: The Magical Castle"}]