[{"genres": [13], "summary": "'89 Dennou Kyuusei Uranai is one of those horoscope sims that used to be very popular in Japan in the early days of home consoles. They still exist today, but they tend to be extended to more interactive dating sims rather than just walls of text to read. \n \nThis game being released in December 1988 and namely so, it was designed to predict your fortune for the upcoming year 1989. This makes attempting to play it already kind of useless once the year had passed. Therefore one can only look back at what the computer predicted for you back in 1989.", "id": 48368, "name": "'89 Dennou Kyuusei Uranai"}, {"genres": [12], "summary": "Centuries ago, the hubris of man led him to tamper with the realm of the gods, and a pestilence swept the land. Some fled to the south, building a great wall to seal themselves away. . This land came to be known as Hylis. The Shogonite are the Warrior class of Hylis, gifted in arms and PSI. They are led by two generals: Sargon and Tyris. The loggers began to vanish near Endengard, it was Sargon who was sent to investigate on behalf of Lord Higa. In the forest north of the town, Sargon and his men were ambushed in the night by a horde of strange beasts. \n \nAt the brink of victory, his own men turned upon him, and he was forced to kill every one of them. Barely surviving this ordeal, Sargon made his way back towards Hylis Keep, to tell Lord Higa of This grave turn of events. \n \nSo it began.", "id": 48344, "name": "Dragoon X Omega II"}, {"summary": "GeGeGe no Kitaro - Yōkai Daimakyō, known as Ninja Kid in the West, is an NES game developed by TOSE and published by Bandai. It was based on the manga series GeGeGe no Kitaro. This game was followed by a sequel titled Gegege no Kitarou 2: Youkai Gundan no Chousen, which was released the following year only in Japan also by Bandai. It was the eighth best selling Famicom game of 1986, selling 1,250,000 copies.  \n \nThe original Japanese version is notably different from the American version (Ninja Kid). The main character is Kitarō, and his main weapon is his hair rather than darts. His sub-weapons are a flying finger instead of shuriken, his vest instead of the feather, and a geta instead of a boomerang. All of these weapons function the same as the ones of the protagonist of the American version, Kyo; they just use different sprites. The fireball sub-weapon remains the same. Certain levels are inhabited by \"western\" film monsters like Frankenstein's Monster and Count Dracula; the boss of these levels is the character Buckbaird, the leader of the \"western youkai\". The scroll which unlocks the fortress is a crystal ball in the original version. The familiars are also different, being characters from the manga: the Pegasus was originally Nurikabe, the Eagle was Konaki Jiji, and the Mirror was Sunakake Babaa. Finally, a few of the minor enemies are different; most notably the \"Pirate Ninja\" found in some of the Guerilla Warfare levels was originally Nezumi Otoko, and Kitaro rides on Ittan Momen during the Dog Fight levels.", "id": 48317, "name": "GeGeGe no Kitaro - Yokai Daimakyo"}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/osvoolesdvudyjt7ujj8.jpg", "width": 1428, "cloudinary_id": "osvoolesdvudyjt7ujj8", "height": 2026}, "id": 48325, "name": "Metal Force"}, {"summary": "When Kenichi Kokuho was a small boy, he was lost in the mountains and never found. However, unknown to anyone, Kenichi has been brought up by his foster father in the wild. When Kenichi becomes 15 years old, his foster father tells him the truth about his background. As he finds out, Kenichi decides to go to a civilized society where his parents live. \n \nEverything Kenichi experiences in the town is a series of surprise and wonder. His family is delighted to see their son alive, but shocked at the fact that he has become wild and different from other children. And now, his new life is about to begin. \n \nHis wild attitude and physical toughness cause various problems in the town. Kenichi has his own way to handle things, but it is too different for the most people to understand what he is up to. Can he get used to life in the town?", "id": 48327, "name": "Moeru! Oni-san"}, {"genres": [14], "summary": "Derby Stallion Zengokuban (\"Zengokuban\" roughly means \"National Edition\") is a Sports game, developed and published by ASCII Entertainment, which was released in Japan in 1992.", "id": 48334, "name": "Derby Stallion Zengokuban"}, {"summary": "Chibi Maruko-Chan: Uki Uki Shopping is a Miscellaneous game, developed and published by Namco, which was released in Japan in 1991.", "id": 48719, "name": "Chibi Maruko-Chan: Uki Uki Shopping"}, {"genres": [31], "summary": "Business Wars is an Adventure game, developed and published by Hect, which was released in Japan in 1992.", "id": 48723, "name": "Business Wars"}, {"genres": [13], "summary": "Bakushou!! Junsei Gekijou 2 (\"A Hearty Laugh! Theater Life 2\") is a virtual life board game developed and published for the Nintendo Entertainment System by Taito on May 22nd, 1991 in Japan. It is the second installment in the Bakushou!! Jinsei Gekijou series and similarly follows the previous game by allowing up to four players to take part and travel around a virtual board through chance rolls, playing out a virtual life in its entirety from childhood to senior citizenship making important decisions along the way. Introduced in this version was the concept of going to prison for crimes, and gambling in a casino.", "id": 48727, "name": "Bakushou!! Jinsei Gekijou 2"}, {"genres": [13], "summary": "Bakushou!! Ai no Gekijou (\"A Hearty Laugh! Theater of Love\") is a virtual life board game developed and published for the Nintendo Entertainment System by Coconuts Japan Entertainment on Dec 29th, 1990 in Japan. \n \nCapitalizing on the popularity of simulation and dating games from the late eighties, specifically the Bakushou!! Jinsei Gekijou series developed by Taito, this game follows many of the genre's tropes from chance rolls dictating life events, to gathering money and physical traits that benefit the player's life. Unlike the Jinsei Gekijou series however, Ai no Gekijou opts to focus on teenage life and romance in particular, rather than the wider scope seen in other life-simulation titles.", "id": 48728, "name": "Bakushou!! Ai no Gekijou"}, {"genres": [10], "summary": "Nakajima Satoru F-1 Hero 2 is a 1991 Japan-exclusive Family Computer Formula One video game developed by Human Entertainment and published by Varie. It is the sequel to Nakajima Satoru: F-1 Hero, and is based on the 1991 Formula One season. There are 16 rounds and only four cars to choose from.", "id": 48301, "name": "Nakajima Satoru: F1 Hero 2"}, {"genres": [15], "summary": "A stock market simulation game from Hect for the NES. Like most, but not all, NES stock market simulators it was never released outside of Japan. \n \nKabushiki Doujou: The Stock Speculation (\"Kabushiki\" is the Japanese stock market, and \"doujou\" is, of course, dojo) is a stock trading simulation game, where the aim is to invest wisely in the stock market and develop a bountiful portfolio. The player is given regular money goals to reach before the next target is due and can buy, sell and manage their stocks to achieve as much wealth as possible. \n \nThe game uses a lot of public domain classical music, such as the title screen's 8-bit rendition of Bach's Air on a G String.", "id": 48750, "name": "Kabushiki Doujou: The Stock Speculation"}, {"summary": "A NES action game developed by SunSoft and the sequel to Mito Koumon. It was never released outside of Japan. \n \nMito Koumon II: Sekai Manyuuki is the sequel to Mito Koumon and is very similar in appearance and gameplay. As in that game, the player controls one of Mitsukini Tokugawa's retainers as they gather clues and evidence of crimes in the area while either avoiding or fighting off hostile NPCs. \n \nUnlike the first game, which was set entirely within Japan, Tokugawa is crossing the world solving issues instead. The first stage is America (specifically the Wild West, as would be chronologically accurate for the 17th century) though there are plenty of other locations to visit across the world as well, including even Transylvania.", "id": 48773, "name": "Mito Koumon II: Sekai Manyuu Ki"}, {"genres": [9], "summary": "Quiz Project Q: Cutie Project & Battle 10000 is a Miscellaneous game, developed and published by Hect, which was released in Japan in 1992.", "id": 48825, "name": "Quiz Project Q: Cutie Project & Battle 10000"}, {"genres": [31], "summary": "An adventure game based on an anime film of the same name, published for the Famicom by Kemco. \n \nToki no Tabibito \"Time Stranger\" is an adventure game with a heavy emphasis on text commands and dialogue, similar to other NES adventure games like Portopia Serial Murder Case or Hokkaido Serial Murders: Fade to Okhotsk. \n \nUnlike Portopia and its sequels, there is very little detective work to be done. The player simply visits important people throughout Japanese history as a time-travelling cop, answering their questions and incrementally moving forwards through time towards the present. Most of the game is depicted in a first-person mode where the other person sits across from the main character, who then asks and answers questions. There are a few third-person sequences where the player must get back inside their spaceship-like time machine before it leaves. \n \nWhile there are a few branching paths depending on dialogue choices taken, the game's narrative is fairly linear.", "id": 48879, "name": "Toki no Tabibito: Time Stranger"}, {"genres": [15], "summary": "A board game simulation similar to Monopoly, but with railroads. Its name means \"Railroad Baron\". It was only released in Japan, for the Famicom, and has two sequels. \n \nTetsudou-Oh (occasionally with the subtitle \"Famicom Boardgame\") is a competitive railroad tycoon-type game where the goal is to own a lot of railroad stations and make a lot of money while bankrupting the other players. Tetsudou-Oh also borrows elements from the Game of Life board game, specifically the lucky/unlucky event that follows every turn and can completely reverse a player's fortunes. \n \nTetsudou-Oh would be followed by Tetsudou-Oh '96 and Tetsudou-Oh 2, both for the Sony PlayStation. The original game would also see a mobile phone platform remake, named Tetsudou-Oh NEO.", "id": 48880, "name": "Tetsudou-Oh"}, {"genres": [31], "summary": "An adventure game by SunSoft for the Famicom. The game is based on a TV show about a retired governor and his retainers going around solving problems in Edo period Japan. \n \nMito Koumon is a long-running Japanese TV show that follows the elderly Tokugawa Mitsukuni, legendary law-maker and former daimyo of the Mito region, and his two retainers Sasaki Sukesaburō and Atsumi Kakunoshin as they enter towns incognito and solve problems regarding political corruption, crime bosses and other problems plaguing the common folk. Only after solving the problem would Tokugawa reveal his identity. He and his retainers would then move on. \n \nThe game is an adaptation of the TV show, allowing players to assume the role of one of the retainers as they go around investigating the town. Occasionally this involves fights with corrupt officials, evil samurai and gangsters. There's also a female ghost that will drain the player character's life if it comes into contact with them. \n \nThe game is noted for its many instances of speech samples. It also has a considerable amount of text. \n \nPlayers move around towns from a top-down perspective, going left or right as well as up and down. They can fight other characters on the screen (not all of which are hostile) as well as enter houses and stores to talk to NPCs or purchase items from them. The goal is to hunt down clues to ascertain what problems are plaguing the town, then go fix them.", "id": 48881, "name": "Tenka no Goikenban: Mito Koumon"}, {"genres": [12], "summary": "Super Chinese 3 is a Role-Playing game, published by Culture Brain, which was released in Japan in 1991. \n \nFinal Famicom game in the series.", "id": 48840, "name": "Super Chinese 3"}, {"genres": [31], "summary": "A NES adventure game based on the anime of the same name, which is an adaptation of Little Lord Fauntleroy. \n \nShoukoushi Ceddie (sometimes Cedie) is the Japanese title of the 1886 Frances Hodgson Burnett novel Little Lord Fauntleroy, about a down-to-earth kid from New York discovering his heritage as the heir to an Earldom in England, moving to his inherited estate and learning how to become a nobleman. Fuji Television created a 43 episode anime series based on the novel in 1988, and this video game adaptation is based on that TV show. Fuji Television is perhaps best known in western video game circles for being responsible for Doki Doki Panic (the game the American/European Super Mario Bros 2 is based on) as well as airing GameCenter CX (or Retro Game Master). \n \nThe game plays much like a regular Famicom adventure game: The player walks around, talks to people and finds items which are used to solve puzzles. However, rather than selecting destinations from a menu, the player manually walks around the different locales using a top-down perspective. There are also action sequences where the player must avoid random pedestrians when leaving the estate. If he collides with an NPC, or goes into the wrong door, he is chided by his tutor and forced to answer trivia questions.", "id": 48843, "name": "Shoukoushi Cedie"}, {"genres": [14], "summary": "The third game in TOSE/Jaleco's NES Baseball series and the sixth Moero game overall. Though most of the Moero!! Pro Yakyuu games were released in the US as Bases Loaded, this one was not. \n \nShin Moero!! Pro Yakyuu (New Burning!! Pro Baseball) is the sixth of Jaleco/TOSE's Moero!! series of sports games (it's occasionally referred to as Moero 6!! Shin Moero!! Pro Yakyuu) and the third in the series to be associated with baseball. The first two Moero!! Pro Yakyuu games saw localizations in the US as Bases Loaded and Bases Loaded 2, but Shin Moero!! Pro Yakyuu was skipped. What eventually became Bases Loaded 3 was instead the fourth Moero!! Pro Yakyuu game, Moero 8!! Pro Yakyuu '90 Kandouhen. \n \nThe biggest difference between the previous Moero!! Pro Yakyuu/Bases Loaded games and this one is the slanted perspective for batting and pitching. Instead of the camera being behind the batter or pitcher, the player can see both from an angle, with the two situated diagonally from each other. Likewise, the baseball diamond is shown at an angle making it appear more like a square, with the rest of the field stretching outwards. Despite this new perspective, the game controls similarly to previous Bases Loaded games. \n \nA curious addition is that of the biorhythms, which tells the player how each athlete is feeling: If the athlete is having an off-game, one or more of these biorhythms will be low and the player will need to strategize around these dips. Though big in 70s sports punditry, the idea of mathematical biorhythms predicting an athlete's prowess in any upcoming game was all but discredited as pseudoscience by the time when this game came out.", "id": 48847, "name": "Shin Moero!! Pro Yakyuu"}, {"genres": [31], "summary": "An adventure game for the NES published by Sunsoft. It is based on a Japanese manga set during a historical Chinese civil war. \n \nSekiryuou (often translated as \"Red Dragon King\") is a traditional Famicom adventure game from Sunsoft, in which the player controls a protagonist via a series of menus in order to solve a series of puzzles. Though Sunsoft is credited as publisher, it is unclear if the game was made in-house or contracted to another developer. \n \nThe game, and the manga it is based on, depict a period of ancient Chinese history between the Qin and Han dynasties, a few decades before the Three Kingdoms era began. As expected of a transitional period, there was plenty of intrigue and conflict leading up to the change of power that future novels and mangas could draw from.", "id": 48850, "name": "Sekiryuou"}, {"genres": [15], "summary": "Seiryaku Simulation: Inbou no Wakusei: Shancara is a Strategy game, published by IGS (Japan), which was released in Japan in 1992.", "id": 48851, "name": "Seiryaku Simulation: Inbou no Wakusei: Shancara"}, {"genres": [7, 8], "summary": "KiraKira Star Night DX follows Fami-chan. She’s a young woman jumping around environments, attempting to catch stars while chiptunes play in the background. The goal is to get a certain number of stars before time runs out. There are nine stages total, and the game features music from Takeaki Kunimoto, Yuriko Keino, Yuzo Koshiro, Nobuyuki Koshiro, Tappy, Manami Matsumae, Hally, Bun, Robokabuto, Yasuhisa Watanabe, and Takeshi Yokemura.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xzdfggiots9hd6va7q4h.jpg", "width": 2156, "cloudinary_id": "xzdfggiots9hd6va7q4h", "height": 1336}, "id": 48932, "name": "KiraKira Star Night DX"}, {"genres": [31], "summary": "A NEW CARTRIDGE BASED GAME FOR THE ORIGINAL NINTENDO ENTERTAINMENT SYSTEM \n \nIn this open journey through a unique fantasy world, the young vagabond musician Julian strives to avenge his mentor and undo the deceptive actions of the rogue sorceress Amriya. Solve complex puzzles. Explore a mysterious mythology full of foreign races and monsters. Navigate through perilous platforming. Gain a wide array of magical abilities. Learn the song of the world. Become the hero by restoring control of the supernatural elements to the Mystics before the imbalance leads to the catastrophic end of the natural world!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uego29jyyejnfsr3ve86.jpg", "width": 1106, "cloudinary_id": "uego29jyyejnfsr3ve86", "height": 1500}, "id": 48938, "name": "Mystic Searches"}, {"genres": [14], "id": 48868, "name": "Kinnikuman Muscle Tag Match"}, {"genres": [14], "summary": "The game itself is interesting, with ten teams to choose from, and multiple game modes including an actual tournament or penalty kick practicing. \n \nFor the PK Battle modes, each player must select a different team. He must then scan a player card (not a team card), and then that player will have a chance to kick a penalty kick (if it is his turn). For all other modes, the player must scan a team card and that will be the team that he will play as for the game(s). The main mode of play is the J.LEAGUE mode, of course. It is set up in a season/tournament setting, with 18 games per team. There are ten teams total in this version of J.League, and they are randomly sorted to play against a different team each day. The games are split into two periods with three minutes (3:00) apiece. Prior to starting a game, the player can choose the formation of his eleven active players, from one of three layouts that he can see on the small screen (4-4-2, 4-3-3, or 3-5-2).", "id": 48519, "name": "J. League Super Top Players"}, {"genres": [31], "summary": "Kaguya Hime Densetsu is an Adventure game, developed by Micronics and published by Victor Interactive Software, which was released in Japan in 1988.", "id": 48447, "name": "Kaguya Hime Densetsu"}, {"genres": [12], "summary": "Around the year 2000, mankind departs a depleted earth and travels through space to the plant Ibaru some 8,500 light years away. There, people live peacefully under the protection of a god whose power source is the Light of Indora. However, a demon siphons the light away from the planet and the god begins to slumber. The surface of the planet transforms into a vast desert and monsters begin to appear. The player must quest to put an end to the demon and restore the Light of Indora to the god that protects the planet.", "id": 48461, "name": "Indora no Hikari"}, {"genres": [31], "summary": "TM Network: Live in Power Bowl (TMネットワーク ライブ イン パワーボウル?)[2] is a Japanese-only Nintendo Family Computer game featuring the J-Pop group TM Network. The song used as the background music is \"Come On Everybody\" from their album Carol -A Day In a Girl's Life 1991- (using the 8-bit sound chip of the Family Computer). Interestingly, the game uses Atlus NES sound engine by Tsukasa Masuko.", "id": 48435, "name": "TM Network: Live in Power Bowl"}, {"genres": [12], "summary": "SWAT: Special Weapons and Tactics is a role-playing game developed by Shouei and published by Toei Animation. This game was only ever released in Japan for the Famicom and was never translated from the original Japanese language. \n \nThe player takes control of a five member team of special anti-terrorist agents as they break into a building where a hostage situation is taking place. Their goal is to take out the villains and free the hostages. Battles with gunmen take place in a traditional RPG style turn-based battle. Players enter the commands for each surviving member of the team, including what weapon to attack with, and which target to attack. When not in battle, the player views the building in a traditional 3D dungeon perspective, moving through the hallways, choosing which rooms to investigate, which traps to disarm, and how to proceed to the end of the game within a given time limit.", "id": 48392, "name": "SWAT: Special Weapons and Tactics"}, {"genres": [12], "summary": "Ninjara Hoi! is a Role-Playing game, developed and published by ASCII Entertainment, which was released in Japan in 1990.", "id": 48407, "name": "Ninjara Hoi!"}, {"genres": [31], "summary": "An adventure game created by Yuji Horii and published by Enix in 1983. Revolving around a murder mystery, the game set the template for the visual novel genre. \n \nPortopia Renzoku Satsujin Jiken (The Portopia Serial Murder Case), is an adventure game created by Yuji Horii and published by Enix (now Square Enix). First conceived in 1981, it was released on the NEC PC-6001 in June 1983, and later ported to other personal computers. Chunsoft ported the game to the Nintendo Entertainment System (NES) on November 29, 1985, and to different mobile phone services starting in 2001. \n \nThe game is an investigation adventure, sophisticated for its time, in which the player must resolve a murder mystery by searching for clues, exploring different areas, interacting with characters, and solving item-based puzzles. The game, especially its NES version, was received positively in Japan, where it was an influential title that defined the visual novel genre, in addition to paving the way for the seminal Dragon Quest series of console role-playing games as well as inspiring new game designers such as Hideo Kojima. \n \nIt is the first entry in the Yuji Horii Mysteries trilogy. It was followed by Hokkaidou Rensa Satsujin: Ohotsuku ni Kiyu!! in 1984 and Karuizawa Yuukai Annai in 1985. \n \nStory: \nKouzou Yamakawa, the president of the Loan and Savings Company, was found dead inside his mansion. A detective and his assistant arrive at the scene for further investigation. The player must resolve the mystery of a murder by searching for clues, interacting with characters, and solving item-based puzzles.", "id": 48358, "name": "The Portopia Serial Murder Case"}, {"genres": [8, 31], "summary": "Jet Paco is a remake of Paco Jet featuring identical gameplay to the 2013 release, now accompanied by 8-bit visuals and a punchy chiptune soundtrack. Taking control of Paco Rebollez, you're tasked with finding and gathering energonia crystals, a rare and unusual material used to energise spacecrafts. To help with his journey, Paco is equipped with a state of the art jet pack which allows our homebrew hero to glide around the many rooms of an abandonded ship containing gems galore.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uiyuirdm5ps6zoxqk8w6.jpg", "width": 1116, "cloudinary_id": "uiyuirdm5ps6zoxqk8w6", "height": 1528}, "id": 48375, "name": "Jet Paco"}, {"genres": [9], "summary": "De-Block is a Puzzle game, published by Athena, which was released in Japan in 1991.", "id": 48515, "name": "De-Block"}, {"genres": [5], "summary": "The Dimensional Stone, which is required to maintain balance in the world of starship pilot Mark was stolen. The king finds a hero to retrieve the stone; using the \"Fuzzical Fighter\" to transport the player's character into enemy territory. \n \nTowns are visited in-between stages to provide the player with weapons and artificats that are bought with the in-game gold currency. Players can choose to backtrack to either to previous stage while staying at the inn or to a stage that he has not yet explored. They also have access to three different kinds of healing spells: Riken (minor healing), Rikento (normal healing) and Rikentaru (major healing). \n \nDespite being a mechanical object and not a creature, the Fuzzical Fighter has magic points that can be replenished while in the towns. The Fuzzy Fighter itself resembles a spaceship with a mechanical tail at the end.", "id": 48489, "name": "Fuzzical Fighter"}, {"genres": [12], "summary": "Kaijū Monogatari (貝獣物語?) is a role-playing video game developed by Birthday and published by Namco for Famicom, in November 1988 in Japan.", "id": 48446, "name": "Kaijuu Monogatari"}, {"summary": "Hana no Star Kaidou (which can be loosely translated as \"Blossoming Star Highway\") is an action game for the Famicom that was developed and published by Victor Musical Industries in 1987. It is about two musicians who dream of obtaining a recording contract and becoming big stars. The player must control both Moero and Goro on the screen at one time. They run, jump, and attack simultaneously. Each one has their own life count, and the game is over as soon as one of them loses all of their lives. Because of the unituitive controls, and unforgiving game mechanics, this game is considered quite difficult and generally not fun to play.", "id": 48476, "name": "Hana no Star Kaidou"}, {"genres": [14], "summary": "Moero!! Judo Warriors (燃えろ!!柔道WARRIORS?) is a Family Computer video game that was released in 1990. \n \nThe box art shows competitors in an international judo tournament; flags of different countries like the Soviet Union, France, Brazil, the United States of America, and Japan are used to signify the eliteness of the virtual competition. Players must travel around the world in search of judo opponents. The player even gets to compete in the Summer Olympic Games under his discipline of judo after defeating five opponents. However, this would most like refer to either the 1992 Summer Olympic games in Barcelona, Spain because of the game release date. Nine opponents must be defeated in the Olympic Games in order to collect the gold medal. Losing some matches while winning other may result in the awarding of either the silver or the bronze medal.", "id": 48422, "name": "Moero!! Judo Warriors"}, {"genres": [12], "summary": "Mirai Shinwa Jarvas (未来神話ジャーヴァス? lit. Future Legend Jarvas) is a RPG developed and published by Taito. It is about a man named Jarvas who travels back in time from the future to conquer the world of the past and become the leader. You must get people to join your side and take over enemy castles. \n \nThis game is generally considered pretty bad by most. When you begin the game, you are given no information about where you are and where you should attempt to go. Once you find a town, you must join a guild. You can only increase your level by returning to the guild once you have accumulated enough experience.", "id": 48425, "name": "Mirai Shinwa Jarvas"}, {"genres": [31], "summary": "Marusa no Onna is an Adventure game, developed and published by Capcom, which was released in Japan in 1989.", "id": 48430, "name": "Marusa no Onna"}, {"summary": "Magnum Kiki Ippatsu: Empire City 1931 is an Action game, developed by Seibu Kaihatsu and published by Toshiba EMI, which was released in Japan in 1987.", "id": 48431, "name": "Magnum Kiki Ippatsu: Empire City 1931"}, {"genres": [12], "summary": "Nakayoshi to Issho is an Adventure game, published by Yutaka, which was released in Japan in 1993.", "id": 48415, "name": "Nakayoshi to Issho"}, {"summary": "Tetsuwan Atom (鉄腕アトム?) is an action game developed by Home Data and published by Konami for the Famicom in Japan early on in 1988. The game stars Tetsuwan Atom, a popular early anime character who is better known as Astro Boy outside of Japan. Tetsuwan Atom was originally created in 1951 by Osamu Tezuka. The successful series started as a comic strip and was turned into a black and white animated series in 1963. It was one of the first (if not the first) animated TV series produced in Japan, and has influenced countless Japanese animated series that followed. The little robot-boy is one of Japan's most recognizable character. The story takes place in the future, at a time where humans and robots live together in harmony. The powerful robot-boy Atom lives with Professor Ochanomizu, an old scientist who takes good care of the little robot, and helps him fight crime and injustice. One day, burglars break into Professor Ochanomizu's lab and steal all of his money. It is now Atom's duty to recover the stolen loot.", "id": 48386, "name": "Tetsuwan Atom"}, {"genres": [31], "summary": "Sanma no Meitantei (さんまの名探偵 Sanma no Meitantei?, lit. \"Great Detective Sanma\") is a murder mystery detective adventure game developed and published by Namco for the Famicom in 1987. In the vein of Portopia Renzoku Satsujin Jiken, the player must visit several locations associated with the murder victim, to discover clues which will open up more locations in order to find more clues until ultimately, the identity of the murderer can be confirmed. The game is played entirely in Japanese and was never translated into English. The summary of the story is that while the president Yoshimoto held a party at his villa, Katsura Buntin was found to have been killed in the vault. On top of that, the \"Star of Africa\" diamond that was stolen from the vault. As detective Sanma Akashiya's assistant, you must help him determine the perpetrators of the incident. The game features a mini game which is a parody of Galaxian, and contains sound effects from other Namco hits such as Dig Dug and Xevious", "id": 48402, "name": "Sanma no Meitantei"}, {"summary": "Route-16 Turbo is an updated version of an older arcade game entitled Route 16, developed jointly by Tehkan (later Tecmo) and Sunsoft (in a manner similar to the way Namco's Warpman is an updated version of Warp & Warp.) Route-16 Turbo takes the concept established in Route 16, and updates the quality of the graphics, but keeps the goal of the game the same. The game play is a near perfect combination of Rally-X and Venture. The player drives a car through several zoomed in blocks collecting bags of money and other items, and travels between blocks along a zoomed out view of the world.", "id": 48404, "name": "Route-16 Turbo"}, {"genres": [4], "summary": "One day at school, Kunio was minding his own business when suddenly, he found a note on his locker. The note says their is a fighting tournament hosted by the \"Double Tiger\" twins. Seeing it as a challenge he could not refuse, Kunio runs off to participate. When Riki sees Kunio running and read his note, he decides to enter as well. Many other fighters will join in to see who is the strongest.", "id": 48410, "name": "Nekketsu Kakutou Densetsu"}, {"genres": [14], "summary": "Famista '89: Kaimaku Han!! is a Sports game, developed and published by Namco, which was released in Japan in 1989.", "id": 48495, "name": "Famista '89 Kaimaku Ban!!"}, {"genres": [8], "summary": "Esper Boukentai is a platform action game developed by Jaleco for the Famicom and published in 1987. It is an exploration game which uses Jaleco's arcade game Psychic 5 as the basis for the story and the cast of characters which you use throughout the game. Each character possesses different attributes, including their jumping ability, their ability to hover in mid-air, and their strength. As in the arcade, some characters must be rescued in order to make them playable. This game boasts over 50 household items which serve as animated enemies throughout each level.", "id": 48506, "name": "Esper Boukentai"}, {"genres": [8], "summary": "When the Gumon Family takes over McDonaldland and captures Ronald's friends including Grimace, Birdie, the Fry Guys, and others, it's up to the jolly clown himself to put an end to their vile machinations and eat hamburgers across numerous locales leading up to the final castle headquarters of the Gumon Family.", "id": 48524, "name": "Donald Land"}, {"genres": [4], "summary": "Fighting Road is an Action game, developed and published by Toei Animation, which was released in Japan in 1988.", "id": 48494, "name": "Fighting Road"}, {"genres": [14], "summary": "Exciting Boxing is a Sports game, developed by Human Entertainment and published by Konami, which was released in Japan in 1987.", "id": 48504, "name": "Exciting Boxing"}, {"genres": [12], "summary": "Hokuto no Ken 4: Shichisei Hakenden: Hokuto Shinken no Kanata e is a Role-Playing game, developed by Shouei and published by Toei Animation, which was released in Japan in 1991.", "id": 48470, "name": "Hokuto no Ken 4: Shichisei Hakenden: Hokuto Shinken no Kanata e"}, {"genres": [12], "summary": "Juvei Quest is a Role-Playing game, developed by Birthday and published by Namco, which was released in Japan in 1991.", "id": 48449, "name": "Juvei Quest"}, {"genres": [14], "summary": "J.League Fighting Soccer: The King of Ace Strikers is a Sports game, developed by Graphic Research and published by IGS (Japan), which was released in Japan in 1993.", "id": 48460, "name": "J-League Fighting Soccer: The King of Ace Strikers"}, {"summary": "Mottomo Abunai Deka is an Action game, developed by Micronics and published by Toei Animation, which was released in Japan in 1990.", "id": 48419, "name": "Mottomo Abunai Deka"}, {"genres": [31], "summary": "Mindseeker is an Adventure game, developed and published by Namco, which was released in Japan in 1989.", "id": 48427, "name": "Mindseeker"}, {"genres": [8], "summary": "Jenny’s on her way to the theater to practice for an upcoming role. Her script gets stolen though and has to track the pages down in different stages which are entered through the hub world. Once you collect a key and memorize letters and numbers, you go to the theater and use them to unlock the combination lock. Jenny has 2 abilities: punching and kicking, and after picking up powerups, throwing stars and bug spray", "id": 48434, "name": "Lost Word of JeNnY: Ushinawareta Message"}, {"genres": [12], "summary": "The humans who breathed the toxin-filled air on the Earth's surface became one with the Earth and kept dissolving. The history of humanity ended and dominion of the planet returned to the demons. These mutant creatures did not depend on oxygen to survive. Therefore, they were able to breathe the air and use the land.Meanwhile, an army of robots wage World War IV against the demons in order to conquer what is now known as Makai - the Demon World. These robots came to the planet on a wave of energy that created an explosion that turned the world into a wasteland. Much later in the game, concurrent themes including Adolf Hitler, war, creating a perfect race of people, and the destruction of humanity in the year 1999 are revealed to the player inside one of the robot's main bases. \n \nCan the demons gain dominion on the humans' old planet or will robots enforce impose a millennium of logic and dictatorial force throughout Makai? Playing as the robots is not an option that is open to the player. Therefore, the player must take advantage of his or her mutant army and crush the robot invaders. This game builds on the fear of robot domination of the world that has been featured greatly in movies from The Terminator to Terminator Salvation. The gameplay is similar to Final Fantasy as the turn-based fights are viewed from a third-person perspective.", "id": 48436, "name": "Last Armageddon"}, {"summary": "Players must play the role of a mother cat called Milky who lives in a dangerous metropolis full of dogs. The dogs want to kill Milky before she can rescue her son Michael who wandered out into the city on his own (and became lost). Players must catch the fish for temporary invincibility. However, the other enemies can still kill the mother cat like the fish merchant (who is the only humanoid bad guy in the game), the automobiles on the road, along with the manholes and the pylons. The city is divided into roads for automobile traffic and sidewalks for roaming pedestrian dogs in overalls. The fish merchants completely replace the dogs after the 30th level; causing the invincibility icon (fish) to become redundant. \n \nUnlike the Teenage Mutant Ninja Turtles series of video games (especially the first NES release which would come out four years later in 1989), open manholes kill the player instead of helping her evade the roaming dogs. Sewer snakes also come out to kill the player with its poisonous venom. Triangle cones can momentarily block progress for the player. The game was targeted to a much younger audience than was considered to be \"average\" in the Nintendo Entertainment System community during that era. Using the classical music song Ballet des poussins dans leurs coques (composed by Modest Mussorgsky) as the background music, there is a common theme throughout the game of \"dog catches cat; cat catches fish\" - emulating the food chain.", "id": 48405, "name": "Onyanko Town"}, {"genres": [15], "summary": "Navy Blue is a Strategy game, developed by Use and published by I'Max, which was released in Japan in 1992.", "id": 48411, "name": "Navy Blue"}, {"genres": [10], "summary": "Family Circuit is a Racing game, developed by Game Studio and published by Namco, which was released in Japan in 1988.", "id": 48498, "name": "Family Circuit"}, {"genres": [12], "summary": "Double Moon Densetsu (ダブルムーン伝説?) is a 1992 role-playing video game for the Family Computer published by Masaya. It is based on an earlier play-by-mail RPG also titled Double Moon Densetsu, serialized in Marukatsu Famicom and eventually Marukatsu Super Famicom; in addition to this computer game, there was also a tabletop RPG system produced based on the work. \n \nA deity named Fatima created a world with two different continents; that divided the world of sorcery from the world of swordsmanship. An evil demon plans to destroy this world by bringing forth a dark dragon from a demonic dimension.", "id": 48522, "name": "Double Moon Densetsu"}, {"genres": [14], "summary": "Golf Club: Birdie Rush is a golf game developed by Data East and published for the Famicom towards the end of 1987. It employs a far off bird's eye view throughout the game. It features 18 holes and allows players to play in a stroke game, or a tournament, and allows players to play alone, or head to head. It was only released in Japan, and it was followed up with a sequel for the Super Famicom called Super Birdie Rush in 1992.", "id": 48482, "name": "Golf Club: Birdie Rush"}, {"genres": [12], "summary": "Kagerou Densetsu is a Role-Playing game, developed by ITL and published by Pixel Multimedia, which was released in Japan in 1990.", "id": 48448, "name": "Kagerou Densetsu"}, {"genres": [14], "summary": "Super Real Baseball '88 (スーパーリアル ベースボール '88?) is a baseball game developed by Pax Softonica for the Famicom and published in Japan by Vap in 1988. After Namco excited the market for baseball games with the release of Pro Yakyuu Family Stadium, many other companies attempted to meet the demand for more baseball games. \n \nThis title differentiated itself from other baseball games by obtaining permission from the Professional Baseball Organization of Japan to use the official names of the 12 Japanese baseball teams and their players. This was a groundbreaking feature at the time. It was also the first game to depict an existing stadium with it's actual name, the Tokyo Dome, which had just opened shortly before the game's release. Outfielder and first baseman Warren Cromartie, formerly with the Montreal Expos, and playing for the Yomiuri Giants at the time, was chosen to help promote the game. \n \nTo further distinguish the game, the developers chose to use a more realistic approach when depicting the players on the field, as opposed to the more cartoonish look utilized by Pro Yakyuu Family Stadium and many other baseball games. Additionally, the view remains fairly close to the ball after the batter hits the ball, as opposed to zooming out to a bird's eye view of the field. Despite these changes, and efforts to promote the game, it was considered very difficult to play, as it employed rather complex controls for batting, pitching, and fielding that were not easy for many players to perform.", "id": 48395, "name": "Super Real Baseball '88"}, {"genres": [12], "summary": "Esper Dream 2: Aratanaru Tatakai is a Role-Playing game, developed and published by Konami, which was released in Japan in 1992.", "id": 48505, "name": "Esper Dream 2: Aratanaru Tatakai"}, {"genres": [12], "summary": "Centuries ago, Dragons and Demons roamed the country and brought terror into the lives of all people. However, a local legend states that the Sword of Thruth can restore peace to the land. It turns out that the almighty weapon is kept by the most ferocious dragon who ever lived but this doesn't stop the young Carl from willing to take on the challenge. He is small but the best archer the land has ever seen!", "id": 48521, "name": "Dragon Buster II: Yami no Fuuin"}, {"summary": "Higemaru Makaijima (魔界島 七つの島大冒険 Makaijima Nanatsu no Shima Daibōken?, lit. Hell Island: Great Adventure of 7 Islands) is an action-adventure game developed for the Famicom and MSX home computer, and released by Capcom in 1987. It is a sequel to a 1984 arcade game developed by Capcom known as Pirate Ship Higemaru. Neither the arcade game, nor this adventure adaptation were released outside Japan, although a prototype exists for a canceled North American NES release, where it was to be renamed \"Makai Island\". \n \nIn Higemaru Makaijima, the hero from Pirate Ship Higemaru named Momotaru must now pilot his own sailing vessel around the ocean surrounding seven islands. His goal is to find the greatest treasure. To do this, he must collect the keys which open the dock gates to each of the islands by invading several pirate ships and defeating the captain on board in combat. The gameplay on these pirate ships are taken directly from the arcade predecessor, with some small modifications. \n \nOnce Momotaru has collected a key from a pirate ship, he must then sail around the islands in search of the correct dock gate which the key corresponds to. Once there, the player embarks on an exploration of the island to find items, defeat a boss, and collect treasures before heading off in search of another island key. The island exploration sections are extremely reminiscent of dungeon exploration aspects of The Legend of Zelda, to which the game is often compared to.", "id": 48473, "name": "Higemaru Makaijima: Nanatsu no Shima Daibouken"}, {"genres": [12], "summary": "Heracles no Eikou: Toujin Makyouden is a Role-Playing game, published by Data East, which was released in Japan in 1987.", "id": 48475, "name": "Heracles no Eikou: Toujin Makyouden"}, {"summary": "Saiyuuki World is an Action game, developed by NMK and published by Jaleco Entertainment, which was released in Japan in 1988.", "id": 48403, "name": "Saiyuuki World"}, {"genres": [31], "summary": "Oishinbo: Kyukyoku no Menu 3bon Syoubu is an Adventure game, developed by TOSE and published by Bandai Shinsei, which was released in Japan in 1989.", "id": 48406, "name": "Oishinbo: Kyukyoku no Menu 3bon Syoubu"}, {"genres": [12], "summary": "Monster Maker: 7-tsu no Hihou is a Role-Playing game, developed and published by Sofel, which was released in Japan in 1991.", "id": 48420, "name": "Monster Maker: 7-tsu no Hihou"}, {"genres": [31], "summary": "Famicom Doubutsu Seitai Zukan! Katte ni Shirokuma: Mori o Sukue no Maki! is an Adventure game, published by CBS Sony Group, which was released in Japan in 1989.", "id": 48501, "name": "Famicom Doubutsu Seitai Zukan! Katte ni Shirokuma: Mori o Sukue no Maki!"}, {"genres": [31], "summary": "Erika to Satoru no Yume Bōken (えりかとさとるの夢冒険? lit. \"Erika and Satoru's Dream Adventure\") is a 1988 Japan-exclusive adventure video game for the Famicom. It is a fairytale-inspired menu-driven adventure game. Players use the menu commands to interact with the world: moving around, looking around, picking up objects, talking to people, etc. The setting of this game is 20th century Japan. \n \nIn a novel twist, the two characters of Erika and Satoru (who are depicted as twin schoolchildren) are independently playable - either a single player switches between the two, or a second player takes over the second twin. Both characters need to be in the same region to converse with NPCs, but are otherwise free to explore the map autonomously. Two-player adventure games are very rare; even in Japan. However, only one person can partake in the animal quiz portion. Failing the quiz will force the player(s) to start from the beginning. \n \nAn odd bit of infamy related to this game is a secret developer's message that can be found if the player inputs a list of button presses after waiting some time after the game ends. Inside of which is a litany of compliments and complaints to other co-workers, including some sexual insults which are deeply at odds with the child-friendly nature of the game. It also refers to, among other things, the work Atlus did for LJN including The Karate Kid.", "id": 48508, "name": "Erika to Satoru no Yume Bōken"}, {"genres": [12], "summary": "Elysion, though a fairly traditional 8-bit JRPG in many respects (the first thing the player does is talk to the local King for exposition, for example), draws its influences from a lot of very different games within the RPG family: It superficially resembles the first Dragon Quest, it allows the player to select between multiple protagonists when starting the game as is the case in Final Fantasy, the combat system is real-time combat without screen transitions such as something like Hydlide or Ys and the enemies have an odd habit of only moving when the player does, such is the case in many strategic Roguelike dungeon crawlers like the Mystery Dungeon series. \n \nThe goal of the game is to defeat the evil demon Baal. However, the King first tests the player character by having them enter the dungeon beneath the castle and find a group of important quest objects. After completing this large dungeon, the protagonist officially becomes the Hero of God and can go defeat Baal by exploring the rest of the continent for some necessary magical scrolls and, eventually, special God-like equipment. \n \n\"Elysion\" refers to the Elysian Fields, an ancient Roman underworld for honorable souls that died in battle.", "id": 48509, "name": "Elysion"}, {"summary": "Zunou Senkan Galg (\"Brain Battleship Galg\"), referred to as just Galg by the game's title screen, is a vertical-scrolling shoot-em-up in which the player must navigate a serious of canyon-like environments for missing pieces to a war machine. Each stage has at least one piece, so the player must visit them all in order to find the necessary number. In addition to this, there are numerous secrets hidden throughout the many stages of the game, and the player frequently has to choose between multiple paths which lead to different stages. The game advertises itself as a \"RPG\" on its box art, referring to this additional layer of complexity. \n \nLike The Tower of Druaga, it is considered a historically important game in Japan for the amount of secrets and mysteries it contains and the subsequent difficulty involved in reaching the end without this hidden knowledge. Therefore, it was one of the earliest games for the Famicom to feature its own printed game guide for players to follow. Zunou Senkan Galg is almost entirely unheard of outside of Japan, however, and has never seen a release outside of its native country. \n \nThough it was published by dB-Soft, the game was developed by a group named \"Team Bioteckers\". Galg is their only known video game credit.", "id": 48488, "name": "Zunou Senkan Galg"}, {"genres": [9], "summary": "Moai Kun (モアイくん Mr. Moai?) is a puzzle video game developed and published by Konami for the Family Computer in Japan in March 1990. The game derives its themes from Easter Island; the player controls a sentient moai statue that must rescue other moai and escape each stage via a door before the timer expires. Although platforming elements are present, the primary challenge is to find a way to manipulate the objects in each stage to reach the distressed moai and rescue them while still leaving an avenue of escape to the exit door.", "id": 48424, "name": "Moai Kun"}, {"genres": [4], "summary": "Musashi no Ken - Tadaima Shugyō Chū (六三四の剣 ただいま修行中 lit. \"Sword of Musashi - Now in the Middle of Training\"?) is a 1986 video game software developed and published by Taito exclusively in Japan. It is based on a Japanese sports manga series written and illustrated by Motoka Murakami that focuses on kendo, simply titled Musashi no Ken. The gameplay and design in the one-on-one fighting parts resemble Taito's other fighting game, Great Swordsman, especially its kendo mode. \n \nThe game's plot is about the son of two Kendo champions named Musashi. He strives to become as great at Kendo as his parents. The entire story centers around the world of Kendo and its up and coming competitors. The anime is broken up in to two parts. The first part follows Musashi's early years in grade school while the second part follows his high school years. In the first episode, Musashi befriends an Akita puppy who is by his side throughout the series.", "id": 48417, "name": "Musashi no Ken: Tadaima Shugyou Chuu"}, {"genres": [12], "summary": "Famicom Jump: Hero Retsuden (ファミコンジャンプ 英雄列伝 Famikon Janpu Hīrō Retsuden?, the subtitle translates to \"History of Heroes\") is a 1989 role-playing video game for the Family Computer published by Bandai. The game commemorates the 20th anniversary of Shueisha's manga anthology Weekly Shōnen Jump. \n \nSet in a world that brings together many of the long-running titles that had appeared in the magazine, both of the past and present at the time of its release. The game consists of a main character wandering and encountering the many Jump heroes as they try to save the world from an alliance of many of the most powerful and evil of the Jump villains.", "id": 48500, "name": "Famicom Jump: Hero Retsuden"}, {"summary": "Photon: The Ultimate Game on Planet Earth is the English title for the Japanese game known as Hikari no Senshi Foton (光の戦士　フォトン 惑星ゾルディアスの戦い Hikari no Senshi Foton Wakusei Zoldias no Tatakai?, lit. Light Warrior Photon Planet Zoldias Battle). It is an adventure game developed for the Famicom by Takara, and published in 1987. The English name of the game has special significance, since \"Photon: The Ultimate Game on Planet Earth\" is also the name of the first commercial version of a game commonly known today as Laser Tag. However, besides the name, and the fact that you play a character who fires a Photon gun, any further connection between the live action game and this video game is unknown. \n \nIn the video game, you play a soldier who must navigate through several different floors of a dungeon which contains items and traps. The player must figure out how to maneuver through the dungeon in an effort to collect various items that will expand his ability to search, and find various disks which contain hints and messages to further aid the player. The game is played from a third-person behind-the-shoulder perspective and contains pseudo-3D visuals. This game was never released outside of Japan.", "id": 48491, "name": "Hikari no Senshi Photon: The Ultimate Game on Planet Earth"}, {"summary": "Although commonly referred to as Tokaido Gojuusan Tsugi, the full name of the game is Kanshakudama Nage Kantarou no Toukaidou Gojuusan Tsugi, which can be roughly translated as \"explosive throwing Kantarou and the 53 stations of the Tokaido\". To further explain, the main character's name is Kantarou, and he throws bombs at his enemies. He is attempting to travel from Kyoto back to Edo (known today as Tokyo) to see his girlfriend Momoko. To get there, he is traveling through the Tokaido highway which is composed of 53 checkpoints along the way. However, an unscrupulous merchant is attempting to capture Kantarou and steal his explosive technique secrets. \n \nTokaido Gojuusan Tsugi is a horizontally scrolling action game developed by Sunsoft in 1986. It was never released outside of Japan. On June 29, 2001, the game was released for the Windows platform as part of Sunsoft Classic Games 2 along with Ikki (which was itself rereleased as a budget title in 2004). On December 27, 2001, the game was released on the PlayStation as part of Memorial Series: Sunsoft Vol. 3 along with The Wing of Madoola.", "id": 48443, "name": "Kanshakudama Nage Kantarou no Toukaidou Gojuusan Tsugi"}, {"genres": [8], "summary": "Nagagutsu o Haita Neko: Sekai Isshū 80 Nichi Dai Bōken (長靴をはいた猫 世界一周80日大冒険?, lit. \"Puss in Boots: An Adventure Around the World in 80 Days\")[3] is a 1986 video game based on the third film of The Wonderful World of Puss 'n Boots that was released exclusively in Japan for the Family Computer. Four years later, the game (with several modifications) was released in North America under the title Puss 'n Boots: Pero's Great Adventure. \n \nThe main character is the Puss in Boots character from the tale; a cat named Pero (Toei Animation's mascot) He is also known as 'Perrault' in the game, as that was the name of the original author of the Puss In Boots story; Charles Perrault. He is known for helping an impoverished master attain wealth through the use of trickery.", "id": 48416, "name": "Nagagutsu o Haita Neko: Sekai Isshuu 80 Nichi Dai Bouken"}, {"summary": "Seikima II Akuma no Gyakushū! (聖飢魔II 悪魔の逆襲！?, lit. \"Seikima II The Wrath of Satan!\") is a video game that was released in Japan in 1986. \n \nThe game is based on a then-popular Japanese heavy metal band formed by Damian Hamada called Seikima-II. This band lasted from its creation in 1982 to its dissolution on December 31, 1999. Their history, as it has been prophesized, is that they are a group of demons preaching a religion in order to propagate Satan through the use of Heavy Metal. Each member is a demon of a different hierarchical class with His Excellency Demon Kogure being leader of demons and His Majesty Damian Hamada being crown prince of hell. In accordance to the prophecy and after completing the world conquest, the band would disband at the end of the century on December 12, 1999 at 23:59:59 Japan Standard Time (09:59:99 Eastern Standard Time).", "id": 48399, "name": "Seikima II: Akuma no Gyakushuu"}, {"genres": [15], "summary": "Solar Wars is a tank combat game like Scorched Earth on the PC, Scorched Tanks on the Amiga, or Gorillas from QBasic. The game is two-player and pits you against a foe throughout our solar system. You can fight against a friend using two controllers, or the same controller, on ten different worlds, each with its own gravity, atmosphere, and climate.", "id": 48373, "name": "Solar Wars"}, {"genres": [31], "summary": "Kujaku Ou II is an Adventure game, developed by Atelier Double and published by Pony Canyon, which was released in Japan in 1990.", "id": 48439, "name": "Kujaku Ou II"}, {"genres": [12], "summary": "Famicom Jump II: Saikyō no Shichinin (ファミコンジャンプII 最強の7人 Famikon Janpu Tsū Saikyō no Shichinin?, lit. \"Famicom Jump II: Strongest Seven\") is a 1991 RPG for the Nintendo Family Computer published by Bandai. The sequel to Famicom Jump: Hero Retsuden, the game features seven main characters (as the subtitle indicates) from different Weekly Shōnen Jump manga serialized at the time. Only four of the 16 represented titles from the original are brought back, while the remaining three are new to the sequel. There would not be another crossover game until the release of Jump Super Stars and Jump Ultimate Stars. (of which six of these series would be represented, the only one not being Magical Tarurūto-kun.)", "id": 48499, "name": "Famicom Jump II: Saikyō no Shichinin"}, {"summary": "Tonight the whole Chiateng City and its citizens are very high in various recreational activites that are carried in commemoration of its centennial. Just when a crowd of VIPs gathering in the Mayor's residence were raising their glasses to toast Chiateng City, a mysterious stranger broke into the house from the window and quickly flew away with the cauptured Mayor's daughter, Rose. Very quickly several explosions broke out successively on the street and the whole city was soon in fire. \n \nDo you think that these people, now all at their wits' end, could do nothing by wait and be played by the jerk or some miracle would happen and the people were rescued?", "id": 48463, "name": "Thunder Blaster Man"}, {"summary": "Great Battle Cyber is an Action game, developed by Arc System Works and published by Banpresto, which was released in Japan in 1992.", "id": 48479, "name": "Great Battle Cyber"}, {"genres": [8], "summary": "JaJaMaru no Daibouken (じゃじゃ丸の大冒険?, \"JaJaMaru's Great Adventure\") is a Family Computer video game that was released exclusively for a Japanese market in 1986. \n \nThe concept of the game is that the player controls a red ninja as he progress through a series of Japanesque levels defeating evil spirits that have spread across the land. The player can even ride his faithful frog if he can recover it from hiding.", "id": 48457, "name": "JaJaMaru no Daibouken"}, {"genres": [12], "summary": "Kouryu Densetsu Villgust Gaiden is a Role-Playing game, developed by TOSE and published by Angel (Bandai), which was released in Japan in 1993.", "id": 48438, "name": "Kouryu Densetsu Villgust Gaiden"}, {"genres": [31], "summary": "Sherlock Holmes: Hakushaku Reijou Yuukai Jiken (loosely translated as Sherlock Homes: Kidnapping of the Young Countess) is an adventure game developed for the Famicom by Towachiki, and released in 1986. The game puts the player in the role of Sherlock Holmes, who must travel throughout England (by train) while trying to solve the mystery of a kidnapping. In this unusual portrayal of Holmes, his only means of interrogating anyone to obtain information is by attacking them with jump kicks until they run out of stamina and reveal clues. The game alternates between a zoomed out view of England streets, where every bystander can damage Holmes simply by running in to him, to a zoomed in side scrolling view of buildings or sewers or parks. Besides interrogating people for information, or simply beating them up for train fare, Holmes must search seemingly random cracks or trees in order to find important clues, or inventory items.", "id": 48396, "name": "Sherlock Holmes: Hakushaku Reijou Yuukai Jiken"}, {"genres": [5, 33], "name": "Parodius! From Myth to Laughter", "videos": [{"video_id": "sdK0nTT-D5w", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/clsylvwqsx1ygvokbk0g.jpg", "width": 256, "cloudinary_id": "clsylvwqsx1ygvokbk0g", "height": 366}, "summary": "A shoot'em up arcade game and the second title in the Parodius series.", "storyline": "The Great Octopus has threatened Earth. To help Parodius save the planet, you and his friends must begin your search for the truth. As you search the whole world over you must find the enemy and you must destroy him.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/apnccpwl0e0xozo54cqm.jpg", "width": 560, "cloudinary_id": "apnccpwl0e0xozo54cqm", "height": 435}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tuolclvxkc17uulej4ka.jpg", "width": 256, "cloudinary_id": "tuolclvxkc17uulej4ka", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/clyjjt4vct3ukdbydzah.jpg", "width": 512, "cloudinary_id": "clyjjt4vct3ukdbydzah", "height": 384}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qeul7kunrsphbhovgmwd.jpg", "width": 480, "cloudinary_id": "qeul7kunrsphbhovgmwd", "height": 360}], "id": 37307}, {"genres": [14], "summary": "Pachinko Daisakusen 2 is a Miscellaneous game, developed by Color Dreams and published by Coconuts Japan, which was released in Japan in 1992.", "id": 48837, "name": "Pachinko Daisakusen 2"}, {"genres": [31], "summary": "Pachio-kun returns for a fourth outing on the Famicom. \n \nPachio-kun 4 is a Miscellaneous game, developed by Color Dreams and published by Coconuts Japan, which was released in Japan in 1991.", "id": 48834, "name": "Pachiokun 4"}, {"genres": [14], "summary": "Family Mahjong II: Shanghai e no Michi is a Mahjong game released only in Japan for the Nintendo Famicom. \n \nFamily Mahjong II: Shanghai e no Michi is a Mahjong game and the direct sequel to Family Mahjong. In addition to the standard Mahjong mode, there is a tournament mode with a slight RPG aspect to it, in that the player can enhance certain stats after winning games in order to increase their odds in future rounds of the tournament. \n \nThe game is a one-on-one version of the game, less common in real-life Mahjong games but the standard for computer adaptations due to the reduced complexity of having only a single AI opponent. Nihon Bussan was responsible for Family Mahjong II's development and was at the time fairly well known for their Mahjong Arcade games.", "id": 48768, "name": "Family Mahjong II: Shanghai he no Michi"}, {"genres": [10], "summary": "Family Circuit '91 is a Racing game, developed by Game Studio and published by Namco, which was released in Japan in 1991.", "id": 48497, "name": "Family Circuit '91"}, {"genres": [14], "summary": "With 60 characters with different abilities and appearance, this is softball unlike you ever experienced before. Batter, pitch, catch, get the team you create to the big leagues. \n \nWith different stages and unique abilities, no match is ever the same!", "id": 48907, "name": "Softball Tengoku"}, {"genres": [14], "summary": "A Famicom baseball game developed by Human and published by Bandai. It superficially resembles Namco's Famista series. \n \nMeimon! Daisan Yakyuubu (\"Meimon! The Third Baseball Club\") is a baseball sim for the Famicom that is based on a manga and anime of the same name about an underdog highschool baseball team and the drama that surrounds them. The player can access the game's story mode, which depicts scenes from the manga, by selecting \"Dramatic Mode\" from the title screen menu. This also adds character portraits to the main game mode. \n \nThe game itself is a fairly standard NES baseball game. The pitching/batting perspective is from directly behind the batter, and the player moves the entire group of fielders simultaneously whenever the ball is hit. Graphically, the many super-deformed athletes resemble those of Namco's Famista (the series upon which RBI Baseball was based), which was very much the leading baseball franchise at the time.", "id": 48780, "name": "Meimon! Daisan Yakyuubu"}, {"genres": [15], "summary": "A stock-trading simulation game for the NES and the sequel to Matsumoto Tooru no Kabushiki Hisshou Gaku. \n \nMatsumoto Tooru no Kabushiki Hisshou Gaku 2 is the sequel to the original Matsumoto Tooru no Kabushiki Hisshou Gaku and like that game is a stock trading simulator akin to something like Wall Street Kid. The player needs to keep track of which stocks are rising and falling, identify trends and invest wisely to ensure a wealthy and happy life.", "id": 48782, "name": "Matsumoto Toru no Kabushiki Hisshougaku II"}, {"genres": [15], "summary": "Future Wars: Lios (未来戦史：ライオス Mirai Senshi: Raiosu = Future Soldier: Lios) is a turn-based strategy game developed and published by Pack-In-Video, the same developers who brought us Die Hard (NES). In this game, you play as Cecilia and her army of robots. You must make it to Goinkia's castle and stop him from taking over. To do this, you must travel the overworld and select a location. Once you do, you must take out the enemy's commander robot and then the enemy's base. Then you will win and will be allowed to progress. Sometimes defeating enemies unlocks new weapons.", "id": 48426, "name": "Mirai Senshi: Lios"}, {"genres": [14], "summary": "Kyuukyoku Harikiri Stadium '88 Senshuu Shin Data (Ultimate Harikiri Stadium '88 Players Updated Data Version) is a baseball game developed by Taito Corporation for the Famicom and NES. It is an updated version of Taito's original Kyuukyoku Harikiri Stadium. Like its predecessor, it is a straightforward baseball simulation game for the Famicom which was never released outside of Japan. Besides a roster update and a few graphical improvements there is little difference between this and the previous game in the series. This process of having minor incremental improvements between annual releases would eventually become common practice in console sports games.", "id": 48311, "name": "Kyuukyoku Harikiri Stadium '88 Senshuu Shin Data"}, {"genres": [9, 15], "summary": "Hayauchi Suupaa Igo (Hayauchi Super Go) is a game of \"Go\" for the Nintendo Famicom. Released only in Japan.", "id": 48329, "name": "Hayauchi Suupaa Igo"}, {"genres": [8], "summary": "The year is 1999. When the Akudama Empire attacks the Earth with his army of robots. No conventional weapon in existence is efficient against this opponent. The robots are, however, totally vulnerable to magic. An hired mercenary, Kagemaru, summons the only non-sealed witch, Doropie, to stop the Akudama Empire's offence. The imperial army, led by an old nemesis of Doropie, Empress Elysia, does not surrender though. Elysia captures Kagemaru and blackmails Doropie into breaking her seal and setting her free. It seems that the mercenary lost his life, and Doropie sets out to stop the now-free Empress. After the battle, the dying Empress Elysia confesses the reasons behind the invasion and apologizes. The imperial warship explodes shortly thereafter, but not before Doropie escapes it. She is contacted by Kagemaru, who apparently has survived the wounds that Elysia inflicted on him. Doropie comes back to Earth shortly afterwards.", "id": 48333, "name": "Magical Kid's Doropie"}, {"genres": [8], "summary": "Sir Ababol controlled through the Monegros for all ababoles. To progress in your adventure you'll have to go find a set of keys that you can use to open doors and access other locations. Once you've gathered 24 ababoles finish your mission. \n \nJump up the bat, dogs and warriors to kill them, and avoid touching the water is bad. To recover some encouragement, you can eat one of the chicken thighs \"monegro's fried chicken\" magic they appear scattered around the stage. \n \nBriconsejo: be patient and do not go crazy! \n \nSir Control Ababol Monegrian accross the fields and gather flowers ababol 24. To be Able to progress in your journey you'll need some keys you will be Able to use to open several doors to gain access to different sections. You can jump on the baddies to get rid of them, too. Be patient, think before you jump, and you'll be successful!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ivwihenhghotbjj0327p.jpg", "width": 768, "cloudinary_id": "ivwihenhghotbjj0327p", "height": 544}], "id": 48338, "name": "Sir Ababol"}, {"genres": [14], "summary": "A golf sim for the NES developed by HAL Laboratory and released in 1988 in Japan only. It uses the likeness of prolific Japanese professional golfer Masashi \"Jumbo\" Ozaki. \n \nHAL Laboratory, after creating many of Nintendo's golf games as a second party developer, decided to develop and publish their own golf title. Jumbo Ozaki no Hole in One Professional features the likeness of Japan's most prominent golf player, Masashi \"Jumbo\" Ozaki - the Jumbo nickname comes from his unusual height for a Japanese male: almost 6'. Though featured on the box art and in the title, Jumbo Ozaki makes no obvious appearance in-game. \n \nThough by all practical metrics a perfectly standard overhead golf simulator - players take it in turn to get the ball to the hole in as few shots as possible, selecting the direction, club used and power of each shot - the game does do things a little differently than usual. Specifically, the visual cue for the power of the shot comes from the depiction of the golfer himself: The player must monitor the character as he swings, hitting the button at both the apex and nadir of the swing for maximum effect. This replaces the usual sliding power bar that most golf games have. Failure to hit the swing precisely will lead to slices and hooks. \n \nThe game can be played as a single player Stroke Match, which allows the player to practice on each of the game's 36 holes across two different courses. The player can also play against another human, or rate their score against CPU opponents in the 1 Day and 4 Day modes. The player can also adjust the difficulty, which makes wind speed a much more important factor.", "id": 48340, "name": "Jumbo Ozaki no Hole in One Professional"}, {"genres": [14], "summary": "Perfect Bowling is a Japan-only Famicom bowling game, in which the player competes with other computer opponents. Each of the opponents has their own name, appearance and style of play. The game seems to take place in the future, with lanes restocking pins with lasers and certain characters dressed in strange, futuristic (or at least an 80s interpretation of futuristic) fashions. This is a complete departure from its box art, which seems more reminiscent of the 1950s and 60s. \n \nThe game allows for a lot of precision-based options in order to bowl effectively. This includes rotating the ball to put spin on it, selecting the power and hitting the power gauge just right. The player can also select which hand they favor and the weight of the ball during the character creation process.", "id": 48306, "name": "Perfect Bowling"}, {"genres": [13], "summary": "Bakushou!! Junei Gekijou 3 (\"A Hearty Laugh! Theater Life 3\") is a virtual life board game developed and published for the Nintendo Entertainment System by Taito on December 20th, 1991 in Japan. It is the third installment in the Bakushou!! Jinsei Gekijou series and follows in the same tradition by allowing up to four players to take part and travel around a virtual board through chance rolls, playing out a virtual life in its entirety from childhood to senior citizenship making important decisions along the way.", "id": 48726, "name": "Bakushou!! Jinsei Gekijou 3"}, {"genres": [8], "summary": "\"Saiyūki World 2: Tenjōkai no Majin\" is an action platformer, akin to many games at the time. The protagonist is Sun Wukong, the King Monkey, one of the most popular characters in the Chinese culture. \n \nAfter completing the first stage, the player can play the other six in any order. Each of the stages revolve around elements, such as fire and water. After each stage, the player gains a new weapon, much like in the original Mega Man series, which was extremely popular at the time. The game was released with thematic and graphical changes as \"Whomp 'Em\" for North American audiences. \"Saiyūki World 2: Tenjōkai no Majin\" (as well as Whomp 'Em) and the prior Saiyuki World (which was an adaptation of Wonder Boy in Monster Land) are based on the Journey to the West novel.", "id": 48303, "name": "Saiyuki World 2: Tenjokai no Majin"}, {"genres": [14], "summary": "Nippon Ichi no Meikantoku is a Sports game, published by Asmik Ace Entertainment, Inc, which was released in Japan in 1990.", "id": 48803, "name": "Nippon Ichi no Meikantoku"}, {"summary": "Spy vs Spy: The Island Caper is a competitive multiplayer game where the goal is to recover all the vital items and leave before the other player does the same. It's a tropical-themed variant on the original. \n \nThe Island Caper plays almost identically to the original Spy vs Spy game, just with a graphically updated island theme. Instead of rooms full of fixtures that items might be hidden behind, the player must search beaches on islands for items buried in the sand. Specifically, they need to assemble a missile from its parts, presumably so it can be launched at the opponent spy's home country. Finding the missile will allow the victorious spy to escape the island via a submarine (which inexplicably also includes an attractive woman). There are also traps which, like in the original, can be placed in spots where missile parts might be to fool opponents into killing themselves. \n \nThe game was released on many of the home computers and consoles active at the time. Curiously, it also received a Japan-only NES port named \"Nangoku Shirei!! Spy vs Spy\" published by Kemco.", "id": 48812, "name": "Nankoku Shirei!! Spy vs. Spy"}, {"genres": [12], "summary": "Koufuku o Yobu Game: Dora Dora Dora is a Miscellaneous game, published by Natsume, which was released in Japan in 1991.", "id": 48789, "name": "Koufuku o Yobu Game: Dora Dora Dora"}, {"genres": [31], "summary": "An adventure game for the NES published by Sunsoft. A boy named Kyle must rescue the princess of a kingdom where very small humans and animals peacefully co-exist. \n \nRipple Island (occasionally seen translated as \"Lipple Island\") is a graphic adventure game where the player interacts with the world using a series of commands, such as \"pick up\", \"walk\" or \"use\". \n \nRather than the usual murder mystery games which were the trend at the time, Ripple Island instead adopts a fantasy storybook setting where smaller humans and friendly animals, such as raccoons and rabbits, co-exist peacefully. The kingdom is threatened by the arrival of Gerogeru, a self-styled Emperor of Darkness and giant frog, after he kidnaps the princess. Kyle, a young boy and the game's protagonist, is attempting to rescue her. \n \nThe game was never released outside of Japan. It was, however, re-released as part of a Japan-only PS2 compilation based on Sunsoft's works. It also received a manga adaptation.", "id": 48791, "name": "Ripple Island"}, {"genres": [31], "summary": "Tantei Jinguuji Saburou: Toki no Sugiyuku Mama ni is an Adventure game, published by Data East, which was released in Japan in 1990. \n \nThe 4th installment of the Tantei Jinguuji Saburo (Jake Hunter) series where Jinguji investigates a simple burglary while Yoko searches for a young boy's home.", "id": 48883, "name": "Tantei Jinguuji Saburou: Toki no Sugiyuku Mama ni"}, {"genres": [14], "summary": "An instructional Shogi game, that teaches the Japanese version of chess. It is hosted by Tanigawa Kouji, a top-tier Shogi player. It was released for the Famicom Disk System, NES and MSX. \n \nShogi, a Japanese board game similar to chess, is a board game as popular as Mahjong in Japan. Tanigawa Kouji no Shogi Shinan II (\"Tanigawa Kouji's Instructional Shogi II\") is the second in a series of instructional Shogi games hosted by then-top tier champion and expert Shogi player Tanigawa Kouji to help improve the player's game. \n \nThe first Tanigawa Kouji no Shogi Shinan was only released on MSX home computers, though this game first came out on the Famicom Disk System in 1987. It would later receive additional versions for the MSX and the regular cartridge-based Famicom in 1988. There also exists a second Famicom Disk System version, released after the MSX and Famicom ports, that contains additional puzzle arrangements. The third game in the series would only be released on the Famicom. \n \nNeither this game nor any of the games in the series were ever released outside of Japan.", "id": 48885, "name": "Tanigawa Kouji no Shogi Shinan II: Meijin e no Michi"}, {"genres": [14], "summary": "Tamura Mitsuaki no Mahjong Seminar is a Miscellaneous game, published by Pony Canyon, which was released in Japan in 1990.", "id": 48886, "name": "Tamura Mitsuaki no Mahjong Seminar"}, {"summary": "Super Mogura Tataki!! Pokkun Mogura is a Miscellaneous game, published by IGS, which was released in Japan in 1989.", "id": 48839, "name": "Super Mogura Tataki!! Pokkun Mogura"}, {"genres": [12], "summary": "Shin Satomi Hakkenden: Hikari to Yami no Tatakai is a Role-Playing game, developed by Micronics and published by Toei Animation, which was released in Japan in 1989.", "id": 48846, "name": "Shin Satomi Hakkenden: Hikari to Yami no Tatakai"}, {"genres": [14], "summary": "The sole installment of the Yakuman series on the Famicom. \n \nShin 4-Jin Uchi Mahjong: Yakuman Tengoku is a Miscellaneous game, published by Nintendo, which was released in Japan in 1991.", "id": 48848, "name": "Shin 4-Jin Uchi Mahjong: Yakuman Tengoku"}, {"summary": "Hit Marmot is an Action game, developed by Mega Soft and published by NTDEC, which was released in Asia in 1991.", "id": 48897, "name": "Hit Marmot"}, {"genres": [9], "summary": "Unbelievable! Someone created the most complicated locks in the world. Captain Red-Hat Jack was assigned to grab the enemy's defense information centre's distribution plan, but firstly he must to resolve the series unbelievable locks to achieve his assignment. So time, intelligence, nervous and exciting will come with Jack always during the spy's war. Do you think he will finish this impossible mission? The answer is \"you're better to help Jack!\"", "id": 48906, "name": "Locksmith"}, {"genres": [15], "summary": "SD Gundam: Gachapon Senshi 5 - Battle of Universal Century is a Strategy game, developed by TOSE and published by Yutaka, which was released in Japan in 1992.", "id": 48855, "name": "SD Gundam World: Gachapon Sensei 5 - Battle of Universal Century"}, {"genres": [12], "summary": "SD Gundam Gaiden: Knight Gundam Monogatari 3 - Densetsu no Kishi Dan is a Role-Playing game, developed by TOSE and published by Bandai, which was released in Japan in 1992.", "id": 48853, "name": "SD Gundam Gaiden: Knight Gundam Monogatari 3 - Densetsu no Kishi Dan"}, {"genres": [31], "summary": "The third Famicom entry in the Pachio-kun series. \n \nPachio-kun 3 is a Miscellaneous game, developed by Color Dreams and published by Coconuts Japan, which was released in Japan in 1990.", "id": 48835, "name": "Pachiokun 3"}, {"genres": [31], "summary": "Nishimura Kyoutarou Mystery: Blue Train Satsujin Jiken is a mystery game released for the Nintendo Famicom in 1989. \n \nNishimura Kyoutarou Mystery: Blue Train Satsujin Jiken (\"Kyoutarou Nishimura Mystery: Blue Train Murder Case\") is the first game in a series of murder mystery adventure games based on novels by famed Japanese mystery author Kyotaro Nishimura. It was developed by TOSE and published by Irem on the Famicom in Japan only. Along with other similarly themed franchises such as Tantei Jinguuji Saburo and Yamamura Misa Suspense, it invites players to solve the mystery by talking to witnesses and suspects and interacting with the environment to discover who is behind the murder. \n \nKyotaro Nishimura's novels tend to focus on murders that occur on or around trains with this game being no exception. A body is found on a Blue Train - the name given to Japanese cross-country sleeper trains, i.e. those built to accommodate sleeping passengers - and the player character is brought in to solve the mystery.", "id": 48802, "name": "Nishimura Kyoutarou Mystery: Blue Train Satsujin Jiken"}, {"genres": [9], "summary": "An educational game to teach children Hiragana. \n \nOeka Kids: Anpanman no Hiragana Daisuki is a Miscellaneous game, developed by TOSE and published by Bandai, which was released in Japan in 1991.", "id": 48800, "name": "Oeka Kids: Anpanman no Hiragana Daisuki"}, {"genres": [15], "summary": "Famicom Top Management is a Strategy game, developed and published by Koei, which was released in Japan in 1990.", "id": 48712, "name": "Famicom Top Management"}, {"genres": [14], "summary": "Mahjong Club Nagatacho: Sousaisen is a Miscellaneous game, published by Hect, which was released in Japan in 1991.", "id": 48790, "name": "Mahjong Club Nagatacho: Sousaisen"}, {"genres": [14], "summary": "A Famicom-only Mahjong game that teaches a specific variant called \"Attack Mahjong\" and one of many Mahjong games presented by expert Ide Yosuke. It also had its own special Mahjong controller. \n \nOne of a series of Mahjong games presented by Ide Yosuke (sort of the Dr Kawashima of early Mahjong titles), Ide Yosuke Meijin no Jissen Mahjong (or \"Ide Yosuke: Master of Attack Mahjong\") is a Mahjong game that teaches a very specific gameplay variant. \n \nIde Yosuke Meijin no Jissen Mahjong also came with its own special Mahjong controller that resembles a keyboard. The game is unplayable without it.", "id": 48754, "name": "Ide Yosuke Meijin no Jissen Mahjong"}, {"summary": "Keroppi to Keroriinu no Splash Bomb! is an Action game, developed by Geo Factory and published by Character Soft, which was released in Japan in 1993.", "id": 48441, "name": "Keroppi to Keroriinu no Splash Bomb!"}, {"genres": [12], "summary": "Shadow Brain is a Role-Playing game, developed by Scitron & Art and published by Pony Canyon, which was released in Japan in 1991.", "id": 48397, "name": "Shadow Brain"}, {"genres": [9], "summary": "Kero Kero Keroppi no Daibouken (けろけろけろっぴ の大冒険 Keroppi's Big Adventure?) is based on the popular Sanrio character Keroppi. Released on the Nintendo Family Computer console in Japan in 1991. \n \nBig Adventure is a children's puzzle game where Keroppi must rescue his girlfriend Keroleen who is locked up in a castle. To do so, he must solve the action based puzzles in seven differently themed worlds with four different types of stages (the surface of the maze, flying a plane, a Reversi-like level, and through a field of lava). All the items in the game are pre-determined; there is a need to memorize the pattern for each playthrough so that a player may advance through the levels more quickly once they have achieved a degree of expertise in the game.", "id": 48351, "name": "Kero Kero Keroppi no Daibouken"}, {"summary": "Sea of Dreamland is a side scroller set in the open ocean. Your character is a seahorse who must clear out all dangers before they overtake your character. \n \nYou control the ocean!", "id": 48322, "name": "Sea of Dreamland"}, {"genres": [14], "summary": "The Triathron allows players to compete in the three consecutive events of the triathlon: Swimming, Cycling and Running. In each stage of the race, the player must mash the B button, similar to Track & Field, in order to reach the end of each course before their opponents. After winning a triathlon, the player can invest some points into their chosen competitor's stats and move onto the next.", "id": 48326, "name": "The Triathron"}, {"id": 48339, "name": "Pocket Zaurus Juu Ouken no Nazo"}, {"genres": [31], "summary": "1987 was a big year for Capcom, it was the year that mega man came out, and the year that Makai Island ..... didn't. Developed by Capcom, Licensed by Nintendo, this game was never officially released. \n \nThis game was released in japan. but it was never released in the America's. \n \nMakai Island is played by steering a ship in the oceans. \n \nAs you play you can go on different boats and ships, talk to other people, go on land, and even do some missions. This game seems to take a while to start off. But once you get going you'll be hooked. The world map is rather big and confusing, and chances are you will get lost. But i am sure you can find a map somewhere on the internet.", "id": 48308, "name": "Makai Island"}, {"genres": [14], "summary": "Baken Hisshou Gaku: Gate In is a Sports game, developed by Graphic Research and published by K Amusement Leasing, which was released in Japan in 1990.", "id": 48730, "name": "Baken Hisshou Gaku: Gate In"}, {"genres": [15], "summary": "The goal of this game is to mow all the grass before you run out of gas. Collect gas cans to keep yourself from running on empty.", "id": 48731, "name": "Lawn Mower"}, {"summary": "Silver Eagle is an Action Adventure game, developed by Thin Chen Enterprises and published by Sachen, which was released in Asia in 1994.", "id": 48733, "name": "Silver Eagle"}, {"genres": [31], "summary": "The mystery begins with a stream of blood runninng down Bil Robbins' back. Now its up to you, J.B., to track down the culprit whose hand twisted the knife. Enemies? The victim had so many, they must have been standing in line to bump him off. But the murderer will never get away because the amazing technology of the Nintendo Entertainment System will make all suspects answer to you as you grill them and dig up clues. Unravel a dark world of chilling secrets, hidden mysteries, sultry dames and deceit to crack the case. Yeah, J.B., everyone has something to hide. Don't let them hide it from you!", "id": 48815, "name": "Murder Club"}, {"genres": [15], "summary": "Moulin Rouge Senki: Melville no Honoo is a strategy game released in 1989 for the Nintendo Famicom. \n \nMoulin Rouge Senki: Melville no Honoo (\"Record of Moulin Rouge War: Melville's Flame\") is a strategy war sim with RPG elements for the Famicom. The player controls a party of heroes with an entire army under their control, and fights other armies and random encounters with monsters. To begin the game, the player must purchase and equip their army before setting out. \n \nThe game's battles play out in turn-based formations, and each formation acts separately and can target different formations on the enemy's side. For instance, the archers can aim for any of the four rows of enemy forces, though front-line melee fighters are far more limited.", "id": 48816, "name": "Moulin Rouge Senki: Melville no Honoo"}, {"genres": [14], "summary": "Mezase! Top Pro Green ni Kakeru Yume is a Sports game, developed and published by Jaleco Entertainment, which was released in Japan in 1993.", "id": 48775, "name": "Mezase! Top Pro Green ni Kakeru Yume"}, {"genres": [14], "summary": "Tokyo Pachi-Slot Adventure is a Miscellaneous game, developed by Color Dreams and published by Coconuts Japan, which was released in Japan in 1991.", "id": 48877, "name": "Tokyo Pachi-Slot Adventure"}, {"genres": [12], "summary": "SD Gundam Gaiden: Knight Gundam Monogatari 2 - Hikari no Kishi is a Role-Playing game, developed by TOSE and published by Bandai, which was released in Japan in 1991.", "id": 48854, "name": "SD Gundam Gaiden: Knight Gundam Monogatari 2 - Hikari no Kishi"}, {"genres": [14], "summary": "Pachi-Slot Adventure 3: Bitaoshii 7 Kenzan! is a Miscellaneous game, developed by Aisystem Tokyo and published by Coconuts Japan, which was released in Japan in 1994.", "id": 48795, "name": "Pachi-Slot Adventure 3: Bitaoshii 7 Kenzan!"}, {"genres": [14], "summary": "Pachinko Daisakusen 1 is a Miscellaneous game, developed by Color Dreams and published by Coconuts Japan, which was released in Japan in 1991.", "id": 48838, "name": "Pachinko Daisakusen 1"}, {"genres": [9], "summary": "A block moving puzzle game similar to Sokoban. \n \nOkkotoshi Puzzle Tonjan!? (\"Drop Down Puzzle Tonjan?!\", sometimes known as simply Tonjan) is a puzzle game from NMK that features anthropomorphic pigs pushing mahjong tiles around in a maze, attempting to push entire stacks down one of the many holes in the area. Bonus points are awarded for pushing certain specified tiles into holes first, and there's one tile in particular that will complete the level once pushed down a hole and is the only compulsory target. Future levels increase the number of tiles and the difficulty, adding fish tiles that cause the player to lose a life if they are pushed down a hole. \n \nOkkotoshi Puzzle Tonjan!? appears to a sequel to NMK's earlier Arcade multiplayer action game Butasan, which features similar looking pigs. The rights to the Arcade version of Tonjan were sold to a Korean company, Dooyong, which turned it into a game named Yam! Yam?! featuring a tanooki wearing an apron.", "id": 48798, "name": "Ochin ni Toshi Puzzle Tonjan!?"}, {"genres": [14], "summary": "The sequel to Family Trainer: Totsugeki! Fuun Takeshi Shiro and the ninth game to be made for the NES Power Pad/Family Trainer by Bandai and Human Entertainment. Like its predecessor, it is based on Japanese TV show Takeshi's Castle. \n \nThe ninth Bandai Power Pad game, Family Trainer: Fuuun! Takeshi Shiro is Bandai's second license game based on Takeshi's Castle. The player must fight through a series of physically-demanding and bizarre challenges using the Power Pad accessory in order to reach a showdown with the fortress' owner, a fictionalized version of Japanese entertainer \"Beat\" Takeshi Kitano.", "id": 48762, "name": "Family Trainer: Fuuun! Takeshi Jou 2"}, {"genres": [8], "summary": "Ay caramba! I thoight I already defeated these creeps! What are they doing back! \n \nI can't believe these greasy slimeballs have the guts to go toe to toe with Barthlomew J. Simpson again! Then again, I can't expect such putrid slime to learn the first time. AND these jerks smell like a monster from the bottom of the swamp... like a Swamp Thing! \n \nTime to dust off the old X-Ray specs, shake up my favorite can of Brand-X spray paint, and pull off some radical tricks on my skateboard. These space slugs don't know who they are messing with. Bring it on! This is one Simpson you don't want to mess with. \n \nTHE SPACE MUTANTS have a few words for Bart: \nThat Simpson boy is really dumb! Our homages to him are fake and we are back stronger than ever! So, Bart Simpson, resistance is useless!!! His mutant hunt has already begun but we learned with our errors from the past. We will never be defeated again! Well, looks like Bart is at Lake Terror. I will send an extra amount of my mutant soldiers to kill him!!! Ha Ha Ha Ha Ha!!!", "id": 48934, "name": "The Simpsons: Return of the Space Mutants"}, {"genres": [14], "summary": "A baseball game by Sunsoft released on the Family Computer in 1991. \n \nNantettatte!! Baseball is a baseball game with the innovative feature of being able to update team rosters without needing to buy a brand new full price game. This is done by inserting a mini-cartridge that updates the roster into the main game.", "id": 48811, "name": "Nantettatte!! Baseball"}, {"genres": [31], "summary": "A comedic adventure game that satirizes the heavy number of baseball and murder mystery games for the Famicom. It was developed and published by Capcom in Japan only. \n \nPro Yakyuu? Satsujin Jiken! (\"Pro Baseball? Murder Case!\") is a slightly tongue-in-cheek parody of the Famicom's overabundance of Portopia style murder mystery adventure games and baseball simulators, especially the annual Pro Yakyuu Family Stadium releases. The player controls a professional baseball player that's been framed for a murder and must solve the case while on the lam. Capcom inserted various additional modes into the game, such as mini-games and a shoot-em-up sequence whenever the protagonist is caught by the cops. \n \nThis game is perhaps notable for being released on the same day in Japan - December 24th 1988 - as another Capcom game: Rockman 2. One of these sort of overshadowed the other.", "id": 48826, "name": "Pro Yakyuu? Satsujin Jiken!"}, {"genres": [14], "summary": "The first installment in Koei's mahjong series. \n \nMahjong Taikai (\"Mahjong Tournament\") is a 1989 Famicom mahjong game from Koei and an unknown developer. It features multiple historical figures as possible CPU opponents, including Masamune Date and Napoleon Bonapart. \n \nAs with any mahjong game, the goal is to complete a winning hand before any of the other players can, and the player earns an amount of points dependent on the \"strength\" of their winning hand. They might also lose points depending on who won and how. \n \nKoei would continue making Mahjong Taikai games for other platforms, including Super Mahjong Taikai for the Super Famicom in 1992.", "id": 48788, "name": "Mahjong Taikai"}, {"genres": [4], "summary": "The Opium Wars of 1839 to 1842 and 1856 to 1860 marked a new stage in China’s relations with the West. China’s military defeats in these wars forced its rulers to sign treaties opening many ports to foreign trade. As opium flooded the country despite imperial prohibitions, the court debated its response. On one side, officials concerned about the economic costs of the silver drain and the social costs of addiction argued for stricter prohibitions, aimed not only at Chinese consumers and dealers but also at the foreign importers. On the other side, a mercantile interest including southern coastal officials allied with local traders promoted legalization and taxation of the drug. \n \n \t \nAs opium flooded the country despite imperial prohibitions, the court debated its response. On one side, officials concerned about the economic costs of the silver drain and the social costs of addiction argued for stricter prohibitions, aimed not only at Chinese consumers and dealers but also at the foreign importers. On the other side, a mercantile interest including southern coastal officials allied with local traders promoted legalization and taxation of the drug. Debate raged within court circles in the early 1800s as factions lined up patrons and pushed their favorite policies. \n \nUltimately, the Daoguang emperor decided to support hardliners who called for complete prohibition, sending the influential official Lin Zexu to Canton in 1839.", "id": 48343, "name": "Linzexu Banned the Opium"}, {"genres": [15], "summary": "Scientists discover a giant egg in the ocean, but before it can be studied a Giant Monster (Kaiju) erupts from the sea bent on destroying the egg. Can you battle the monster, limit your losses and ultimately rescue the egg? Tokyo is depending on it!", "id": 48313, "name": "Daikaijuu Deburas"}, {"summary": "Crime Busters is an Action game, developed and published by Bit Corp., which was released in Asia in 1989.", "id": 48320, "name": "Crime Busters"}, {"genres": [14], "summary": "Emoyan no 10-bai Pro Yakyuu is a Sports game, published by Hect, which was released in Japan in 1989.", "id": 48332, "name": "Emoyan no 10 Bai Pro Yakyuu"}, {"summary": "Hyokkori Hyoutanjima: Nazo no Kaizokusen is an Action game, published by Yutaka, which was released in Japan in 1992.", "id": 48755, "name": "Hyokkori Hyoutanjima: Nazo no Kaizokusen"}, {"genres": [5], "summary": "In A.D. 20XX, humans are engaged in fierce warfare with TASAC - the alien bionic mutants. Landsy and Dagrel, commanders of Earth Defense Arms, are encountering the toughest enemies known to man. They must destroy TASAC to rescue the Earth, otherwise humans will be turned into slaves under the TASAC terrorism!", "id": 48805, "name": "Tasac"}, {"genres": [31], "summary": "A Famicom adventure game set during the Meiji Restoration era. It features strategy and action elements as well. \n \nMeiji Ishin (\"Meiji Restoration\") is an adventure game for the Nintendo Famicom that allows the player to take an active role in one of the most important historical movements in Japanese history: the Meiji Restoration era of the late 19th century, which wrested control of the country from the Shogunate and back to the Emperor. \n \nThe first half of the game is spent gathering allies which involves moving from region to region, conversing with leaders and samurai, and occasionally fighting enemies in duels. The second half gives way to a tactical strategy sim similar to Nobunaga's Ambition, as the player's recruited forces march on Edo (Tokyo) to take on the Shogun.", "id": 48781, "name": "Meiji Ishin"}, {"genres": [31], "summary": "A murder mystery graphic adventure game for the Famicom. It was never released outside of Japan. \n \nSatsui no Kaisou: Soft House Satsujin Jiken (\"Hierarchy Of Murderous Intent: The Software House Serial Murders\") is a menu-based adventure game by Hyperware in which the player is a young man attempting to solve the murder of a successful software developer. Like in many Famicom adventure games, the player can gather clues by examining sites of interest, talking to various people and keeping track of the information they've gathered. As the case continues, more people working for the titular game company start dying and the player is given more murders to solve. \n \nTime is an important factor in the game as talking to right people and being in the right places at the right moments will prove instrumental towards solving the mystery. The President of the game company only gives the protagonist three days to solve the case before they get the police involved, giving the player a strict deadline. The game's writer will introduce himself just before the player is asked to identify the culprit, and provide the game's final opportunity to save. The game also has multiple endings, depending on what the player does after the murderer has been identified.", "id": 48859, "name": "Satsui no Kaisou: Power Soft Satsujin Jiken"}, {"genres": [31], "summary": "Julian, a wandering vagabond who carries a beat-up lute, has happened upon the land of Varekai, a place where Strazno, Mystic of Chaos, seems to rule. Once, to hear its citizens tell the tale, Varekai was a normal place where nothing untoward or out of the ordinary happened whatsoever. But these are interesting days, as Sirena, Mvstic of Time, might call them. An unpeakable evil has awoken in the Hamishago mines and thrown the whole of Palacido Forest into upheaval. \n \nMaybe a wandering adventurer Will have the courage to take up the hero’s mantle, and venture deep into the mines to face Whatever lurks there... assuming he has the fortitude to make it that far. Hint... that wandering adventurer is Julian! So get going! Talk to everyone, use your wits, resourcefulness and reflexes to find your way into Palacido and investigate the trouble!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pvwtzftalpshxdmkgkjh.jpg", "width": 1106, "cloudinary_id": "pvwtzftalpshxdmkgkjh", "height": 1500}, "id": 48937, "name": "Mystic Origins"}, {"genres": [31], "summary": "The first in a series of murder mystery games by Taito penned by and named for Japanese mystery writer Misa Yamamura. The game was released only in Japan for the Nintendo Famicom on December 11, 1987. \n \nYamamura Misa Suspense: Kyoto Ryuu no Tera Satsujin Jiken (roughly \"Yamamura Misa Suspense: Murder Case of the Kyoto Buddhist Temple Dragon\") is the first in a series of murder mystery games from Taito, based on the work of prolific Japanese mystery writer Yamamura Misa. \n \nLike many of its Famicom crime adventure game peers the goal is to track down a killer using the provided detective skills: examining crime scenes, collecting evidence and talking to suspects and other helpful NPCs. \n \nThe game, and its sequels, were never localized or released outside of Japan.", "id": 48870, "name": "Yamamura Misa Suspense: Kyouto Ryuu no Tera Satsujin Jiken"}, {"genres": [15], "summary": "SD Gundam : Gachapon Senshi 3: Eiyuu Senki is a Strategy game, developed by TOSE and published by Yutaka, which was released in Japan in 1990.", "id": 48857, "name": "SD Gundam World: Gachapon Sensei 3 - Eiyuu Senki"}, {"genres": [14], "summary": "Famicom Igo Nyuumon is a Miscellaneous game, developed by Home Data and published by I'Max, which was released in Japan in 1991.", "id": 48331, "name": "Famicom Igo Nyuumon"}, {"genres": [14], "summary": "Famicom Meijinsen is a Miscellaneous game, developed by Alpha Denshi and published by SNK, which was released in Japan in 1988.", "id": 48330, "name": "Famicom Meijinsen"}, {"genres": [14], "summary": "Play the game of your dreams with Top Players' Tennis - the only game where you \"become\" Ivan Lendl or Chris Evert. \n \nBut first, you've got four major tournaments to play; the Australian Open, the French Open, Wimbledon and the U.S. Open. Play singles against a friend, or the computer; double up with Lendl or Evert to beat the computer; or play with a friend against the computer. There's excitement, action and sweat as you play game... set... match - and win! \n \nTop Players' Tennis gives you total command of the ball. Hit a passing shot cross-court or down-the-line; play deep from the baseline; serve and volley or take the game with an overhead smash. You set the speed of the serve and the spin on the ball, giving it a top spin, slice, drop shot or side spin - just like the pros. When you're ready, hit a \"Miracle shot,\" where the ball can zig-zag or soar right up in the air! \n \nWhile you play, Evert and Lendl are by your side, with adviCe at the touch of a button. So put yourself on the court with a pro. With Top Players' Tennis, the only thing between you and the Grand Slam is...you!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/y7vh6kullw0bybig91qg.jpg", "width": 1440, "cloudinary_id": "y7vh6kullw0bybig91qg", "height": 1020}], "id": 48911, "name": "Four Players' Tennis"}, {"genres": [14], "summary": "Not so much a sequel to Pro Yakyuu Family Stadium than an enhanced rerelease with updated rosters. It was published by Bandai for the Famicom in late 1987. \n \nPro Yakyuu Family Stadium '87 is the second game in Namco's long running Family Stadium series, also known as Famista. It's a traditional baseball game that allows one human player against the CPU, two competing human players and two competing CPU players in a \"Watch\" spectator mode. \n \nRather than being a full sequel to Pro Yakyuu Family Stadium the game is instead an updated version of the original, which was reflected in its lower price at release. It adds a few features and updates the official rosters for the athletes, but is functionally identical to the original Family Stadium. This specific type of annualization would become common practice for sports game franchises such as Madden NFL and NHL. \n \nIt's worth noting that this game is unrelated to R.B.I. Baseball 2 from Tengen. The original R.B.I. Baseball and Family Stadium were one and the same, the former receiving a name change to appeal to a Western audience, but after that initial game both franchises diverged. R.B.I. Baseball specifically favored more realistic looking athlete sprites while Family Stadium would persist with the cartoonish \"super deformed\" sprites.", "id": 48827, "name": "Pro Yakyuu Family Stadium '87"}, {"genres": [14], "summary": "Mahjong Taisen is a Miscellaneous game, developed by Nihon Bussan and published by Nichibutsu, which was released in Japan in 1992.", "id": 48787, "name": "Mahjong Taisen"}, {"genres": [14], "summary": "Ide Yosuke Meijin no Jissen Mahjong II is a Miscellaneous game, developed by Arc System Works and published by Capcom, which was released in Japan in 1991.", "id": 48753, "name": "Ide Yosuke Meijin no Jissen Mahjong II"}, {"summary": "CITY ADVENTURE touch MYSTERY OF TRIANGLE is an action game for the Famicom and NES system that was published by Toho in 1987. The game is based on the high school and baseball team themed manga Touch. City Adventure Touch is somewhat notorious in Japan for bearing absolutely no resemblance to the source material. A comic book concerning the Mystery of Triangle is included in the manual. The story appears to revolve around a character's dog who disappears into an alternate dimension, and the three children who attempt to rescue it, one of which attacks by throwing baseballs.", "id": 48315, "name": "City Adventure Touch: Mystery of Triangle"}, {"genres": [14], "summary": "Power Soccer is a Sports game, developed by Kitty Group and published by Tokuma Shoten, which was released in Japan in 1990.", "id": 48305, "name": "Power Soccer"}, {"genres": [14], "summary": "Honshogi: Naitou Kudan Shogi Hiden is a Shogi game released for the Nintendo Famicom in 1985. \n \nHonshogi: Naitou Kudan Shogi Hiden (Roughly translated: \"Book of Japanese Chess: Naito Kudan's Japanese Chess Secret\") is a video game biased off of the board game Shoji (Japanese Chess). It was developed and published by SETA Corporation to be released August 10, 1985, exclusively in Japan for the Nintendo Entertainment System. \n \nThe game is named for Naito Kunio Kudan, a famous Shoji player from Japan. Born November 15, 1939, Naito has been a professional Shoji player since he was 18 years old. In addition to helping with this video game, Naito Kudan is a published author, having 13 books written about Shoji and running a column in the sports section of the newspaper. He is also a published singer but mostly does it as a hobby. In 2010 Naito was honored with the Order of the Rising Sun, twin Mitsuaki, the fifth highest honor a citizen can receive in Japan. \n \nHonshogi: Naitou Kudan Shogi Hiden, follows the standard rules of Shoji (Japanese Chess). There is no ability to change the difficulty or handicap. Most of the screen is the Shoji board, but there is also a representation of the player and computer playing Shoji in a Japanese setting, which moves as the game moves. The player always starts first, with the fastest possible way to beat the computer set at 15 hands/turns. \n \nHonshogi: Naitou Kudan Shogi Hiden was entered into the first annual World Computer Shoji Championship in 1990. It was the only NES entrant out of the six entrant, software versus software competition. The game finished in forth place, with a record of two wins and three losses.", "id": 48756, "name": "Hon Shogi: Naitou Kudan Shogi Hiden"}, {"genres": [31], "summary": "A Famicom adventure game developed by Taito and based on an obscure Japanese movie of the same name. Kyonshiizu is the Japanese name for Jiang Shi, the Chinese hopping vampire. \n \nKyonshis 2 is an action adventure game by Taito and is based on the movie in the same name, which in turn was a sequel to a movie known in the west as Mr. Vampire. The game itself does not have a predecessor: while Phantom Fighter is based on the previous movie in the series, the game came after this one and is unrelated. \n \nThe game plays like a graphical adventure game with menu commands, a popular Famicom genre at the time, with additional action sequences. The player must walk around town hunting for clues about the roaming Jiang Shi (Kyonshi) while occasionally fighting said creatures and other enemies.", "id": 48793, "name": "Kyonshies 2"}, {"genres": [14], "summary": "Namcot Mahjong III: Mahjong Tengoku is a Miscellaneous game, developed and published by Namco, which was released in Japan in 1991.", "id": 48813, "name": "Namcot Mahjong III: Mahjong Tengoku"}, {"genres": [14], "summary": "A Famicom Shogi game developed by Random House and published by Seta. \n \nMorita Kazuo no Shogi (\"Kazuo Morita's Shogi\") is a Shogi game from Random House. The game's namesake, Kazuo Morita, is a famous Japanese Shogi player that had previously been attached to several Shogi games prior to this one. Furthermore, Random House (not to be confused with the famous book publisher) is his development company. \n \nAs well as playing regular Shogi against an AI opponent, the player has a few options regarding the set-up of the pieces. There is a mode where they place all the tiles on the board themselves, in case they wish to continue an existing game or maybe replay a famous match at its turning point.", "id": 48817, "name": "Morita Kazuo no Shogi"}, {"genres": [15], "summary": "The first in Hudson's series of train-themed video board games which was released on the Famicom in Japan only on December 2nd 1988. \n \nMomotaro Dentetsu (\"Momotaro's Railway\") is a train-themed board game featuring the folklore hero of Momotaro, the Peach Boy. It is the first in Hudson's long-running series of the same name. The goal is for each player to drive a train around a board by rolling a die and trying to make as much money as possible, a la board games like Monopoly or the Game of Life. \n \nThe game and its series is not to be confused with Momotaro Densetsu, an earlier RPG from Hudson featuring the same characters.", "id": 48771, "name": "Momotarou Dentetsu"}, {"genres": [12], "summary": "A Famicom RPG based on a famous Japanese novel series of the same name. It was developed by Alpha Denshi and published by SNK. \n \nSatomi Hakkenden (usually translated as \"The Eight Dog Chronicles\") was a long-running 19th century novel series about eight samurais from the Sengoku period and their various adventures. It was in some ways partly inspired by the ancient Chinese epic The Water Margin, which has itself seen video game adaptations in the form of the Suikoden games. Receiving numerous TV and film adaptations, including the 1983 film known in the west as Legend of the Eight Samurai, Satomi Hakkenden would be its first video game adaptation. Makai Hakkenden Shada for the Turbografx-16, also released in 1989, would be a later adaptation. \n \nThe game itself plays much like Dragon Quest; a common source of inspiration for 8-bit RPGs. The player can walk around towns conversing with NPCs, equipping themselves with weapons and armor and receiving quests and directions to new areas before leaving the safety of the town to fight random encounters on the overworld map that links locations together. Combat follows the tactical turn-based pattern, allowing the player input their characters' desired actions before watching each turn play out. Most of the enemies in the game are based on classical Japanese monsters, usually youkai.", "id": 48860, "name": "Satomi Hakkenden"}, {"genres": [14], "summary": "A third shogi instructional game starring the expert player Tanigawa, this one was a Famicom exclusive. \n \nTanigawa Kouji no Shogi Shinan III (\"Kouji Tanigawa's Instructional Shogi III\") is a Shogi game with numerous tutorials and the third in the series presented by Tanigawa Kouji, a real-life Shogi expert. It also features different playing modes, including one where the choice of tiles to move is determined by a slot machine. \n \nUnlike its immediate predecessor, which was released on both the MSX and the Famicom Disk System, Shogi Shinan III was exclusive to the Nintendo Famicom and did not see any ports.", "id": 48884, "name": "Tanigawa Kouji no Shogi Shinan III"}, {"genres": [15], "summary": "A Sengoku period board game simulation starring Beat Takeshi. \n \nTakeshi no Sengoku Fuuunko is a board game simulation starring Japanese comedian-turned-actor \"Beat\" Takeshi Kitano. Similar to the Game of Life, players move around a board earning money and occasionally encountering events such as a minigame - in which the player can increase their wealth should they succeed - or a penalty. The game has a Sengoku era theme running throughout, from its samurai characters to the tattooed gambler that rolls a dice for determining how many places a player can move around the board that turn. \n \nBeat Takeshi appears frequently while the game is being played dressed in traditional Sengoku era clothing. The game is presumably in reference to the TV show Takeshi's Castle, which also starred Beat Takeshi and had a Sengoku era theme.", "id": 48887, "name": "Takeshi no Sengoku Fuuunko"}, {"genres": [8], "summary": "Tsurupika Hagemaru: Mezase! Tsuruseko no Akashi is 2D platforming game released for the Famicom (NES) in 1991. The game is based on a Japanese children's manga and 58-episode anime series called Tsurupika Hagemaru (Little Baldy Hagemaru), and features many of its characters including protagonist Hagemaru whom the player controls.", "id": 48874, "name": "Tsurupika Hagemaru: Mezase! Tsuruseko no Akashi"}, {"genres": [14], "summary": "A fishing sim based on a manga license for the NES. It was developed by Victor Interactive and never released outside of Japan. \n \nTsurikichi Sanpei: Blue Marlin Hen (lit: \"Fishing Maniac Sanpei: Blue Marlin Chapter\") is a fishing sim based on a manga and eventual anime named Tsurikichi Sanpei, following the adventures of a preternaturally gifted young fisherman and his travails in various fishing competitions. \n \nThe game is centered around one of these fishing competitions, where Sanpei has a limited amount of time to catch the largest blue marlin out of all the competitors. The player must make careful judgements and use their limited time wisely to find and hook the largest marlin they can before the competition ends. \n \nThe first game based on the Tsurikichi Sanpei license, Blue Marlin Hen was released on the NES and the MSX around the same time in 1988. Later, there would be a sequel of sorts for the MSX only in 1989 and a PS1 game much later in 2002. \n \nIn order to catch anything, the player must choose one of several regions of sea in which to fish. Areas which look promising have large fish icons. Time passes more quickly on this screen, so it's in the player's best interest to find a spot quickly. \n \nOnce a sea region has been selected, the player must choose the right kind of bait for hooking billfish and simply sit until they have a bite. At this point, the player must use the gauge above the screen to maneuver themselves and reel the fish on the line. Each fish is judged on its size and play resumes.", "id": 48875, "name": "Tsuri Kichi Sanpei: Blue Marlin Hen"}, {"genres": [5], "summary": "A game produced in Brazil for the NES clone Turbo Game. \n \nThe Persian Gulf and the Paradise of the Black Gold (Petroleum). Many countries depend on the oil for its proper economic development. One ambitious politician, to satisfy its desire to control the world, ogranized an army with extraordinary power fight and occupy the Persian Golf. The dependent countries had been without conditions to face this ruler, then, they had created an organization for the protection of peace worldwide and had sent the helicopter SUPER AH-64 to intervene in the enemy battlefield.", "id": 48931, "name": "War in the Gulf"}, {"genres": [14], "summary": "Track & Field, known in Japan as Hyper Olympic (ハイパーオリンピック Haipā Orinpikku?), is a 1983 Olympic-themed sports arcade game developed and published by Konami. The Japanese release sported an official license for the 1984 Summer Olympics. \n \nThe arcade version was released in 1983. The simple gameplay, based on quick repeating button presses, set the basics for sequels and similar games in the genre for the next decades. \n \nThe NES version of Track & Field was re-released in Europe in 1992 as Track & Field in Barcelona by Kemco in the light of the 1992 Summer Olympics. The opening song for the NES version is the Chariots of Fire theme by Vangelis (which was also used in the arcade version's high score screen).", "id": 48893, "name": "Track & Field in Barcelona"}, {"genres": [14], "summary": "Mr. Splash is a limited edition and highly sought after homebrew promotional Famicom game which was produced by a Japanese television station in 2007, years after officially new games for that system had ceased production.", "id": 48913, "name": "Mr. Splash"}, {"genres": [15], "summary": "SD Gundam: Gachapon Senshi 4: New Type Story is a Strategy game, developed by TOSE and published by Yutaka, which was released in Japan in 1991.", "id": 48856, "name": "SD Gundam World: Gachapon Sensei 4 - New Type Story"}, {"genres": [31], "summary": "The second game based on the Osomatsu-kun anime and manga, released in 1989 for Famicom. \n \nOsomatsu-Kun: Back to the Me no Deppa no Maki is an Adventure game, developed by TOSE and published by Bandai Shinsei, which was released in Japan in 1989.", "id": 48797, "name": "Osomatsu-Kun: Back to the Me no Deppa no Maki"}, {"genres": [14], "summary": "The eighth Family Trainer game produced by Bandai for the NES, Totsugeki! Fuun Takeshijou is based on the obstacle course TV show Takeshi's Castle. \n \nFamily Trainer: Totsugeki! Fuun Takeshijou is based on the popular TV show Takeshi's Castle, where contestants are pitted against each other in a series of generally absurd physical challenges in order to storm the castle of a character based on Japanese entertainment icon \"Beat\" Takeshi Kitano. \n \nThe game required that the player use the Family Trainer (known as the Power Pad elsewhere) accessory to complete a series of athletics-based challenges to reach the final boss round, which involved driving a small tank around and defeating opponents including Takeshi.", "id": 48763, "name": "Family Trainer 8: Totsugeki! Fuuun Takeshi Jou"}, {"summary": "The tenth and final Bandai game to use the Family Trainer/Power Pad accesssory for the NES. The player helps a baby kyonshi (jiang shi) find its parents. \n \nFamily Trainer: Rairai Kyonshizu is the final game in Bandai's series of Family Trainer games, intended for use with the peripheral of the same name (called the Power Pad overseas). It is based on a TV show about a young Kyonshi - better known as the Jiang Shi Chinese hopping vampire outside of Japan. The player, as the Kyonshi, must complete various mini-game challenges in order to help it reach its parents. \n \nThe subtitle for this game is \"Baby Kyonshii no Amida Daibouken\" or \"Baby Kyonshi's Ladder Adventure\" - the ladder randomly determines the next mini-game.", "id": 48761, "name": "Family Trainer: Rai Rai Kyonshis: Baby Kyonshi no Amida Daibouken"}, {"genres": [14], "summary": "Shogi Meikan '93 is a Miscellaneous game, developed and published by Hect, which was released in Japan in 1992.", "id": 48844, "name": "Shogi Meikan '93"}, {"genres": [14], "summary": "Nantettatte!! Baseball OB All Star Hen is a Sports game, developed and published by SunSoft, which was released in Japan in 1991.", "id": 48809, "name": "Nantettatte!! Baseball OB All Star Hen"}, {"genres": [31], "summary": "The third of three NES Sherlock Holmes adventure games from Towa Chiki and Another. \n \nM-Kara no Chousenjou is the third in Another/Towa Chiki's series of adventure games for the Famicom that star Sir Arthur Conan Doyle's famous sleuth, Sherlock Holmes. It follows Sherlock Holmes: Hakushaku Reijou Yuukai Jiken and Meitantei Holmes: Kiri no London Satsujin Jiken. As with the second of those games, M-Kara no Chousenjou has the player navigate a menu to talk to NPCs and witnesses, investigate areas of interest, find and pick up evidence and walk to various locations across Victorian-era London and other cities.", "id": 48777, "name": "Meitantei Holmes: M-Kara no Chousenjou"}, {"genres": [14], "summary": "Kyuukyoku Harikiri Stadium (究極ハリキリスタジアム? lit. Ultimate Harikiri Stadium) is a baseball game developed by Taito Corporation. It was published in Japan for the Famicom in 1988. It is the first of the series of baseball games that was informally known as \"Harisuta\", which saw four games published for the Famicom, and two more for the Super Famicom. The starting entry contains 13 teams, 12 of which are modeled after real Japanese teams, while a 13th team (the I team) consists of a team of women players who represent various idols or models who were popular at the time. The game features a single player mode against the computer, a head-to-head mode for two players, or a home run mode where you compete to see who can hit the most home runs. Before the end of 1988, a version of the same game was released with an updated player roster, under the title Kyuukyoku Harikiri Stadium '88 Senshuu Shin Data.", "id": 48309, "name": "Kyuukyoku Harikiri Stadium"}, {"genres": [5], "summary": "Blade Buster is a new homebrew NES shoot ’em up by the doujin group High Level Challenge. The game is based on the two time attack modes from the 1990 Turbografx-16 vertical shoot ’em up Super Star Soldier, in which you try to achieve the highest possible score in either 2 or 5 minutes. So there are only two short stages in the game, with the boss battles at the end of each one. Aside from the standard enemies, boxes, and gems, there are various hidden bonuses you can get for extra points.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qsvgn4meykkhpeccq8nt.jpg", "width": 905, "cloudinary_id": "qsvgn4meykkhpeccq8nt", "height": 1600}, "id": 48316, "name": "Blade Buster"}, {"genres": [12], "summary": "An RPG/Fighter hybrid developed and published by Sigma for the Famicom. It was never released outside of Japan. \n \nHissatsu Doujou Yaburi is an RPG where players fight opponents in Yie Ar Kung-Fu style martial arts battles. The player needs to train for tournaments by encountering and defeating various foes, gaining XP all the while. When strong enough, they can fight a group of enemies one after the other in the tournaments that take place in towns. The player can also walk around towns interacting with friendly NPCs. \n \nThis was Sigma Ent Inc.'s first Famicom game: Previously, they had only worked on Arcade games.", "id": 48759, "name": "Hissatsu Doujou Yaburi"}, {"summary": "Kiteretsu Daihyakka is an Action game, published by Epoch, which was released in Japan in 1990.", "id": 48746, "name": "Kiteretsu Daihyakka"}, {"genres": [14], "summary": "Isaki Shuugorou no Keiba Hisshou Gaku is a Sports game, developed by C-Lab and published by Imagineer, which was released in Japan in 1990.", "id": 48752, "name": "Isaki Shuugorou no Keiba Hisshou Gaku"}, {"genres": [12], "summary": "Tao (lit. \"Way\" or \"Road\") is an RPG from Pax Softnica, which worked with Nintendo on games like Mother, and Vap, the publishers behind the infamous Ganso Saiyuuki: Super Monkey Daibouken. \n \nThe game concerns a spiritual wanderer who is attempting to avert the end of days predicted by Nostradamus in a near future which has already been wracked with disaster. In order to do this, he must invoke the powers of various different religions and belief systems, including those from Hindu, Buddhist, Christianity and other faiths. The game is known for its abstract and unusual personality. \n \nA Sci-fi mystical RPG set in a post apocalyptic world, where a young man unravels a mystery regarding his origins and attempts to thwart an Nostradamus-tinged apocalypse that begins as a meteorite slams into his hometown. Find eight pieces of a trigram, 7 chakra statues and 7 amulets of the star lords in 7 mystic cities while fighting a cast of bizarre demons and gods!", "id": 48806, "name": "Tao - The Way"}, {"genres": [31], "summary": "Muder on the Mississippi is a mystery game initially released in 1986 for the Apple II, Commodore 64 and Commodore 128. It was later ported to the Famicom and MSX2 in Japan. \n \nMurder on the Mississippi, known as Mississippi Satsujin Jiken in Japan, is a menu-driven adventure game loosely based on Sir Arthur Conan Doyle's Sherlock Holmes character. Sir Charles Foxworth and his manservant Regis (Watson in some versions) are on board a Mississippi steamboat heading to New Orleans when a sudden murder forces them to determine who the killer is before Sir Charles becomes their next target. \n \nPlayers move from room to room interrogating suspects and witnesses while looking for clues, occasionally having to avoid a pitfall or trap that will end the game early with the death of Sir Charles. The player needs sufficient evidence to condemn the correct culprit as well, otherwise the game ends on a bad note. \n \nThe game was originally released on the Apple-II, Commodore 64 and Commodore 128 by Activision. Jaleco acquired the rights to license the game in Japan and released their own version for the Japanese MSX and Famicom, which was developed by contract developers TOSE. Some aspects of the Japanese version, including character names and the intro, are different from the Activision version.", "id": 48774, "name": "Mississippi Satsujin Jiken: Murder on the Mississippi"}, {"genres": [14], "summary": "A pachinko simulator for the NES, published by Coconuts Japan. It is the first in a series of pachinko games to feature the Pachio-kun mascot. \n \nThe first game to feature Pachio-kun, the mascot for a series of pachinko-themed games by Coconuts Japan, Mezase Pachi Pro: Pachio-kun (\"Aiming For Pachinko Pro: Pachio-kun\") is simply a virtual pachinko hall with 72 different machines on which the player may try their luck. \n \nThe game rewards attentive pachinko veterans by having several of the machines possess quirks, such as the frequency of payouts, certain pins being bent that will favor a ball's route to the bottom and the like. Pachio-kun simply has to lean in to examine the machines closer to ascertain how to make the machine pay out. The overall goal is to keep playing each machine, winning either through a determined strategy or simple perseverance, until all the machines have been emptied of their contents. Doing so will win the game.", "id": 48776, "name": "Mezase Pachi Pro: Pachiokun"}, {"genres": [12], "summary": "An RPG published by Kemco for the Famicom. It was never released outside of Japan. \n \nSanada Juu Yuushi (roughly \"Sanada Ten Braves\") is a Sengoku era themed RPG featuring ninjas. The Sanada in question is Yukimura Sanada, the second son of one of the more important daimyos (feudal lords) of that era, who is purported to have had ten legendary ninjas helping his war efforts - the same ten braves referred to by the game's title. \n \nThe game's general plot has Sanada finding and recruiting the titular ten braves, usually with the caveat that the player helps them with a task before they'll agree to join the party. The menu-driven RPG battles are a little unusual as each is a one-on-one battle with a singular opponent - however, the player is free to choose from any of the characters they've already recruited, changing the character in the subsequent round if they so wish.", "id": 48862, "name": "Sanada Juu Yuushi"}, {"summary": "Pyokotan no Dai Meiro is an Action game, developed by Japan System Supply and published by SunSoft, which was released in Japan in 1993.", "id": 48824, "name": "Pyokotan no Dai Meiro"}, {"genres": [9], "summary": "Peepar Time is a Puzzle game, developed and published by Sanritsu Denki, which was released in Japan in 1990.", "id": 48831, "name": "Peepar Time"}, {"genres": [31], "summary": "Shounen Ashibe: Nepal Daibouken no Maki is an Adventure game, developed by Advance Communication Company and published by Takara, which was released in Japan in 1991.", "id": 48842, "name": "Shounen Ashibe: Nepal Daibouken no Maki"}, {"genres": [14], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rdmv9arshwlyxpnn2k8r.jpg", "width": 1000, "cloudinary_id": "rdmv9arshwlyxpnn2k8r", "height": 1295}, "id": 44151, "name": "Mini-Putt"}, {"genres": [15], "summary": "SD Sengoku Bushou Retsuden: Rekka no Gotoku Tenka o Nusure! is a Strategy game, developed by Arc System Works and published by Banpresto, which was released in Japan in 1990.", "id": 48852, "name": "SD Sengoku Bushou Retsuden: Rekka no Gotoku Tenka o Nusure!"}, {"genres": [31], "summary": "Nishimura Kyoutarou Mystery: Super Express Satsujin Jiken is an Adventure game, developed by TOSE and published by Irem, which was released in Japan in 1990.", "id": 48801, "name": "Nishimura Kyoutarou Mystery: Super Express Satsujin Jiken"}, {"genres": [15], "summary": "In Shockwave you need to retrieve powerful crystals left behind by the Tarian race. The Rastons are after the crystals also, which places a short time limit on the mission. You are armed only with a spacesuit and a shockwave pistol. To retrieve the crystals, you will need to find your way through numerous mazes. Blocks in the maze can be moved with the shockwave pistol. When you hit a block with the pistol, this will move blocks adjacent to the block hit rather than the block itself. If numerous blocks are lined up, the shockwave will continue to travel through the blocks until the path is clear and a block can be moved. Some blocks are indestructable and immovable, while others can be moved, and some completely destroyed. Teleportation doors, force fields and other special items can be found in some mazes. To complete most of the levels the blocks will need to be moved about in the proper order to avoid leaving a critical path permanently blocked. If you do get stuck, there is an option to restart a maze (this feature becomes more and more useful as the game progresses.) Wandering about many of the levels are FireStars which will weaken your spacesuit and eventually destroy it. Each level has a time limit in which to solve the maze and retrieve all of the crystals.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qdpjzslw5h8mb9wxrn7h.jpg", "width": 1528, "cloudinary_id": "qdpjzslw5h8mb9wxrn7h", "height": 2100}, "id": 48084, "name": "Shockwave"}, {"genres": [14], "summary": "Sofel takes life simulation into the future with Klashball, for the NES. In a stadium hundreds of years from now, techno-gladiators do battle, combining contact with speed and finesse. Two five-man teams go for it, each fighting to deliver a three-kilo metallic energy sphere into the opponents goal zone. Teams challenge each other in a surreal arena that utilizes devices such as a warp tunnel, ball launcher, and magnetically charged bounce domes. Klashball features a complete league system. There are 11 rowdy teams, each with unique skills, strengths, and weaknesses. After each match the central computer analyzes the outcome and records the stats. Play against the computer or klash it out with a friend. If you're ready, take a trip into the 23rd century with Klashball. A game so real, it's in your face!", "id": 48146, "name": "Klash Ball"}, {"genres": [10], "summary": "The Nintendo Entertainment System version of the game is a simplified version that allows players to practice up to six laps or qualify for every Formula One race of the season using metric units (kilometres per hour instead of miles per hour). It was one of the few 8-bit Formula One video games to adequately represent the Circuit Gilles Villeneuve as having an urban background along with several other urban race tracks represented in the 1992 Formula One season. Tire wear is possible resulting in trips to the pit crew for maintenance and repairs. A radio allows communication with the crew chief; he will advise whether repairs are necessary. The top speed of the vehicle is 325 kilometres per hour and turbo is not used in the game. \nBefore the first qualifying session can take place, the player must insert his name and his nationality. The name can be up to 10 characters long and the country has to fit into a three-character field. Since the game doesn't verify if the three-letter code matches up to a real nationality, it doesn't matter if the player makes up a nationality for a fictional country.", "id": 48290, "name": "Ferrari Grand Prix Challenge"}, {"genres": [12], "summary": "Ganbare Goemon Gaiden: Kieta Ougon Kiseru is a Role-Playing game, developed and published by Konami, which was released in Japan in 1990.", "id": 48613, "name": "Ganbare Goemon Gaiden: Kieta Ougon Kiseru"}, {"genres": [8, 9], "summary": "In the beginning, an archaeologist and explorer known as Indiana Borgnine (インディー・ボーグナイン?), is in search of the fabled Hanging Gardens of Babylon. After reading some lost scriptures, he determines that the only way to see them is to travel to the very top of the 64-story Tower of Babel. Upon reaching the Tower, he discovers that the only way to access the floors above him are to solve some challenging puzzles involving loose L-shaped blocks that he finds throughout the Tower. To his great surprise, the blocks are capable of balancing very well on top of one another, in order to form staircases.", "id": 48589, "name": "Babel no Tou"}, {"genres": [31], "summary": "My Life My Love: Boku no Yume Watashi no Negai is a Miscellaneous game, developed by WinkySoft and published by Banpresto, which was released in Japan in 1991.", "id": 48814, "name": "My Life My Love: Boku no Yume Watashi no Negai"}, {"genres": [12], "summary": "RPG Jinsei Game (ＲＰＧ人生ゲーム?, \"RPG Life Game\") is a Japan-only role playing game for the Family Computer that is similar to Jinsei Game, which is the Japanese version of The Game of Life. \n \nThe object is to explore a city full of stores, places of employment, and learning places. Starting from home, the player must earn money and statistics in order to unlock the better features of the game. \n \nUnlike most games based on the Jinsei Game series, RPG Jinsei Game doesn't use a spinner system. Instead, the controller pad is used for movement and random encounters are featured like in Dragon Quest. The player can also talk to strangers who might either give him/her advice or do something malevolent to him/her. As in the actual Game of Life board game, the player has to choose from a series of careers ranging from a musician to a photographer and even a professional wrestler. Most of these tasks are mundane while one of the quests directly involves chasing down unidentified flying objects. Buildings that are crucial to the quest (other than shops and learning places) can be fully explored; otherwise the player simply talks to the resident. \n \nFights can occur like in a real role-playing game. However, the players stats are used instead of hit points and magic points.", "id": 48819, "name": "RPG Jinsei Game"}, {"summary": "Plasma Ball is an Action game, developed and published by Jaleco Entertainment, which was released in Japan in 1992.", "id": 48829, "name": "Plasma Ball"}, {"genres": [9], "summary": "Tablet-based drawing game. \n \nOeka Kids: Anpanman to Oekaki Shiyou!! is a Miscellaneous game, developed by TOSE and published by Bandai, which was released in Japan in 1990.", "id": 48799, "name": "Oeka Kids: Anpanman to Oekaki Shiyou!!"}, {"summary": "Sybok; Spock’s former classmate at the Vulcan School of Thought has used his mind-melding powers to cause the settlers on the planet nimbus to join his force. A Vulcan whose can show emotions, he has taken control of paradise. \n \nUnpublished game ROM leaked by Lost Levels in 2006.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/i10odo3sxkepsslarw7l.jpg", "width": 1528, "cloudinary_id": "i10odo3sxkepsslarw7l", "height": 2100}, "id": 48319, "name": "Star Trek V: The Final Frontier"}, {"genres": [12], "summary": "The player controls a female character throughout most of the game. A male character is played towards the end of the game. The game uses \"Levels\", HP, items, and upgrades. Three game saving slots are used, rather than passwords. Overhead view action oriented battles. Randomly generated battles while traversing the overworld.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/znsmauglb3w4gbvz8lnq.jpg", "width": 1520, "cloudinary_id": "znsmauglb3w4gbvz8lnq", "height": 2100}, "id": 48060, "name": "Faria: A World of Mystery and Danger!"}, {"genres": [8], "summary": "Thrilling new cinema screen! Follow the story of Ryu's epic adventure through Tecmo's movie-like Cinema Screen Animation. As you complete each level, a new part of the story unfolds. Exciting new powers and weapons! Over the years Ninja Ryu's fighting skills have improved to include fantastic new powers and weapons. Action-packed Ninja adventure! Can you get Ryu through his most challenging adventure as he battles the hideous ancient forces of darkness to save mankind? The Ultimate Ninja Challenge!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pqfjn07eizxox8hjqs80.jpg", "width": 250, "cloudinary_id": "pqfjn07eizxox8hjqs80", "height": 365}, "id": 17249, "name": "Ninja Gaiden III: The Ancient Ship of Doom"}, {"genres": [9], "summary": "The Universe Soldiers is a Pac-Man clone made by the Taiwanese developer, Gametek. \n \nIn the game you travel around the universe collecting dots to save the universe. Each world within the game contains 2-3 levels. An ending is also included.", "id": 48323, "name": "The Universe Soldiers"}, {"genres": [8, 9, 12, 31], "name": "Wizards & Warriors III: Kuros: Visions of Power", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xgllo5qiuqvxnsdwxnm2.jpg", "width": 1521, "cloudinary_id": "xgllo5qiuqvxnsdwxnm2", "height": 2095}, "summary": "When Kuros last did battle with the Evil Wizard Malkil atop Icefire Mountain, he raised his Ironsword in triumph and glory... or so he thought. Suddenly, a powerful bolt of magic has robbed Kuros of his armor, memory, and honor. But the distant presence of evil stirs in his mind, leading him to the once fair city of Piedup, the very same place where the villainous soul of Malkil survives. Without his armor, Kuros will need crafty disguises to travel undetected, ready to do battle as a wizard, nobleman or thief. His quest will take him from the depths of the dungeon to the palace containing riches beyond belief - building strength, perfecting fighting skills and acquiring rare knowledge of magic along the way. The time has come for Kuros to turn his visions of power... into reality!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xylf2jmtzi74n8zslctr.jpg", "width": 1440, "cloudinary_id": "xylf2jmtzi74n8zslctr", "height": 1080}], "id": 48092}, {"genres": [15], "summary": "Win, Lose or Draw was a popular TV show requiring artistic skills and an ability to think laterally. A player on your team draws something on the big game board, and you must work out what it represents. They will be common expressions depicted literally, such as 'bright idea' showing a light bulb over somebody's head, and 'cabin fever' as a rickety building next to a man with a thermometer in his mouth.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/z9etszjdezj1mlopwrby.jpg", "width": 1521, "cloudinary_id": "z9etszjdezj1mlopwrby", "height": 2095}, "id": 48093, "name": "Win, Lose or Draw"}, {"genres": [31], "summary": "\"From Out of the Darkness... Shall Arise a Challenge To Your Wisdom\" Join Shadax's quest as he searches through the deadly fortress of Kastlerock for the six pieces of the magical Staff of Demnos, in a brave attempt to save Princess Eleanor from the evil magician Morbius! Over 250 challenging rooms to explore. Brilliant 3-D graphics, music and sound effects. Powerful potions and magical keys. Fearless evil characters to defeat. Non-violent fun for the entire family!", "id": 48244, "name": "Solstice: The Quest for the Staff of Demnos"}, {"genres": [8], "summary": "Imagine packing the power of 100 strategic missiles in every punch. Imagine needing every single megaton just to hold your own against a cybernetic army of metallic monstrosities. That's the guts of SHATTERHAND, the game that redefines hand-to-hand combat in the 21st century... along with all the standards for single-player action games for the NES. Seven levels of programmed adventure - you choose the action! State-of-the-art graphics featuring 8-direction scrolling! \"Anti-gravity\" levels force you to fight upside-down! Armed \"satellite robots\" assist you in battle. No arms on Earth can withstand the power in your hands!", "id": 48648, "name": "Shatterhand"}, {"genres": [4], "summary": "Fighting Hero is an unlicensed fighting game, based off Street Fighter.", "id": 48582, "name": "Fighting Hero"}, {"genres": [12], "summary": "Bikkuriman World: Gekitou Sei Senshi is a Role-Playing game, developed by Atlus and published by Hudson, which was released in Japan in 1990.", "id": 48544, "name": "Bikkuriman World: Gekitou Sei Senshi"}, {"genres": [12], "summary": "The seal of the Dark Lord Terarin has been broken and Terarin has been unleashed into the world again. She has stolen the Golden Seal and opened pandora's box, unleashing evil creatures into the world. A young hero is tasked by a king to stop Terarin. He must step into footsteps of Iason, a shepherd that once accidentally unleashed Terarin and fought to seal the Dark Lord again. The hero must enlist the aid of three companions, Guy the warrior, Medi the amazon and Treo the pirate (called Turo in the manual) and find the three keys to Terarin's lair. To face the Dark Lord, they must find the mystical weapons and armor of old and then defeat Terarin and seal the Dark Lord from the world.", "id": 48477, "name": "Haja no Fuuin"}, {"genres": [31], "summary": "Seirei Gari is an Adventure game, developed by Advance Communication Company and published by Hudson, which was released in Japan in 1989.", "id": 48398, "name": "Seirei Gari"}, {"genres": [14], "summary": "Pro Yakyuu Family Stadium '88 is the third in Namco's Pro Yakyuu Family Stadium series. As with its immediate predecessor, Pro Yakyuu Family Stadium '87, it is a slightly revamped version of the original with updated rosters. As with EA Sports's present-day practice, Namco released these games annually with little to distinguish each new iteration. Most notable of the smattering of minor new additions is allowing the player to choose their venue from four options, ranging from a fully-packed stadium to a park. \n \nThough this is the second sequel to Pro Yakyuu Family Stadium, which was released in the US by Tengen as R.B.I. Baseball, Pro Yakyuu Family Stadium '88 is not to be confused with R.B.I. Baseball 3. Though the first R.B.I. Baseball was a direct localization, subsequent R.B.I. Baseball games were created in the US and are entirely independent from Namco's series.", "id": 48304, "name": "Pro Yakyuu Family Stadium '88"}, {"genres": [12], "summary": "An RPG brawler released for the Family Computer and Super Famicom based on the anime and manga of the same name. Both were developed by TOSE and published by Bandai. \n \nRokudenashi Blues (\"Good-for-Nothing Blues\") is a RPG brawler based on the manga of the same name, which also saw two anime movie adaptations close to its release. The player character, Taison Maeda, is a delinquent student who is training to be a professional boxer. He has a reputation as a powerful fighter among delinquent gangs as a result, though despite being violent he has a code of honor. \n \nThe Famicom and Super Famicom versions of the game are subtly different due to console differences, but both share their genre, developer and publisher. The Famicom game was released in October 1993, with the Super Famicom version following in April 1994. \n \nCharacters from this game have appeared in Jump crossover games, specifically Famicom Jump II and Jump Ultimate Stars.", "id": 48820, "name": "Rokudenashi Blues"}, {"genres": [31], "summary": "Once upon a time. On a world far beyond imagining. Six great owls brought forth a land called Owlia. Together, they reigned in peace and wisdom for eighty thousand years. However, their pride in the beautiful land and sky of Owlia led them to forget the vast vast seas... Mermon, King of the Mermen, oft rose to the surface to view the Land of Owlia. His desire for sunlight, sky, and green forests grew until he decided the seas were not enough for him. He endeavored to summon the six great owls one by one. He began sapping their powers of flight, empowering his minions to float towards the Land of Owlia to claim it for his own. However, one great owl eluded him.. Silmaran, the White King. Soaring high above the Land of Owlia, as Mermon's forces grew in power, he searched for one who might heed his call to rescue the great owls and restore the Land of Owlia. \n \nGuide heroine Adlanniel and her owl friend Tyto to free the great owls and defeat Mermon king of the Mermen!! \n \n-12 enemy types and 5 fierce bosses! \n-7 full scrolling overworld maps! \n-5 screen by screen dungeons filled with puzzles! \n-8 cool techniques for your Owl Tyto to perform! \n-Slash enemies with your trusty sword! \n-Password system to save your progress!", "id": 48936, "name": "Legends of Owlia"}, {"genres": [31], "summary": "The third and final Yamamura Misa Suspense game, published for the NES in 1990. \n \nYamamura Misa Suspense: Kyouto Zaiteku Satsujin Jiken is the third and final Japanese murder-mystery game in the Yamamura Misa Suspense series of video games developed for the Nintendo Entertainment System by TOSE and published by HectorSoft in 1990. The player takes the role of a detective as they attempt to solve a murder case by travelling across a city, interrogating suspects and witnesses. Gameplay mostly comprises of selecting actions through menus or selecting items shown on screen to interact with similar to many point-and-click adventure games.", "id": 48869, "name": "Yamamura Misa Suspense: Kyouto Zaiteku Satsujin Jiken"}, {"genres": [9], "summary": "Jack the duck is no ordinary quacker. He is witty and rather clever, but this is not enough to get his precious egg to safety. He needs your help and ingenuity to get through the 20 mind-boggling mazes! Beware of the hidden dangers: the foxes, the traps. But most of all, let those sleeping bulldogs lie. Start your adventure in level 1 and challenge your way through to level 20, or if you are feeling vigorous, go straight into a higher level. But whatever you do, DON'T CRACK THE EGG!", "id": 48132, "name": "Duck Maze"}, {"summary": "The South Pacific contains some of the most beautiful islands in the world, and they have all been invaded by a terrorist organization called DAMED (Destructive Armed Militant Enemy Devotee). You must fly an experimental fighter jet called the Thrasher Hawk-7 to battle the enemy and rid them from nine different islands. To help out, six different power ups can be collected after destroying certain enemies which provide better weapons, bombs, or extra lives.", "id": 48136, "name": "Double Strike"}, {"genres": [10], "summary": "You've never experienced anything like the incredible action of MONSTER TRUCK RALLY! Compete against the computer - or against up to three of your friends at once - in nine grueling, gear-grinding events: hill climb, drag race, car crush, sled pull, monster rally, drawbridge, donuts, tug-o-war, and bog! Whether you build your own custom course, or have the computer build one for you randomly - out of millions of possible combinations - every event is sure to be an awesome new challenge, every time!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hqw069hrpvgqntlaw3ps.jpg", "width": 1533, "cloudinary_id": "hqw069hrpvgqntlaw3ps", "height": 2100}, "id": 48199, "name": "Monster Truck Rally"}, {"genres": [14], "summary": "Theodore \"Todd\" Thornley IV has had enough. After being humiliated once again by his rival, Jeff \"Crash\" Cooney and his blue-collar buddies from Southside High School at the All-City Track Meet, he has decided to issue a challenge to Crash. Inviting two of the other elite high schools to participate in the challenge, plus an additional team sponsored by his wealthy father, Todd has seemingly stacked the deck against Crash and his boys. The game has four different teams to choose from, as well as a fifth computer-controlled team. Each team have five members each with their own strengths and weaknesses, making some better suited to certain events than others. Before each event, players have the opportunity to go shopping in the mall to buy power-ups for their characters. These items are paid for through the various medals that each team achieve as they progress through the challenge, but since the winner of the challenge is the team that collects the most medals overall, players must be fairly judicious in how much they spend. There are two types of events in the game: individual events (Hammer Throw and Roof Top Jumping) and head-to-head events (400 Meter Hurdles, Swimming and Fighting). In individual events, each team takes turn individually and ranking is determined by who gets the most points. The head-to-head events take place under a single elimination tournament format, in which one player against another in a series of heats. The player who successfully defeats both of his opponents will get to compete against a member of Team Thornley for first place. The game can be played by up to four players. Since there's never more than two teams competing at the same time, the third and fourth player can play simply by alternating between the two controllers. Thus, a four player adapter is not required, unlike other Kunio-kun games.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/j9efhrdgwbvpuz6dl8x4.jpg", "width": 1280, "cloudinary_id": "j9efhrdgwbvpuz6dl8x4", "height": 720}], "id": 48291, "name": "Crash 'n' the Boys: Street Challenge"}, {"genres": [8], "summary": "Cancelled. \n \nIn the single-player side-scrolling action game the player controls a California Raisin through five stages in an effort to rescue the band and their band's musical notes that were stolen by the gang of jealous musicians. The player walk, jump, climb on vines, moonwalk (by pressing the \"select\" button) and shoot an unlimited supply of grape jelly beans as projectiles. As was the case with other Capcom games, such as Mega Man and DuckTales, one can play the first four levels in any order that you want, but the final level is only available after you have collected the musical notes from each of the four levels. \nThe first four levels include The Grape Vine, The Factory, The Maize Maze and The Juicery. The final level takes places in The Clouds. During each level you can collect 'I' icons that give you temporary invincibility, regular black musical notes for bonus points, 'Sunshine' icons to restore your health, and 'Raisinette' icons to give an extra life to the player. One can also locate items by shooting at the thin air or at columns.", "id": 48702, "name": "The California Raisins: The Grape Escape"}, {"summary": "Sakigake takes place at a school called Otokojuku, which is a private boy school that teaches Oendan to student delinquents. Oendan is basically a cheering squad that is somewhat similar to cheerleaders, except they focus mostly on noise and atmosphere than being acrobatic. The school is run by the principal Heihachi Edajima, who uses martial arts to train his students to be better people for society.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/cmfivc9zhswagsvzxwxb.jpg", "width": 1190, "cloudinary_id": "cmfivc9zhswagsvzxwxb", "height": 831}, "id": 48674, "name": "Sakigake!! Otoko Juku: Shippuu Ichi Gou Sei"}, {"genres": [14], "summary": "A Famicom game developed by Bandai as part of their Family Trainer series, which all use the Family Trainer (Power Pad) accessory. The goal is to explore mazes. \n \nThe fifth in Bandai's series of Family Trainer games, created for the accessory with the same name (or Power Pad in the US). Unlike the others, which tended to be athletics/exercise games, Meiro Daisakusen (\"Epic Maze Battle\") is a maze-exploring light RPG where the goal is to walk and jump around mazes to find items and, eventually, the exit. \n \nThe game's controls are dictated entirely by the Family Trainer/Power Pad. Different buttons will either cause the protagonist to jump, walk forward, walk backwards, turn left or right or switch their position to the left, right or center of the screen. While searching for the exit, players must be mindful of the various enemies that also inhabit the mazes, most of which must be avoided by jumping over them or running past them.", "id": 48764, "name": "Family Trainer: Meiro Daisakusen"}, {"genres": [12], "summary": "Dragon Ball Z III: Ressen Jinzou Ningen is the sequel of Dragon Ball Z II: Gekishin Freeza. The game starts off in the Frieza Saga as Super Saiyan Goku fighting Frieza, and it ends in the Imperfect Cell Saga in the battle of Piccolo against Imperfect Cell. The game also features characters from the movie Dragon Ball Z: Cooler's Revenge.Is the first game in the Gokuden series where power levels are not stated. Its sequel in the series is Dragon Ball Z Gaiden: Saiyajin Zetsumetsu Keikaku.", "id": 48680, "name": "Dragon Ball Z III: Ressen Jinzou Ningen"}, {"genres": [8], "summary": "Experience the majestic birth and childhood of Christ as you proclaim His honor and endevor to experience the prophecies. Collect gifts for Baby Jesus; escape to Egypt to avoid the wrath of King Herod; and search for young Jesus in the holy city of Jerusalem. Test your Bible skills by answering scores of Bible questions designed to compliment the game play.", "id": 48148, "name": "King of Kings: The Early Years"}, {"genres": [8], "summary": "California, 1938. It had been one heck of a week for ace air racer and stunt pilot Cliff Secord, a week that had drastically changed his life. After his stunt plane was wrecked accidentally in a shootout between a couple of thugs and G-Men, the hoods had stashed an amazing stolen device in his cockpit. It didn't take long to figure out it was a rocketpack. And it took even less time for Cliff to become a target for half the city. The hoods wanted the stolen device back. So did its inventor, the famous, but eccentric American industrialist, not to mention the FBI, the U.S. Army, and the most menacing force of all, the Nazis! Even famous film star Neville Sinclair wanted the rocketpack. He had kidnapped Cliff's girlfriend, the gorgeous Jenny Blake, and was offering to exchange her for the device. Cliff had no time to ponder his desperate situation. There was only one course of action; he must become THE ROCKETEER!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ecutrspmjci4sarigp6k.jpg", "width": 1515, "cloudinary_id": "ecutrspmjci4sarigp6k", "height": 2100}, "id": 48205, "name": "The Rocketeer"}, {"genres": [8], "summary": "Neverland. That magical island where dreams come true and children never get old. Home to mythical tree fairies and beautiful mermaids. The most wonderful place in the whole world. \"Wonderful, indeed,\" thought Captain Hook, the wickedest pirate on the seven seas, \"but not for long! When my crew of cutthroats is done ravaging the island, Neverland will be mine at last. Then, I'll have my revenge on that litttle pest Peter Pan!He'll walk the gangplank before I'm through!\" Now you can help Peter Pan rid Neverland of the evil pirates and destroy Captain Hook once and for all! But hurry! There's no time to lose!", "id": 48189, "name": "Peter Pan & The Pirates"}, {"genres": [8], "summary": "Wagyan Land is an Action game, developed by Now Production and published by Namco, which was released in Japan in 1989.", "id": 48550, "name": "Wagyan Land"}, {"genres": [9], "summary": "The game is a simple card game with a Tetris element. The layout is similar to a Tennis court with both players on either sides defending their goal, while stacks of cards are positioned in the center. Players must move Shin up and down sliding cards, in two's, to the center pile matching up symbols and push each stack back to the opponent's side in an attempt to over take their goal.", "id": 48533, "name": "Crayon Shin-Chan: Ora to Poi Poi"}, {"genres": [14], "summary": "Best Keiba Derby Stallion (\"Best Race Derby Stallion\") is a simulation game where the player has a stable and starting money and must raise champion racehorses. As well as training horses, they can breed them and, eventually, sell them once they grow too old to race. The player can also hire jockeys to ride their horses for races, and can gamble on races to earn a little extra funds. \n \nBest Keiba Derby Stallion began a long-running Derby Stallion franchise that persists to the present. It was only released in Japan.", "id": 48724, "name": "Best Keiba Derby Stallion"}, {"genres": [31], "name": "Conquest of the Crystal Palace", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mjnvaps6sgl3svhsf6jc.jpg", "width": 1534, "cloudinary_id": "mjnvaps6sgl3svhsf6jc", "height": 2100}, "summary": "Return to the once beautiful Crystal Palace where your father's kingdom was brutally overthrown by Zaras, king of the infernal plateau. Call upon your guardian dog. Zap and battle your way through the peaks of Mount Crystal. Find Kim at the astral-mart, she will help you along your way with tools and food needed to make this awesome journey. Step into the Realm of the Guardian, the walkway to impending doom. Acid rain is forecasted by QNN... so keep your eyes on the road ahead. Beware! You will fight the biggest, meanest enemies ever seen on the NES! Investigate the Lair of Hungry Ghosts, gather special weaponry and gold. Enter the Gateway of Flame. Look out! The pathway has disappeared and there's only a moment between you and a sea of lava. These tasks and much more must be accomplished if you wish to regain your rightful throne!", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/i2xq9dgksrlshwp6jvgb.jpg", "width": 1280, "cloudinary_id": "i2xq9dgksrlshwp6jvgb", "height": 720}], "id": 48068}, {"genres": [9, 15], "summary": "YOU AND MARIO MAKE QUITE A PAIR. Especially when you're battling the common enemy: Bowser. \n \nSeems Bowser's sneaky Koopas have been, throughout time, stealing objects belonging to famous people who, without these valuable objects, wouldn't have been able to help and inspire mankinds. \n \nBut Mario is on to Bowser and his crew. He's persuaded the greatest minds in the world to build him a time machine - so that you and he can go anywhere in the world, during and century, in order to find those precious objects and return them to their rightful owners. \n \nYou'll visit Cleopatra in the Alexandria of 48 B.C., Plato in the Athens of 369 B.C. and even Thomas Edison in New Jersey in 1879. \n \nSo get ready for an incredible, easy-to-take adventure. Not only will you help the human race, but you'll meet the most famous people who ever lived. And you'll travel all over the globe and back, back, back into history. WHAT A TRIP! \n \nGrab your backpack for the learning adventure of your life!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fsaxsu3xpvlnuqfmooeo.jpg", "width": 1533, "cloudinary_id": "fsaxsu3xpvlnuqfmooeo", "height": 2100}, "id": 48133, "name": "Mario's Time Machine"}, {"genres": [14], "summary": "Darts is one of the most popular leisure games of all time. MAGIC DARTS has tournament style action which brings the excitement of real competition into your home. Up to four players can compete using standard NES® controllers. Get yourself on target and play MAGIC DARTS.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/itizydjvl6niltuvmlqq.jpg", "width": 1542, "cloudinary_id": "itizydjvl6niltuvmlqq", "height": 2100}, "id": 48182, "name": "Magic Darts"}, {"genres": [5], "summary": "It's the year 2029 and humanity faces certain extinction! An alien force led by the Supreme Commander Vile Malmort is positioned to destroy the earth. \nThe President had little time to act. He assembled the greatest scientists from around the globe to stop this menace. From their laboratory came mankind's last hope - the members of S.C.A.T. \nThe Special Cybernetic Attack Team has one goal: the utter destruction of the alien fleet. \"They've sent an armada to conquer us. We've sent two warriors from S.C.A.T... It should be a fair fight.\"", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/m5hpqn1mki1xqmj02dft.jpg", "width": 1533, "cloudinary_id": "m5hpqn1mki1xqmj02dft", "height": 2100}, "id": 48202, "name": "S.C.A.T.: Special Cybernetic Attack Team"}, {"genres": [5], "summary": "Your ship is equipped with both a standard laser and an independently fired ground weapon, which you must coordinate to defeat ground and aerial enemies. A shield bar keeps track of your damage and you can replenish it by defeating certain enemies, but otherwise its just you, your ship and several stages of alien enemies that alternate between top-down and side-scrolling perspectives.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mtk1ucr7y2wonxwtzwry.jpg", "width": 1548, "cloudinary_id": "mtk1ucr7y2wonxwtzwry", "height": 2100}, "id": 48238, "name": "Starship Hector"}, {"summary": "Captain Tsubasa II: Super Striker is a Soccer Sim game, developed and published by Tecmo, which was released in Japan in 1990.", "id": 48705, "name": "Captain Tsubasa II: Super Striker"}, {"summary": "Brush Roller is a clone of Make Trax (an arcade game by Kural Samno in 1981) made by Hwang Shinwei in 1990. This game can often be found on multicarts and was sold in Brazil as a stand-alone cart by CCE.", "id": 48658, "name": "Brush Roller"}, {"genres": [9], "summary": "The point of this game is to match a line of three or more gems, using columns of three pieces falling into the playing field, similar in mechanics to the Sega game Columns. Its background design is strongly inspired by New York City and has a depiction of the Statue of Liberty appearing on the right side of the screen.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/uazdsju0l3rhlbgyodef.jpg", "width": 1440, "cloudinary_id": "uazdsju0l3rhlbgyodef", "height": 1080}], "id": 48670, "name": "Magical Jewelry"}, {"genres": [8], "summary": "In the year 2193, '\"Dinosaur\" becomes a popular subject again. Scientists all work for making dinosaur revive. 'Nevertheless, they still lack of a special gene. This causes the dinosaurs they cultivate are all incomplete. 'Many countries then intend to buy dinosaurian fossil at high prices in order to get the gene. 'But it seems that it's not so easy. 'No one can do anything to this problem until Dr. Crachi invents a \"Time Space\" machine in the year 2197.", "id": 48578, "name": "Jurassic Boy 2"}, {"genres": [14], "summary": "Best Play Pro Yakyuu Special is a Sports game, developed and published by ASCII Entertainment, which was released in Japan in 1992.", "id": 48545, "name": "Best Play Pro Yakyuu Special"}, {"summary": "A 1992 Famicom game published by Yutaka based on the Minky Momo magical girl anime. \n \nMahou no Princess Minkiimomo Remember Dream is a Miscellaneous game, developed by Bits Laboratory and published by Yutaka, which was released in Japan.", "id": 48786, "name": "Mahou no Princess Minkiimomo: Remember Dream"}, {"genres": [12], "summary": "A ninja-themed RPG by Jaleco for the NES. A US release was planned, but canceled. \n \nJajamaru Ninpou Chou is part of Jaleco's Ninja Jajamaru-Kun series. Jajamaru-Kun (sometimes spelled JaJaMaru-Kun) is the younger brother of the original Ninja-Kun, who starred in a couple of UPL arcade games known in the west as Ninja-Kid and Ninja-Kid 2. When Jaleco ported the original arcade game to NES, they created the character of Ninja Jajamaru-Kun and continued making games that featured the character. Jajamaru Ninpou Chou is his third Famicom game. \n \nHowever, unlike the two previous Ninja Jajamaru-Kun games, which were action platformers, Ninpou Chou is a traditional JRPG. The player walks around a world map visiting towns and dungeons and occasionally fighting random encounters using a separate turn-based combat screen. \n \nWorth noting is that this game was slated for a 1990 US release with the name Taro's Quest, though it was later canceled. However, an incomplete prototype version of the ROM exists. As well as an English localization, the game appeared to have had its graphics almost entirely redrawn in order to appear more realistic than the cartoonish original.", "id": 48882, "name": "Taro's Quest"}, {"genres": [31], "summary": "The second in the Yamamura Misa Suspense series of murder mystery adventure games. It was published by Taito for the Famicom in Japan only. \n \nYamamura Misa Suspense: Kyoto Hana no Misshitsu Satsujin Jiken is the second game based on the work of Japanese mystery novelist Misa Yamamura (the first being Yamamura Misa Suspense: Kyouto Ryuu no Tera Satsujin Jiken) and, like the first, concerns a murder in the picturesque Japanese city of Kyoto. \n \nAs with the first game, and conversely to other Famicom adventure games around at the time, Hana no Misshitsu Satsujin Jiken has a dynamic bar of commands the player can perform; it changes to reflect what actions are currently possible for the player character in that area, so that they don't waste too much time trying every action in every location to find the next clue. These actions are also represented with symbolic icons, rather than typed out as words.", "id": 48871, "name": "Yamamura Misa Suspense: Kyouto Hana no Misshitsu Satsujin Jiken"}, {"genres": [9], "summary": "Now everyone’s favorite TV Game Show is just for kids! It’s got all the excitement of the adult version… everything you see on TV and more, But the puzzles have been created just for the younger player. \n \nIt’s your turn to be the contestant. Compete against your friends or match wits with the computer. Press the button, hear the theme music, spin the wheel, solve the puzzle and win a fortune, or hit bankrupt and lose it all. There are over 1000 puzzles to keep you guessing, and if you’re stuck you can always buy a vowel. It’s time to play WHEEL OF FORTUNE!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gza4dpkcvtdg5uhp5xxq.jpg", "width": 1529, "cloudinary_id": "gza4dpkcvtdg5uhp5xxq", "height": 2099}, "id": 48094, "name": "Wheel of Fortune: Junior Edition"}, {"summary": "Your shuttle commander has been trapped in a dimensional maze in space, and you must use your glove to throw an energy ball at the walls in order to advance. \n \nThe walls in each maze room you encounter are filled with blocks. Using your Power Glove, you have to entirely break down a wall before being allowed to advance to the next room.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p4yuch2u6lneqtfuchxg.jpg", "width": 1524, "cloudinary_id": "p4yuch2u6lneqtfuchxg", "height": 2100}, "id": 48234, "name": "Super Glove Ball"}, {"genres": [8], "summary": "Revived by his girlfriend's grief and a flash of lightning, Rick must chase down the Pumpkin king and save his beloved Jennifer once and for all! A parody of the bloody horror beat-'em-up Splatterhouse, Wanpaku Graffiti assumes a much cuter appearance but retains the same fast-paced action of the original.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ti0dyszfm6eum0p3pcfz.jpg", "width": 1275, "cloudinary_id": "ti0dyszfm6eum0p3pcfz", "height": 826}], "id": 48653, "name": "Splatterhouse: Wanpaku Graffiti"}, {"genres": [14], "summary": "There are three difficulty levels and the game is almost completely in Japanese. There are also three modes: leaderboard (similar to major PGA events), tournament (using a format found in most sports playoffs), and stroke play. Players have a crowd to play their round of golf into front of.", "id": 48483, "name": "The Golf '92"}, {"summary": "A group of astronauts from Japan accidentally free Bandora and her gang while exploring Nemesis. Baaza, who had been watching over the sleeping volunteers, sees Bandora and her minions terrorizing the people, and awakens the five warriors placed to sleep 170 million years ago to fight Bandora with the power of the Guardian Beasts as the Kyouryuu Sentai ZyuRanger.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/eyzvefq5zi7i65cgu5hm.jpg", "width": 2097, "cloudinary_id": "eyzvefq5zi7i65cgu5hm", "height": 1450}, "id": 48437, "name": "Kyouryuu Sentai Zyuranger"}, {"genres": [12], "summary": "Karakuri Kengoden Musashi Lord: Karakuri Jin Hashiru! is a Role-Playing game, published by Yutaka, which was released in Japan in 1991.", "id": 48442, "name": "Karakuri Kengoden Musashi Lord: Karakuri Jin Hashiru!"}, {"genres": [4], "summary": "Unlicensed fighting game by Caltron for the Famicom. Tony must fight his way around the world to prove he is the greatest world warrior, the Dream Fighter!", "id": 48365, "name": "Dream Fighter"}, {"genres": [8], "summary": "Tiger Jenny is a NES game set in the same universe as \"Ittle Dew\" it takes place a thousand years before the events of that game. \nBattle your way through the forests to seek vengeance on the Turnip Witch who dwells in her castle. \n \nNote that this game actually runs on the real hardware, it's not just an imitation. \nTherefore the release is in nes rom format so you'll need an emulator to play it.", "id": 48337, "name": "Tiger Jenny"}, {"summary": "Don't let the name fool you - Pinball Quest is much more than video pinball. In fact, it's the first-ever multi-screen fantasy in a pinball format! Every move you make tells a story; every shot takes you another step closer in your quest to rescue the captive princess of the castle. Along the way you'll meet ghosts, goblins, witches and demons, in an endless labyrinth of treacherous passages and deadly doorways. It takes a fearless heart and a fast mind to conquer Pinball Quest. It also takes the skills of a true pinball wizard... which you can hone on the three other video pinball games included on this cartridge! So before you pour any more money into your NES library, get the one title that's a library all by itself! No matter how hard you try, you can't get enough of Pinball Quest!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/afyhyz9hccqdbk5gs46e.jpg", "width": 1000, "cloudinary_id": "afyhyz9hccqdbk5gs46e", "height": 1442}, "id": 48026, "name": "Pinball Quest"}, {"genres": [14], "name": "All-Pro Basketball", "videos": [{"video_id": "UOJELHuBtag", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/s1l8xlyp8bxluntedkqr.jpg", "width": 1064, "cloudinary_id": "s1l8xlyp8bxluntedkqr", "height": 1531}, "summary": "All-Pro Basketball is a Nintendo Entertainment System game that simulated the game of basketball. The player could choose between eight different teams, completing individual matches. No seasonal play was available. The game was developed by Aicom.", "storyline": "Five teams face off in a fictional professional basketball league. Four modes of gameplay are available: single player match; co-op, where two players control the same team; versus, where two players compete against each-other controlling different teams; and watch, where the player is given the opportunity to watch a computer-controlled match.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ktpgneqqj2vneqrqfp7p.jpg", "width": 256, "cloudinary_id": "ktpgneqqj2vneqrqfp7p", "height": 232}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/j1a4qpp39bcaq0dkfnkr.jpg", "width": 256, "cloudinary_id": "j1a4qpp39bcaq0dkfnkr", "height": 232}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nom76jkoqby6ysm6girw.jpg", "width": 256, "cloudinary_id": "nom76jkoqby6ysm6girw", "height": 224}], "id": 8909}, {"summary": "One thousand years ago, on the equinox of the new star of Tritan, the golden crown of Polaris was stolen. And so it has been every 100 years, no matter what precautions were taken, no matter where the treasure was hidden, when the Star of Tritan appears, another treasure disappears. With the spirit of the seven seas to guide him, King Neptune must find the 8 stolen treasures and return the orb of peace to his undersea kingdom!", "id": 48149, "name": "King Neptune's Adventure"}, {"genres": [14], "summary": "The hottest pinball game ever has been converted to video! All the action and excitement of the original HIGH SPEED is here - Freeway Frenzy, Ramp Race and Running the Red - plus excellent new features like Lightning Bombs and attacking enemies! It's a real-life adventure. The screen flashes and a siren shrieks when you run the red light! Police car radio messages and original chase music both add to the thrills. Go for the burn - grab the jackpot and get away at HIGH SPEED!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/srynbc6e9mdmzvkusxk3.jpg", "width": 1521, "cloudinary_id": "srynbc6e9mdmzvkusxk3", "height": 2100}, "id": 48156, "name": "High Speed"}, {"genres": [10], "summary": "Drivers earn thousands of dollars by competing in hydroplane races, setting track records, rescuing stranded people, and collecting cash bonuses. With these winnings they can repair or upgrade various components of the hydroplane to improve racing performance and remain competitive in the increasingly-difficult races. Eliminator Boat Duel offers three difficulty levels: Easy, Normal, and Expert. Completing a race at a lower difficulty level advances the player to the next higher one. At each difficulty level, the player's hydroplane can be damaged from impact with animals, the opponent's hydroplane, and various stationary objects. A false start is penalized with a $2,000 fine. For most of a race, players control their hydroplanes from a bird's-eye view, and the screen scrolls in multiple directions; but in one segment of the race, the graphical perspective changes to a third-person tracking mode. In a single-player game, the player competes first with Seasick Sidney (in Easy mode), with Aquarius Rex (in Normal mode), or with Surfer Bob (in Expert mode). The player then competes against Vicious Vicky, Weird Willy, Mangler Mike, Veronica Alabaster, and Disaster Don (the reigning World Champion), respectively. To win, the player must defeat each opponent one-against-one on three unique race courses. Eliminator Boat Duel has 24 unique race courses.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/drwm2r7ztjfaavj1kd8f.jpg", "width": 1539, "cloudinary_id": "drwm2r7ztjfaavj1kd8f", "height": 2100}, "id": 9158, "name": "Eliminator Boat Duel"}, {"genres": [31], "summary": "Linus needs your help! He has no money, no car and no respect from his fellow Linomen! The trouble is, no one believed his tale of discovering a far away planet called \"Earth\" so it's your job to help him get back there and take some handy snaps!", "id": 48185, "name": "Linus Spacehead's Cosmic Crusade"}, {"genres": [13], "summary": "The StudyBox, released by Fukutake Publishing Co, Ltd., was much like a tape player for the Famicom. The accessory was small enough to fit on top of the Famicom, to plug into the connector. Also like a tape player, the top of the StudyBox would open to reveal the compartment where tapes were played. \n \nThe StudyBox itself did not have the standard Play, Stop, Pause, Fast Forward and Rewind buttons on the system, as would be expected with a tape player. Instead, the student (presumably) would use the Famicom controller and on-screen cues to play the tapes. \n \nWe don’t exactly know what the tapes would do. The purpose of the StudyBox was to make the Famicom more educational, giving students the ability to learn about whatever information was contained on the tapes. The tapes were, of course, only sound and voice, without visuals to accompany the studying.", "id": 48908, "name": "Famicom Study Box"}, {"genres": [14], "summary": "Terao no Dosukoi Oozumou is a Sports game, developed by TOSE and published by Jaleco Entertainment, which was released in Japan in 1989.", "id": 48388, "name": "Terao no Dosukoi Oozumou"}, {"summary": "Pitfall Harry returns to adventuring in this \"Super\" sequel to Pitfall! and Pitfall II: Lost Caverns. Harry’s mission: to recover the famed Raj Diamond, and also to rescue his niece Rhonda and loyal lion sidekick, Quickclaw. \n \nNow armed with a gun, Harry must navigate some 270 screens of 8-bit action-platforming. Valuable items will be collected along the way to aid your quest, but beware: dangers also abound, from snakes and spiders to falling rocks and boiling lava!", "id": 48233, "name": "Super Pitfall"}, {"genres": [9], "summary": "Auto-Upturn is a Puzzle game, developed and published by Sachen, which was released in Asia in 1991.", "id": 48692, "name": "Auto-Upturn"}, {"genres": [12], "summary": "In the kingdom of Palmeccia both the King and Queen have been murdered by the hands of a servant of Ragon, son of the Zuhl. Take control of the Prince of Palmeccia in a quest for revenge and to kill the evil Ragon.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/vsyabrckoxltpg22ayi3.jpg", "width": 1000, "cloudinary_id": "vsyabrckoxltpg22ayi3", "height": 1372}, "id": 48687, "name": "Minelvaton Saga: Ragon no Fukkatsu"}, {"genres": [12], "summary": "The game is set in a decadent cyberpunk-style future world in which everyone has extrasensory perception. These powers can also be used by the player characters when they confront the various monsters in the game through combat. The eventual target of the game is to defeat the villains. In order to accomplish this, the player's characters must go to the Ark City and eventually to outer space. Unlike the Final Fantasy series, the game does not give the player an automatic \"game over\" when it is impossible to win the battle. This makes it possible for players to accidentally walk into a walking dead situation every time they are forced to do battle with the game's monsters.", "id": 48645, "name": "Stargazers"}, {"genres": [9], "summary": "Parallel World (ぱられるワールド?) is a puzzle video game developed by EIM and published by Varie. It was released in Japan for the Family Computer on August 10, 1990. \n \nThe player and his girlfriend must find their way back home after being sucked into an alternate universe. \n \nA magnificent castle full of 25 different game worlds block their progress, however, and they are filled with enemies on every stage. The player has an overhead view to destroy the enemies for extra loot. Given a strict time limit of 100 seconds to solve each puzzle, the game rewards fast puzzle solvers. The first player controls the male while the second player controls the female. Players only start with three lives and lose them when time runs out or when a monster comes into contact with him/her. \n \nEnemies in the game include springs, rollers, witches, and zombies.", "id": 48348, "name": "Parallel World"}, {"summary": "Go! Benny! is an Action game, developed by Mega Soft and published by NTDEC, which was released in Asia in 1992.", "id": 48321, "name": "Go! Benny!"}, {"genres": [15], "summary": "President no Sentaku is a Strategy game, developed by Another and published by Hot-B, which was released in Japan in 1990.", "id": 48828, "name": "President no Sentaku"}, {"genres": [12], "summary": "Niji no Silkroad (虹のシルクロード?, \"Rainbow Silkroad\") is a role-playing video game for the Japanese version of the NES, the Famicom. It was developed by NHK and published by Victor Interactive Software (now Marvelous Entertainment) in 1991. The game was only released in Japan. \n \nThe player controls the main protagonist, an exiled prince of LittleLand that has been recently informed of his royal heritage. To reclaim the throne, the prince must collect seven shards of the Rainbow Mirror and defeat the usurper, Zrool. The shards are scattered throughout South Asia and the prince must trade goods to make his way to each region. Once the mirror is collected, the prince shines it at Zrool and exposes the imposter. The prince then takes his throne as the new king.", "id": 48409, "name": "Niji no Silkroad"}, {"genres": [9], "summary": "Big TV Mary Bar is a Famicom game based on the Taiwanese \"Xiao Ma Li\" gambling machines in 1989. It is well-known for featuring Fortran (who is based strongly on Mario) and the phrase \"Push Start To Rich\". \n \nThe objective of the game is to gain as many credits as possible, mainly through betting on the numerous icons you'd find on a slot machine.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lvnnh55jrwqongsz6st6.jpg", "width": 1734, "cloudinary_id": "lvnnh55jrwqongsz6st6", "height": 800}, "id": 48324, "name": "Big TV Mary Bar"}, {"genres": [15], "summary": "The Gorilla Man is a Miscellaneous game, developed by Pixel and published by Yonezawa PR21, which was released in Japan in 1993.", "id": 48760, "name": "The Gorilla Man"}, {"genres": [15], "summary": "A strategy game released in Japan on December 18th, 1992. \n \nUsed in conjunction with the Barcode Battler II peripheral, Barcode World made a strategy game out of scanning a large number of Japanese consumer products.", "id": 48725, "name": "Barcode World"}, {"genres": [12], "summary": "LaSalle Ishii no Child's Quest is a Role-Playing game, developed and published by Namco, which was released in Japan in 1989.", "id": 48792, "name": "LaSalle Ishii no Child's Quest"}, {"genres": [5], "summary": "The most happening place in the universe is the trendy, upscale solar system of IOTA Synthetica, part of the Galactic Federation of artificial stars. It's as far from dirty old Earth as can be... But don't sign up to go yet! A strange cosmic energy field with a major attitude has engulfed the system, and the most outrageous things are happening. Ordinary inanimate objects are coming to life - harmless little animals are becoming rabid giants - and the freaked-out residents are under attack! The only Galactic Commander who can handle this ordeal is the eccentric renegade called Gun-Nac. He can oust this aura that's threatening the destruction of comfortable artificial life as we know it. But where in the universe is he? He could be as far away as Earth, searching for a new Game Pak. Commander Gun-Nac, if you read this, call H.Q., A.S.A.P., O.K.? We N.E.E.D. you!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jbjwvtk7ic4q5nhpkcgd.jpg", "width": 1537, "cloudinary_id": "jbjwvtk7ic4q5nhpkcgd", "height": 2100}, "id": 48935, "name": "Gun Nac"}, {"genres": [8], "summary": "Take an adventure in the world of Candelabra! \n \nThe evil summoner Amondus from The Order of the Talon has taken over Prim, Hekl's once happy homeland. And nothing drives a wizard more crazy than having their territory trampled on! \n \nCan you help Hekl defeat the enemies that Amondus has populated throughout the landscape? To do so, you will need to master the art of levitation, find magic spells that will assist you in reaching new areas, and upgrade your weapons. All of these will be necessary in order to give Hekl the power he needs to restore peace to Prim. Do you have what it takes? If you dare, venture into this, the first installment of the Candelabra series!", "id": 48912, "name": "Mad Wizard: A Candelabra Chronicle"}, {"genres": [14], "summary": "Vegas Connection: Casino Kara Ai o Komete is a Miscellaneous game, developed by Graphic Research and published by Sigma Ent. Inc., which was released in Japan in 1989.", "id": 48872, "name": "Vegas Connection: Casino Kara Ai o Komete"}, {"genres": [14], "summary": "Casino Derby (カジノ・ダービー) is a game, developed by Outback and published by Party Room 21, which was released in Japan in 1993 for the Nintendo Famicom.", "id": 48720, "name": "Casino Derby"}, {"genres": [5], "summary": "A sci-fi Light Gun game from Bandai that came packaged with the Hyper Shot Light Gun for the Famicom. \n \nSpace Shadow is an on-rails sci-fi Light Gun game from Bandai that takes its inspiration from the claustrophobic killer aliens movie Aliens. The player walks down an octagonal hallway and shoots any hostile extra-terrestrial life that bursts forth from one of the side-passages or the ceiling. \n \nSpace Shadow was the pack-in game for the Bandai Hyper Shot, a sub-machine gun shaped Light Gun for the Famicom. Despite the fact that Light Gun games tended to do far better in the US, neither the Hyper Shot nor this game were ever released outside of Japan.", "id": 48841, "name": "Space Shadow"}, {"genres": [31], "summary": "A magic red jewel, known as the Arumana, is stolen from an unnamed village. A thief runs off with the jewel and turns the entire village into stone. The game's hero must track down the thief and recover the stolen jewel.The player takes the role of a hero named Kaito, who bears a remarkable resemblance to Indiana Jones, and must travel through six cavernous levels in search of the stolen jewel, Arumana. The player begins with thirty throwing knives as his weapon of attack. As they venture through the levels they can find various other weapons. These include bombs, a handgun, bolas, a crystal ball that destroys everything on screen, and mines. He must destroy various cave dwelling creatures as well as soldiers, who sometimes drop weapons.The game itself is very reminiscent to Indiana Jones and the Temple of Doom. The appearance of Kaito is not only nearly identical to the series' adventurer, but the game's cave environments and plot, which revolves around the main character recovering a jewel that grants life to a village, are very similar to his explorations. The game also borrows heavily from an earlier Konami release, Roc 'N Rope, with the main character firing ropes at platforms to cross wide chasms.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/zp2fsbc8koknox87fmjy.jpg", "width": 1280, "cloudinary_id": "zp2fsbc8koknox87fmjy", "height": 720}], "id": 48865, "name": "Miracle Of Almana"}, {"genres": [8], "summary": "If you like Korean Famicom games, this one should be right up your alley. It's made by some of the guys who went on to form Open Corp (the team that made Buzz & Waldog), and that game's DNA is really obviously present in this one - those same sound effects ripped off from Tiny Toon Adventures, a similar aesthetic, etc. In a lot of ways this game is simpler, but in many others it's actually a way more ambitious game, complete with a shop system, minigames, lots of character upgrades, etc. The ROM size is even twice that of Buzz & Waldog!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uya7ktlqjvrstueb9xt6.jpg", "width": 1391, "cloudinary_id": "uya7ktlqjvrstueb9xt6", "height": 1701}, "id": 48898, "name": "Magic Kid Goo Goo"}, {"genres": [9, 31], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/qxomfkv1idhq3j9tktag.jpg", "width": 1000, "cloudinary_id": "qxomfkv1idhq3j9tktag", "height": 1020}, "id": 36582, "name": "Infiltrator II"}, {"genres": [5, 10, 33], "summary": "Overhead run'n gun-style shoot-'em-up. You play as jeep driver and gunner rescuing POWs.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ak5dwlj6izs0dlaoias8.jpg", "width": 1000, "cloudinary_id": "ak5dwlj6izs0dlaoias8", "height": 1413}, "id": 17477, "name": "Jackal"}, {"genres": [4, 14, 33], "summary": "You are challenged to match the awesome skills of your opponents...to gain the Title in the World Super Championships of TAG TEAM WRESTLING \n \nTeamwork and stamina are the keys, as you and your partner battle your way through the Title Matches on your quest for the Belt. Attack your opponents with Body Slams, Drop Kicks, Backbreakers, Flying Head Butts, or even throwing them out of the ring! To win, its a pin for a count of three. Nothing can match the super excitement as the crowd cheers over this mania on the mat. Prepare yourself for Tag Team Wrestling!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xwe9copzgxhhvcgaplv2.jpg", "width": 1000, "cloudinary_id": "xwe9copzgxhhvcgaplv2", "height": 1419}, "id": 36587, "name": "Tag Team Wrestling"}, {"genres": [14], "name": "Tennis", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tp0du1ylwwkpegxawzk3.jpg", "width": 350, "cloudinary_id": "tp0du1ylwwkpegxawzk3", "height": 351}, "summary": "Tennis is, as the name implies, Nintendo's version of the sport. One player vs computer or two players will compete in tennis in a more or less standard suite of rules (scoring, sets etc.). \n \nPlayers are controlled by the movement buttons, but while button A indicates a low hit, button B indicates a high one. You have the choice of four levels of computer AI, or two player via Game Boy link cable. The usual assortment of shots are available, including forehand and backhand, lobs and volleys when up close to the net.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/pvt1stlor3jxqovx4mhc.jpg", "width": 256, "cloudinary_id": "pvt1stlor3jxqovx4mhc", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/prnd4lkrqo2d4lcxxuyu.jpg", "width": 256, "cloudinary_id": "prnd4lkrqo2d4lcxxuyu", "height": 224}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ttemiovj73ouqdfbobyu.jpg", "width": 399, "cloudinary_id": "ttemiovj73ouqdfbobyu", "height": 360}], "id": 20461}, {"genres": [8, 33], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/uy0mjduwfzb8bqznnuyq.jpg", "width": 1000, "cloudinary_id": "uy0mjduwfzb8bqznnuyq", "height": 1405}, "id": 36671, "name": "Knightmare II: The Maze of Galious"}, {"genres": [5, 8], "summary": "In terms of story and level design the NES version differs considerably from the original arcade game and its home computer conversions.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/faiuciomrefry7axznsd.jpg", "width": 800, "cloudinary_id": "faiuciomrefry7axznsd", "height": 1132}, "id": 54535, "name": "Bionic Commando"}, {"genres": [16], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oedaovxhc2jj7iq411gn.jpg", "width": 465, "cloudinary_id": "oedaovxhc2jj7iq411gn", "height": 640}, "id": 46437, "name": "Battleship: The Classic Naval Warfare Game"}, {"genres": [8, 9], "name": "Impossible Mission II", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/nfuxv8lbp2e6wf43lqkq.jpg", "width": 634, "cloudinary_id": "nfuxv8lbp2e6wf43lqkq", "height": 630}, "summary": "You have 8 hours to prevent Elvin, a psychotic genius from destroying the world in this sequel to the highly successful Impossible Mission. Enter Elvin's tower fortress, avoid his robots, assemble security combinations for each tower, recover musical sequences and tie them together into a full melody to reach Elvin's central control room.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/axkjo6jrwv2nqwrbeciv.jpg", "width": 320, "cloudinary_id": "axkjo6jrwv2nqwrbeciv", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lgaly4ael1ch636ohgkn.jpg", "width": 320, "cloudinary_id": "lgaly4ael1ch636ohgkn", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xcntzvffqvefiwakqu3u.jpg", "width": 640, "cloudinary_id": "xcntzvffqvefiwakqu3u", "height": 400}], "id": 12154}, {"genres": [5, 33], "name": "Thexder", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mscg0uppgvqvmohzrffi.jpg", "width": 300, "cloudinary_id": "mscg0uppgvqvmohzrffi", "height": 378}, "summary": "Thexder is a robot capable of transforming into a jet whose job is to destroy the central computer to save the planet.15 stages are waiting you for in this shooting game.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/kxsds59t4kav6lv68vov.jpg", "width": 640, "cloudinary_id": "kxsds59t4kav6lv68vov", "height": 512}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/yp8smfpaiclvrrudidfi.jpg", "width": 640, "cloudinary_id": "yp8smfpaiclvrrudidfi", "height": 400}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/bajab8ocg5aypw5eofck.jpg", "width": 640, "cloudinary_id": "bajab8ocg5aypw5eofck", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/gsmcumdbmik6nc8ejc20.jpg", "width": 640, "cloudinary_id": "gsmcumdbmik6nc8ejc20", "height": 400}], "id": 9681}, {"genres": [8], "summary": "This game is based entirely on the first Star Wars movie, Episode IV: A New Hope. The opening of the game features an animated cinematic of the opening scene of the film. After that the player takes control of Luke Skywalker, driving the landspeeder across Tatooine in search of R2-D2. \n \nLuke Skywalker explores various locations throughout Tatooine, fighting numerous enemies including Jawas and Stormtroopers. The game features many locations from the movie including the Chalmun's Cantina in Mos Eisley where Luke meets Han Solo for the first time. This section of the game features a classic 8-bit rendition of the \"Cantina Band\" theme as played by the fictitious band, Figrin D'an and the Modal Nodes, in the feature film. The game also contains many famous lines from the movie including Obi-Wan Kenobi's plea to Luke to join him in his trip to Alderann and Han Solo's description of the smell from the Death Star's trash compactor. \n \nThe player eventually lands on the Death Star and has to destroy the tractor beam to escape. The game also features first person segments of piloting the Millenium Falcon through that Asteroid field that was once Alderaan, and shooting down Tie Fighters in both the Millenium Falcon and an X-Wing fighter. The finale of the game features a top down view of Luke Skywalker's X-Wing flying through the Death Star trenches. After the player successfully fires a torpedo into the Death Star's exposed exhaust port, a cinematic of the Death Star exploding and Luke Skywalker being awarded a medal on Yavin IV is shown. \n \nThe game featured the characters Luke Skywalker, Han Solo, Obi-Wan Kenobi, Princess Leia, R2-D2, and C-3PO. The game however does not feature Darth Vader or Chewbacca, both of whom are major characters in the film.", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/pkys2youpi2ktjxeoqzp.jpg", "width": 1402, "cloudinary_id": "pkys2youpi2ktjxeoqzp", "height": 1920}, "id": 54649, "name": "Star Wars"}, {"genres": [14], "name": "The Blue Marlin", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/oesjsugifm2043ml6rne.jpg", "width": 1547, "cloudinary_id": "oesjsugifm2043ml6rne", "height": 2100}, "summary": "The Blue Marlin was developed by Hot B in 1991 for the Nintendo Entertainment System. Following their earlier release The Black Bass, Hot B built on some of the original features for this fishing game. With the abilty to gradually increase attributes in muscle power, body strength, and skill; the player has more control over how the game is played compared to Black Bass.", "storyline": "Hot B presents the exhilarating and backbreaking challenge of saltwater fishing for the Nintendo Entertainment System. Below the warm blue waters, off the world's most famous deep sea fishing destinations, awaits the ultimate fishing trophy - The Blue Marlin! Match strength against the writhing frenzy of the powerful Blue Marlin. The Blue Marlin is not another fish story, it's a realistic fishing simulation guaranteed to get you hooked! The player will compete in a four-part tournament and try to come out on top with the biggest fish.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/ptfn4suxa3xi92lqyhcp.jpg", "width": 512, "cloudinary_id": "ptfn4suxa3xi92lqyhcp", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dyjhvkadwcv6l9m6iei8.jpg", "width": 640, "cloudinary_id": "dyjhvkadwcv6l9m6iei8", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/p2urnix7bkr6w73oaqa4.jpg", "width": 640, "cloudinary_id": "p2urnix7bkr6w73oaqa4", "height": 480}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/rlgztnfoghdi3kgpva9w.jpg", "width": 640, "cloudinary_id": "rlgztnfoghdi3kgpva9w", "height": 480}], "id": 48104}, {"genres": [14], "name": "TV Sports Baseball", "videos": [{"video_id": "hElQG-eHxVw", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/dfmwnwwahojwonyo142m.jpg", "width": 640, "cloudinary_id": "dfmwnwwahojwonyo142m", "height": 819}, "summary": "TV Sports: Baseball, known as Bo Jackson Baseball in the US and Canada, was released for the Nintendo Entertainment System and ported to the Amiga and IBM PC in 1990. The game is named after and features Bo Jackson, a professional baseball player in the 1980s.", "storyline": "Bo Jackson Baseball/TV Sports Baseball features a number of different modes, including exhibition, playoff, and CPU quick mode. The game uses city names, but the team names are fictional due to licencing issues. The players are also fictional, although some of the names are parodies of real-life players.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/hamiwsocu4aemgx44dmh.jpg", "width": 320, "cloudinary_id": "hamiwsocu4aemgx44dmh", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/hvlbesvvwzpo93w1dw4v.jpg", "width": 320, "cloudinary_id": "hvlbesvvwzpo93w1dw4v", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/zjwzqete7dna5tibmdig.jpg", "width": 320, "cloudinary_id": "zjwzqete7dna5tibmdig", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/jvuk4iunmat7zuoluis2.jpg", "width": 320, "cloudinary_id": "jvuk4iunmat7zuoluis2", "height": 256}], "id": 8673}, {"genres": [15, 33], "name": "Bomberman", "videos": [{"video_id": "mKIOVwqgSXM", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/glseylfam3cevdw9yifa.jpg", "width": 250, "cloudinary_id": "glseylfam3cevdw9yifa", "height": 343}, "summary": "Bomberman was released in 1983 as a home computer game available on the MSX, NEC PC-8801, NEC PC-6001, Sharp MZ-700 and FM-7 in Japan. It was released in a censored version under a different name (Eric and the Floaters) in Europe, and was later ported to the Nintendo Entertainment System in 1985. The game allows the player to navigate Bomberman through a series of mazes while avoiding enemies and clearing a path with bombs. It is an early creation of Hudson Soft, and spawned a long-running series of games revolving around the title character.", "storyline": "Set in a galaxy creatively named the Bomber Nebula, the original Bomberman did not incorporate an official storyline but focused purely on the puzzle aspect of the game. When Bomberman was re-released for the Nintendo Entertainment System, a story was incorporated into the gameplay. \nIn the NES version of Bomberman, the title character grows tired of making bombs in an underground factory in the Bungeling Empire. Bomberman finds out that if a robot is able to reach the surface, it can become human. The title character decides to escape, and is turned into an organic human being known as the \"Runner\".", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/g4qmnjtpcyvg1mvu7glp.jpg", "width": 320, "cloudinary_id": "g4qmnjtpcyvg1mvu7glp", "height": 200}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/m3mvpbxqtgvzwqa48sxe.jpg", "width": 256, "cloudinary_id": "m3mvpbxqtgvzwqa48sxe", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/k4ewrb1nb6putaxadtjc.jpg", "width": 320, "cloudinary_id": "k4ewrb1nb6putaxadtjc", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/odh91hny1kvjpp7z3i09.jpg", "width": 256, "cloudinary_id": "odh91hny1kvjpp7z3i09", "height": 240}], "id": 3445}, {"genres": [8], "name": "Nebulus", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/lpvksytrznx8cjgcty9h.jpg", "width": 250, "cloudinary_id": "lpvksytrznx8cjgcty9h", "height": 332}, "summary": "You play a small green guy who needs to blow up eight towers, because their presence is somehow poisoning the water of planets which could potentially be ideal colonies. Unfortunately you need to get to the top of these towers to blow them up. \n \nYou make your way up to the top of the tower via walkways around the outside of the towers. You need to jump over, kick, and run from various enemies in your journey to the top. Most vertical movement is achieved by jumping onto moving ledges at the right moment. \n \nThe game was considered revolutionary in its time for its graphic technique. As the main character walked around the outside of the tower, the character was fixed in the middle of the screen while the tower itself rotated. This gave it a pseudo-3D effect. \n \nTowers are linked together via a voyage through the sea in your trusty MK.7 submarine. This plays out as a side-scrolling collect-'em-up in which bonus points can be obtained.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/jwhulog7l2oop3gajtqo.jpg", "width": 320, "cloudinary_id": "jwhulog7l2oop3gajtqo", "height": 256}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xcxvpnavfa8emgt5t7ct.jpg", "width": 320, "cloudinary_id": "xcxvpnavfa8emgt5t7ct", "height": 200}], "id": 7817}, {"cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/xpplyxfrddzpipikwaiz.jpg", "width": 800, "cloudinary_id": "xpplyxfrddzpipikwaiz", "height": 779}, "genres": [14, 33], "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/xwscbnlthjgbm3yv0721.jpg", "width": 640, "cloudinary_id": "xwscbnlthjgbm3yv0721", "height": 400}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ioj2sllrp1mocikpplif.jpg", "width": 640, "cloudinary_id": "ioj2sllrp1mocikpplif", "height": 400}], "id": 12267, "name": "Skate or Die"}, {"genres": [5], "name": "Cybernoid: The Fighting Machine", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ivxthbcdtx4vlzil2fmg.jpg", "width": 640, "cloudinary_id": "ivxthbcdtx4vlzil2fmg", "height": 665}, "summary": "Cybernoid: The Fighting Machine is a shoot 'em up developed and published in 1987 by Hewson Consultants for the ZX Spectrum, and was then ported to the Amstrad CPC, Atari ST, Commodore 64, NES, and Amiga. It was programmed by Raffaele Cecco. The Sinclair ZX Spectrum and Atari ST versions featured a main theme by Dave Rogers, while the Commodore C64 version (later released on the Wii's Virtual Console service) featured a completely different theme by Jeroen Tel.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/csik0uhwc61xfyjiqgmw.jpg", "width": 320, "cloudinary_id": "csik0uhwc61xfyjiqgmw", "height": 256}], "id": 12024}, {"genres": [9], "name": "Bomberman II", "videos": [{"video_id": "7K6Ktv6G_j0", "name": "Gameplay video"}], "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/mqh2juyourxck3x82oem.jpg", "width": 220, "cloudinary_id": "mqh2juyourxck3x82oem", "height": 303}, "summary": "Bomberman II follows the popular NES game Bomberman, incorporating a number of new features to the series. The game maintained the classic Bomberman game-type, requiring the player to navigate a maze of blocks using bombs to make a path. It added a two-player and three-player mode, and had a more developed storyline. The game was developed by Hudson Soft and released on the Family Computer and the NES. It was marketed as Dynablaster in Europe.", "storyline": "The player controls White Bomberman, who is framed for the terrible crimes committed by Black Bomberman. After being accused of robbing a bank, White Bomberman is thrown in jail. The player must navigate White Bomberman through a series of puzzles to escape his prison cell and bring Black Bomberman to justice.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/sv0yngwtts1l9ejnz5bx.jpg", "width": 256, "cloudinary_id": "sv0yngwtts1l9ejnz5bx", "height": 240}, {"url": "//images.igdb.com/igdb/image/upload/t_thumb/ibl7s4i8ljbpmbnsh9pf.jpg", "width": 512, "cloudinary_id": "ibl7s4i8ljbpmbnsh9pf", "height": 480}], "id": 3447}, {"genres": [5, 33], "name": "Flying Shark", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/fn5hbvi7kwkmmksdzk7g.jpg", "width": 1000, "cloudinary_id": "fn5hbvi7kwkmmksdzk7g", "height": 1430}, "summary": "Flying Shark (飛翔鮫 Hishōzame?), released in North America as Sky Shark, is a 1987 vertical scrolling shooter arcade game developed by Toaplan and published by Taito in Japan, Electrocoin in the United Kingdom, Model Racing in Italy, and Romstar in North America. \n \nIn 1989, the game received a sequel titled Zame! Zame! Zame!.", "screenshots": [{"url": "//images.igdb.com/igdb/image/upload/t_thumb/wwtsqqb7l8m8djoobyra.jpg", "width": 320, "cloudinary_id": "wwtsqqb7l8m8djoobyra", "height": 256}], "id": 12106}, {"genres": [5, 33], "summary": "When we last saw Paul and Vince, they had saved the Colonel and were about to head for home in a special plane given to them by the General. But then, while in flight over the ocean, the sky suddenly blackens - the ocean begins to churn - and the plane goes spinning! A booming voice fills the cockpit: \"Hear me, Warriors! Zang Zip, the War Dog, has enslaved the people of Earth. Only you can save us from his grip of evil!\" Caught in a time warp, hurled thousands of years into the future, Paul and Vince know they have no choice but to meet this impossible challenge head-on. After all, they are professionals... they are the Ikari Warriors!", "cover": {"url": "//images.igdb.com/igdb/image/upload/t_thumb/tlwqpiuep8hvgqjjjutx.jpg", "width": 1528, "cloudinary_id": "tlwqpiuep8hvgqjjjutx", "height": 2100}, "id": 48055, "name": "Ikari Warriors II: Victory Road"}]